use gitlab_routes::{constraints, routes};
use std::error::Error;
use wayfind::Router;

#[path = "../benches/gitlab_routes.rs"]
pub mod gitlab_routes;

#[test]
fn test_gitlab_insert() -> Result<(), Box<dyn Error>> {
    let mut router = Router::new();
    constraints(&mut router);

    for route in routes() {
        let route = route.build()?;
        router.insert(&route, true)?;
    }

    Ok(())
}

#[test]
fn test_gitlab_delete() -> Result<(), Box<dyn Error>> {
    let mut router = Router::new();
    constraints(&mut router);

    for route in routes() {
        let route = route.build()?;
        router.insert(&route, true)?;
    }

    for route in routes() {
        let route = route.build()?;
        router.delete(&route)?;
    }

    insta::assert_snapshot!(router, @r"
    === Path
    Empty
    === Method
    Empty
    === Chains
    Empty
    ");

    Ok(())
}

#[test]
fn test_gitlab_display() -> Result<(), Box<dyn Error>> {
    let mut router = Router::new();
    constraints(&mut router);

    for route in routes() {
        let route = route.build()?;
        router.insert(&route, true)?;
    }

    insta::assert_snapshot!(router, @r"
    === Path
    / [6]
    ├─ toogle_engine [1987]
    │  ╰─ /
    │     ├─ definitions [1985]
    │     │  ╰─ .
    │     │     ╰─ {format} [1985]
    │     ╰─ {id} [1986]
    │        ╰─ .
    │           ╰─ {format} [1986]
    ├─ jwt/auth [5]
    │  ╰─ .
    │     ╰─ {format} [5]
    ├─ dashboard [342]
    │  ├─ .
    │  │  ╰─ {format} [342]
    │  ╰─ /
    │     ├─ todos [354]
    │     │  ├─ .
    │     │  │  ╰─ {format} [354]
    │     │  ╰─ /
    │     │     ├─ bulk_restore [351]
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [351]
    │     │     ├─ destroy_all [353]
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [353]
    │     │     ├─ vue [356]
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [356]
    │     │     ╰─ {id} [352]
    │     │        ├─ /restore [355]
    │     │        │  ╰─ .
    │     │        │     ╰─ {format} [355]
    │     │        ╰─ .
    │     │           ╰─ {format} [352]
    │     ├─ activity [333]
    │     │  ╰─ .
    │     │     ╰─ {format} [333]
    │     ├─ projects [343]
    │     │  ├─ /
    │     │  │  ├─ contributed [344]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [344]
    │     │  │  ├─ inactive [345]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [345]
    │     │  │  ├─ personal [347]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [347]
    │     │  │  ├─ removed [348]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [348]
    │     │  │  ├─ starred [349]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [349]
    │     │  │  ╰─ member [346]
    │     │  │     ╰─ .
    │     │  │        ╰─ {format} [346]
    │     │  ╰─ .
    │     │     ╰─ {format} [343]
    │     ├─ snippets [350]
    │     │  ╰─ .
    │     │     ╰─ {format} [350]
    │     ├─ groups [339]
    │     │  ╰─ .
    │     │     ╰─ {format} [339]
    │     ├─ issues [334]
    │     │  ╰─ .
    │     │     ├─ ics [335]
    │     │     ╰─ {format} [334]
    │     ├─ labels [340]
    │     │  ╰─ .
    │     │     ╰─ {format} [340]
    │     ╰─ m
    │        ├─ erge_requests [336]
    │        │  ├─ /
    │        │  │  ├─ following [337]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [337]
    │        │  │  ╰─ search [338]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [338]
    │        │  ╰─ .
    │        │     ╰─ {format} [336]
    │        ╰─ ilestones [341]
    │           ╰─ .
    │              ╰─ {format} [341]
    ├─ explore [367]
    │  ├─ .
    │  │  ╰─ {format} [367]
    │  ╰─ /
    │     ├─ dependencies [365]
    │     │  ╰─ .
    │     │     ╰─ {format} [365]
    │     ├─ projects [368]
    │     │  ├─ /
    │     │  │  ├─ starred [371]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [371]
    │     │  │  ╰─ t
    │     │  │     ├─ rending [374]
    │     │  │     │  ╰─ .
    │     │  │     │     ╰─ {format} [374]
    │     │  │     ╰─ opics [373]
    │     │  │        ├─ .
    │     │  │        │  ╰─ {format} [373]
    │     │  │        ╰─ /
    │     │  │           ╰─ {topic_name:33} [372]
    │     │  │              ╰─ .
    │     │  │                 ╰─ {format:32} [372]
    │     │  ╰─ .
    │     │     ╰─ {format} [368]
    │     ├─ snippets [375]
    │     │  ╰─ .
    │     │     ╰─ {format} [375]
    │     ├─ catalog [363]
    │     │  ├─ .
    │     │  │  ╰─ {format} [363]
    │     │  ╰─ /
    │     │     ├─ {*full_path}
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [364]
    │     │     ╰─ {*full_path} [364]
    │     ╰─ groups [366]
    │        ╰─ .
    │           ╰─ {format} [366]
    ├─ u
    │  ├─ sers [1870]
    │  │  ├─ .
    │  │  │  ╰─ {format} [1870]
    │  │  ╰─ /
    │  │     ├─ identity_verification [2067]
    │  │     │  ├─ .
    │  │     │  │  ╰─ {format} [2067]
    │  │     │  ╰─ /
    │  │     │     ├─ toggle_phone_exemption [2069]
    │  │     │     │  ╰─ .
    │  │     │     │     ╰─ {format} [2069]
    │  │     │     ├─ arkose_labs_challenge [2063]
    │  │     │     │  ╰─ .
    │  │     │     │     ╰─ {format} [2063]
    │  │     │     ├─ verif
    │  │     │     │  ├─ y_
    │  │     │     │  │  ├─ phone_verification_code [2075]
    │  │     │     │  │  │  ╰─ .
    │  │     │     │  │  │     ╰─ {format} [2075]
    │  │     │     │  │  ├─ arkose_labs_session [2071]
    │  │     │     │  │  │  ╰─ .
    │  │     │     │  │  │     ╰─ {format} [2071]
    │  │     │     │  │  ├─ credit_card [2072]
    │  │     │     │  │  │  ├─ _captcha [2073]
    │  │     │     │  │  │  │  ╰─ .
    │  │     │     │  │  │  │     ╰─ {format} [2073]
    │  │     │     │  │  │  ╰─ .
    │  │     │     │  │  │     ╰─ {format} [2072]
    │  │     │     │  │  ╰─ email_code [2074]
    │  │     │     │  │     ╰─ .
    │  │     │     │  │        ╰─ {format} [2074]
    │  │     │     │  ╰─ ication_state [2070]
    │  │     │     │     ╰─ .
    │  │     │     │        ╰─ {format} [2070]
    │  │     │     ├─ res
    │  │     │     │  ├─ end_email_code [2064]
    │  │     │     │  │  ╰─ .
    │  │     │     │  │     ╰─ {format} [2064]
    │  │     │     │  ╰─ tricted [2065]
    │  │     │     │     ╰─ .
    │  │     │     │        ╰─ {format} [2065]
    │  │     │     ╰─ s
    │  │     │        ├─ end_phone_verification_code [2066]
    │  │     │        │  ╰─ .
    │  │     │        │     ╰─ {format} [2066]
    │  │     │        ╰─ uccess [2068]
    │  │     │           ╰─ .
    │  │     │              ╰─ {format} [2068]
    │  │     ├─ resend_verification_code [1959]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [1959]
    │  │     ├─ password [962]
    │  │     │  ├─ /
    │  │     │  │  ├─ complexity [961]
    │  │     │  │  │  ╰─ .
    │  │     │  │  │     ╰─ {format} [961]
    │  │     │  │  ├─ edit [963]
    │  │     │  │  │  ╰─ .
    │  │     │  │  │     ╰─ {format} [963]
    │  │     │  │  ╰─ new [964]
    │  │     │  │     ╰─ .
    │  │     │  │        ╰─ {format} [964]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [962]
    │  │     ├─ edit [1872]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [1872]
    │  │     ├─ a
    │  │     │  ├─ uth [1811]
    │  │     │  │  ├─ /
    │  │     │  │  │  ├─ kerberos/negotiate [941]
    │  │     │  │  │  │  ╰─ .
    │  │     │  │  │  │     ╰─ {format} [941]
    │  │     │  │  │  ╰─ geo/sign_
    │  │     │  │  │     ├─ out [1955]
    │  │     │  │  │     │  ╰─ .
    │  │     │  │  │     │     ╰─ {format} [1955]
    │  │     │  │  │     ╰─ in [1953]
    │  │     │  │  │        ╰─ .
    │  │     │  │  │           ╰─ {format} [1953]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [1811]
    │  │     │  ╰─ lmost_there [323]
    │  │     │     ╰─ .
    │  │     │        ╰─ {format} [323]
    │  │     ├─ c
    │  │     │  ├─ onfirmation [325]
    │  │     │  │  ├─ /new [327]
    │  │     │  │  │  ╰─ .
    │  │     │  │  │     ╰─ {format} [327]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [325]
    │  │     │  ╰─ ancel [1869]
    │  │     │     ╰─ .
    │  │     │        ╰─ {format} [1869]
    │  │     ├─ s
    │  │     │  ├─ uccessful_verification [1960]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [1960]
    │  │     │  ╰─ ign_
    │  │     │     ├─ out [1956]
    │  │     │     │  ╰─ .
    │  │     │     │     ╰─ {format} [1956]
    │  │     │     ├─ in [1954]
    │  │     │     │  ╰─ .
    │  │     │     │     ╰─ {format} [1954]
    │  │     │     ╰─ up [1873]
    │  │     │        ├─ /
    │  │     │        │  ├─ company [1876]
    │  │     │        │  │  ├─ /new [1877]
    │  │     │        │  │  │  ╰─ .
    │  │     │        │  │  │     ╰─ {format} [1877]
    │  │     │        │  │  ╰─ .
    │  │     │        │  │     ╰─ {format} [1876]
    │  │     │        │  ├─ welcome [1880]
    │  │     │        │  │  ╰─ .
    │  │     │        │  │     ╰─ {format} [1880]
    │  │     │        │  ╰─ groups [1878]
    │  │     │        │     ├─ /new [1879]
    │  │     │        │     │  ╰─ .
    │  │     │        │     │     ╰─ {format} [1879]
    │  │     │        │     ╰─ .
    │  │     │        │        ╰─ {format} [1878]
    │  │     │        ╰─ .
    │  │     │           ╰─ {format} [1873]
    │  │     ├─ u
    │  │     │  ├─ pdate_email [1961]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [1961]
    │  │     │  ╰─ nlock [357]
    │  │     │     ├─ /new [358]
    │  │     │     │  ╰─ .
    │  │     │     │     ╰─ {format} [358]
    │  │     │     ╰─ .
    │  │     │        ╰─ {format} [357]
    │  │     ╰─ {username:35} [1854]
    │  │        ├─ /
    │  │        │  ├─ projects [2042]
    │  │        │  │  ╰─ .
    │  │        │  │     ╰─ {format} [2042]
    │  │        │  ├─ unfollow [2047]
    │  │        │  │  ╰─ .
    │  │        │  │     ╰─ {format} [2047]
    │  │        │  ├─ exists [2036]
    │  │        │  │  ╰─ .
    │  │        │  │     ╰─ {format} [2036]
    │  │        │  ├─ follow [2037]
    │  │        │  │  ├─ ers [2038]
    │  │        │  │  │  ╰─ .
    │  │        │  │  │     ╰─ {format} [2038]
    │  │        │  │  ├─ ing [2039]
    │  │        │  │  │  ╰─ .
    │  │        │  │  │     ╰─ {format} [2039]
    │  │        │  │  ╰─ .
    │  │        │  │     ╰─ {format} [2037]
    │  │        │  ├─ groups [2041]
    │  │        │  │  ╰─ .
    │  │        │  │     ╰─ {format} [2041]
    │  │        │  ├─ a
    │  │        │  │  ├─ vailable_
    │  │        │  │  │  ├─ project_templates [2032]
    │  │        │  │  │  │  ╰─ .
    │  │        │  │  │  │     ╰─ {format} [2032]
    │  │        │  │  │  ╰─ group_templates [2031]
    │  │        │  │  │     ╰─ .
    │  │        │  │  │        ╰─ {format} [2031]
    │  │        │  │  ╰─ ctivity [2030]
    │  │        │  │     ╰─ .
    │  │        │  │        ╰─ {format} [2030]
    │  │        │  ├─ c
    │  │        │  │  ├─ ontributed [2035]
    │  │        │  │  │  ╰─ .
    │  │        │  │  │     ╰─ {format} [2035]
    │  │        │  │  ╰─ alendar [2033]
    │  │        │  │     ├─ _activities [2034]
    │  │        │  │     │  ╰─ .
    │  │        │  │     │     ╰─ {format} [2034]
    │  │        │  │     ╰─ .
    │  │        │  │        ╰─ {format} [2033]
    │  │        │  ╰─ s
    │  │        │     ├─ nippets [2044]
    │  │        │     │  ╰─ .
    │  │        │     │     ╰─ {format} [2044]
    │  │        │     ╰─ tarred [2046]
    │  │        │        ╰─ .
    │  │        │           ╰─ {format} [2046]
    │  │        ╰─ .
    │  │           ╰─ {format} [1854]
    │  ├─ nsubscribes/
    │  │  ╰─ {email} [2079]
    │  │     ╰─ .
    │  │        ╰─ {format} [2079]
    │  ╰─ ploads/
    │     ├─ -/system/
    │     │  ├─ temp/
    │     │  │  ╰─ {secret}
    │     │  │     ╰─ /
    │     │  │        ╰─ {filename:0} [1995]
    │     │  │           ╰─ .
    │     │  │              ╰─ {format} [1995]
    │     │  ├─ {model:21}
    │     │  │  ╰─ /
    │     │  │     ╰─ {mounted_as:22}
    │     │  │        ╰─ /
    │     │  │           ╰─ {id}
    │     │  │              ╰─ /
    │     │  │                 ╰─ {filename:0} [1996]
    │     │  │                    ╰─ .
    │     │  │                       ╰─ {format} [1996]
    │     │  ├─ {model:23}
    │     │  │  ╰─ /
    │     │  │     ╰─ {mounted_as:24}
    │     │  │        ╰─ /
    │     │  │           ╰─ {id}
    │     │  │              ╰─ /
    │     │  │                 ╰─ {filename:0} [1997]
    │     │  │                    ╰─ .
    │     │  │                       ╰─ {format} [1997]
    │     │  ├─ {model:25}
    │     │  │  ╰─ /
    │     │  │     ╰─ {id:3}
    │     │  │        ╰─ /
    │     │  │           ╰─ {secret}
    │     │  │              ╰─ /
    │     │  │                 ╰─ {filename:0} [1998]
    │     │  │                    ╰─ .
    │     │  │                       ╰─ {format} [1998]
    │     │  ├─ {model:27}
    │     │  │  ╰─ /
    │     │  │     ╰─ {mounted_as:28}
    │     │  │        ╰─ /
    │     │  │           ╰─ {id}
    │     │  │              ╰─ /
    │     │  │                 ╰─ {filename:26} [1999]
    │     │  │                    ╰─ .
    │     │  │                       ╰─ {format} [1999]
    │     │  ├─ {model:29}
    │     │  │  ╰─ /
    │     │  │     ╰─ {mounted_as:22}
    │     │  │        ╰─ /
    │     │  │           ╰─ {id}
    │     │  │              ╰─ /
    │     │  │                 ╰─ {filename:0} [2000]
    │     │  │                    ╰─ .
    │     │  │                       ╰─ {format} [2000]
    │     │  ╰─ {model:30}
    │     │     ╰─ /
    │     │        ╰─ {mounted_as:31}
    │     │           ╰─ /
    │     │              ╰─ {id}
    │     │                 ╰─ /
    │     │                    ╰─ {filename:0} [2001]
    │     │                       ╰─ .
    │     │                          ╰─ {format} [2001]
    │     ╰─ {model:25} [1994]
    │        ├─ /authorize [1993]
    │        │  ╰─ .
    │        │     ╰─ {format} [1993]
    │        ╰─ .
    │           ╰─ {format} [1994]
    ├─ v2 [505]
    │  ╰─ /
    │     ╰─ {*group_id}
    │        ╰─ /dependency_proxy/containers/
    │           ╰─ {*image:19}
    │              ╰─ /
    │                 ├─ manifests/
    │                 │  ├─ {*tag}
    │                 │  │  ╰─ /upload [511]
    │                 │  │     ╰─ /authorize [507]
    │                 │  ╰─ {*tag} [509]
    │                 ╰─ blobs/
    │                    ╰─ {sha:20} [508]
    │                       ╰─ /upload [510]
    │                          ╰─ /authorize [506]
    ├─ .well-known/
    │  ├─ change-password [1859]
    │  │  ╰─ .
    │  │     ╰─ {format} [1859]
    │  ├─ terraform.json [1983]
    │  │  ╰─ .
    │  │     ╰─ {format} [1983]
    │  ├─ security.txt [2081]
    │  │  ╰─ .
    │  │     ╰─ {format} [2081]
    │  ├─ webfinger [891]
    │  │  ╰─ .
    │  │     ╰─ {format} [891]
    │  ╰─ o
    │     ├─ auth-authorization-server [888]
    │     │  ╰─ .
    │     │     ╰─ {format} [888]
    │     ╰─ penid-configuration [889]
    │        ╰─ .
    │           ╰─ {format} [889]
    ├─ import/
    │  ├─ url/validate [862]
    │  │  ╰─ .
    │  │     ╰─ {format} [862]
    │  ├─ manifest [854]
    │  │  ├─ /
    │  │  │  ├─ realtime_changes [856]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [856]
    │  │  │  ├─ status [857]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [857]
    │  │  │  ├─ upload [858]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [858]
    │  │  │  ╰─ new [855]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [855]
    │  │  ╰─ .
    │  │     ╰─ {format} [854]
    │  ├─ fogbugz [825]
    │  │  ├─ /
    │  │  │  ├─ realtime_changes [829]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [829]
    │  │  │  ├─ callback [824]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [824]
    │  │  │  ├─ user_map [826]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [826]
    │  │  │  ├─ status [830]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [830]
    │  │  │  ╰─ new [827]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [827]
    │  │  ╰─ .
    │  │     ╰─ {format} [825]
    │  ├─ history [853]
    │  │  ╰─ .
    │  │     ╰─ {format} [853]
    │  ├─ source_users/
    │  │  ╰─ {reassignment_token} [861]
    │  │     ├─ .
    │  │     │  ╰─ {format} [861]
    │  │     ╰─ /
    │  │        ├─ decline [860]
    │  │        │  ╰─ .
    │  │        │     ╰─ {format} [860]
    │  │        ╰─ accept [859]
    │  │           ╰─ .
    │  │              ╰─ {format} [859]
    │  ├─ git
    │  │  ├─ lab_
    │  │  │  ├─ project [851]
    │  │  │  │  ├─ /
    │  │  │  │  │  ├─ authorize [850]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [850]
    │  │  │  │  │  ╰─ new [852]
    │  │  │  │  │     ╰─ .
    │  │  │  │  │        ╰─ {format} [852]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [851]
    │  │  │  ╰─ group [849]
    │  │  │     ├─ /authorize [848]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [848]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [849]
    │  │  ├─ hub [840]
    │  │  │  ├─ _group/status [847]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [847]
    │  │  │  ├─ .
    │  │  │  │  ╰─ {format} [840]
    │  │  │  ╰─ /
    │  │  │     ├─ personal_access_token [844]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [844]
    │  │  │     ├─ realtime_changes [845]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [845]
    │  │  │     ├─ failures [842]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [842]
    │  │  │     ├─ details [841]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [841]
    │  │  │     ├─ status [846]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [846]
    │  │  │     ├─ new [843]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [843]
    │  │  │     ╰─ c
    │  │  │        ├─ ounts [839]
    │  │  │        │  ╰─ .
    │  │  │        │     ╰─ {format} [839]
    │  │  │        ╰─ a
    │  │  │           ├─ llback [836]
    │  │  │           │  ╰─ .
    │  │  │           │     ╰─ {format} [836]
    │  │  │           ╰─ ncel [837]
    │  │  │              ├─ _all [838]
    │  │  │              │  ╰─ .
    │  │  │              │     ╰─ {format} [838]
    │  │  │              ╰─ .
    │  │  │                 ╰─ {format} [837]
    │  │  ╰─ ea [831]
    │  │     ├─ /
    │  │     │  ├─ personal_access_token [833]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [833]
    │  │     │  ├─ realtime_changes [834]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [834]
    │  │     │  ├─ status [835]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [835]
    │  │     │  ╰─ new [832]
    │  │     │     ╰─ .
    │  │     │        ╰─ {format} [832]
    │  │     ╰─ .
    │  │        ╰─ {format} [831]
    │  ╰─ b
    │     ├─ ulk_imports [818]
    │     │  ├─ /
    │     │  │  ├─ realtime_changes [822]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [822]
    │     │  │  ├─ configure [817]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [817]
    │     │  │  ├─ history [820]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [820]
    │     │  │  ├─ status [823]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [823]
    │     │  │  ╰─ {id}
    │     │  │     ╰─ /history [821]
    │     │  │        ├─ .
    │     │  │        │  ╰─ {format} [821]
    │     │  │        ╰─ /
    │     │  │           ╰─ {entity_id}
    │     │  │              ╰─ /failures [819]
    │     │  │                 ╰─ .
    │     │  │                    ╰─ {format} [819]
    │     │  ╰─ .
    │     │     ╰─ {format} [818]
    │     ╰─ itbucket [808]
    │        ├─ _server [813]
    │        │  ├─ /
    │        │  │  ├─ realtime_changes [815]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [815]
    │        │  │  ├─ status [816]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [816]
    │        │  │  ├─ new [814]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [814]
    │        │  │  ╰─ c
    │        │  │     ├─ onfigure [812]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [812]
    │        │  │     ╰─ allback [811]
    │        │  │        ╰─ .
    │        │  │           ╰─ {format} [811]
    │        │  ╰─ .
    │        │     ╰─ {format} [813]
    │        ├─ .
    │        │  ╰─ {format} [808]
    │        ╰─ /
    │           ├─ realtime_changes [809]
    │           │  ╰─ .
    │           │     ╰─ {format} [809]
    │           ├─ callback [807]
    │           │  ╰─ .
    │           │     ╰─ {format} [807]
    │           ╰─ status [810]
    │              ╰─ .
    │                 ╰─ {format} [810]
    ├─ oauth/
    │  ├─ introspect [938]
    │  │  ╰─ .
    │  │     ╰─ {format} [938]
    │  ├─ userinfo [360]
    │  │  ╰─ .
    │  │     ╰─ {format} [360]
    │  ├─ revoke [939]
    │  │  ╰─ .
    │  │     ╰─ {format} [939]
    │  ├─ token [936]
    │  │  ├─ /info [935]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [935]
    │  │  ╰─ .
    │  │     ╰─ {format} [936]
    │  ├─ geo/
    │  │  ├─ callback [933]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [933]
    │  │  ├─ logout [934]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [934]
    │  │  ╰─ auth [932]
    │  │     ╰─ .
    │  │        ╰─ {format} [932]
    │  ├─ a
    │  │  ├─ pplications [912]
    │  │  │  ├─ .
    │  │  │  │  ╰─ {format} [912]
    │  │  │  ╰─ /
    │  │  │     ├─ new [917]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [917]
    │  │  │     ╰─ {id} [913]
    │  │  │        ├─ /
    │  │  │        │  ├─ renew [918]
    │  │  │        │  │  ╰─ .
    │  │  │        │  │     ╰─ {format} [918]
    │  │  │        │  ╰─ edit [914]
    │  │  │        │     ╰─ .
    │  │  │        │        ╰─ {format} [914]
    │  │  │        ╰─ .
    │  │  │           ╰─ {format} [913]
    │  │  ╰─ uthorize [922]
    │  │     ├─ /native [925]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [925]
    │  │     ├─ d_applications [927]
    │  │     │  ├─ .
    │  │     │  │  ╰─ {format} [927]
    │  │     │  ╰─ /
    │  │     │     ╰─ {id} [926]
    │  │     │        ╰─ .
    │  │     │           ╰─ {format} [926]
    │  │     ├─ _device [931]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [931]
    │  │     ╰─ .
    │  │        ╰─ {format} [922]
    │  ╰─ d
    │     ├─ iscovery/keys [886]
    │     │  ╰─ .
    │     │     ╰─ {format} [886]
    │     ╰─ evice [928]
    │        ├─ /confirm [929]
    │        │  ╰─ .
    │        │     ╰─ {format} [929]
    │        ╰─ .
    │           ╰─ {format} [928]
    ├─ rails/
    │  ├─ features [12]
    │  ├─ mailers [1801]
    │  │  ├─ .
    │  │  │  ╰─ {format} [1801]
    │  │  ╰─ /
    │  │     ╰─ {path} [1802]
    │  │        ╰─ .
    │  │           ╰─ {format} [1802]
    │  ├─ info [1798]
    │  │  ├─ /
    │  │  │  ├─ properties [1799]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [1799]
    │  │  │  ╰─ routes [1800]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [1800]
    │  │  ╰─ .
    │  │     ╰─ {format} [1798]
    │  ╰─ l
    │     ├─ etter_opener [8]
    │     ╰─ ookbook [9]
    ├─ -/
    │  ├─ http_router/version [4]
    │  │  ╰─ .
    │  │     ╰─ {format} [4]
    │  ├─ kubernetes [321]
    │  │  ├─ .
    │  │  │  ╰─ {format} [321]
    │  │  ╰─ /
    │  │     ╰─ {agent_id} [322]
    │  │        ├─ .
    │  │        │  ╰─ {format} [322]
    │  │        ╰─ /
    │  │           ├─ {*vueroute}
    │  │           │  ╰─ .
    │  │           │     ╰─ {format} [322]
    │  │           ╰─ {*vueroute} [322]
    │  ├─ whats_new [2082]
    │  │  ╰─ .
    │  │     ╰─ {format} [2082]
    │  ├─ liveness [781]
    │  │  ╰─ .
    │  │     ╰─ {format} [781]
    │  ├─ user
    │  │  ├─ s/
    │  │  │  ├─ broadcast_message_dismissals [2048]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [2048]
    │  │  │  ├─ group_callouts [2050]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [2050]
    │  │  │  ├─ callouts [2049]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [2049]
    │  │  │  ├─ terms [2078]
    │  │  │  │  ├─ .
    │  │  │  │  │  ╰─ {format} [2078]
    │  │  │  │  ╰─ /
    │  │  │  │     ╰─ {id}
    │  │  │  │        ╰─ /
    │  │  │  │           ├─ decline [2077]
    │  │  │  │           │  ╰─ .
    │  │  │  │           │     ╰─ {format} [2077]
    │  │  │  │           ╰─ accept [2076]
    │  │  │  │              ╰─ .
    │  │  │  │                 ╰─ {format} [2076]
    │  │  │  ╰─ p
    │  │  │     ├─ roject_callouts [2062]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [2062]
    │  │  │     ╰─ ins [2060]
    │  │  │        ╰─ .
    │  │  │           ╰─ {format} [2060]
    │  │  ╰─ _settings/
    │  │     ├─ identities [2009]
    │  │     │  ├─ /new [2010]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [2010]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [2009]
    │  │     ├─ gpg_keys [2005]
    │  │     │  ├─ .
    │  │     │  │  ╰─ {format} [2005]
    │  │     │  ╰─ /
    │  │     │     ╰─ {id} [2006]
    │  │     │        ├─ /revoke [2008]
    │  │     │        │  ╰─ .
    │  │     │        │     ╰─ {format} [2008]
    │  │     │        ╰─ .
    │  │     │           ╰─ {format} [2006]
    │  │     ├─ ssh_keys [2024]
    │  │     │  ├─ .
    │  │     │  │  ╰─ {format} [2024]
    │  │     │  ╰─ /
    │  │     │     ╰─ {id} [2025]
    │  │     │        ├─ /revoke [2027]
    │  │     │        │  ╰─ .
    │  │     │        │     ╰─ {format} [2027]
    │  │     │        ╰─ .
    │  │     │           ╰─ {format} [2025]
    │  │     ├─ a
    │  │     │  ├─ uthentication_log [2029]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [2029]
    │  │     │  ├─ ctive_sessions [2003]
    │  │     │  │  ├─ .
    │  │     │  │  │  ╰─ {format} [2003]
    │  │     │  │  ╰─ /
    │  │     │  │     ├─ saml [2004]
    │  │     │  │     │  ╰─ .
    │  │     │  │     │     ╰─ {format} [2004]
    │  │     │  │     ╰─ {id} [2002]
    │  │     │  │        ╰─ .
    │  │     │  │           ╰─ {format} [2002]
    │  │     │  ╰─ pplications [915]
    │  │     │     ╰─ .
    │  │     │        ╰─ {format} [915]
    │  │     ╰─ p
    │  │        ├─ ersonal_access_tokens [2017]
    │  │        │  ├─ .
    │  │        │  │  ╰─ {format} [2017]
    │  │        │  ╰─ /
    │  │        │     ╰─ {id}
    │  │        │        ╰─ /r
    │  │        │           ├─ evoke [2019]
    │  │        │           │  ╰─ .
    │  │        │           │     ╰─ {format} [2019]
    │  │        │           ╰─ otate [2020]
    │  │        │              ╰─ .
    │  │        │                 ╰─ {format} [2020]
    │  │        ├─ assword [2011]
    │  │        │  ├─ /
    │  │        │  │  ├─ reset [2014]
    │  │        │  │  │  ╰─ .
    │  │        │  │  │     ╰─ {format} [2014]
    │  │        │  │  ├─ edit [2012]
    │  │        │  │  │  ╰─ .
    │  │        │  │  │     ╰─ {format} [2012]
    │  │        │  │  ╰─ new [2013]
    │  │        │  │     ╰─ .
    │  │        │  │        ╰─ {format} [2013]
    │  │        │  ╰─ .
    │  │        │     ╰─ {format} [2011]
    │  │        ╰─ rofile [2021]
    │  │           ╰─ .
    │  │              ╰─ {format} [2021]
    │  ├─ ex
    │  │  ├─ ternal_redirect [376]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [376]
    │  │  ╰─ periment [7]
    │  ├─ a
    │  │  ├─ rkose/data_exchange_payload [292]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [292]
    │  │  ├─ utocomplete/
    │  │  │  ├─ deploy_keys_with_owners [303]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [303]
    │  │  │  ├─ namespace_routes [307]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [307]
    │  │  │  ├─ group_subgroups [304]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [304]
    │  │  │  ├─ award_emojis [302]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [302]
    │  │  │  ├─ merge_request_
    │  │  │  │  ├─ source_branches [305]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [305]
    │  │  │  │  ╰─ target_branches [306]
    │  │  │  │     ╰─ .
    │  │  │  │        ╰─ {format} [306]
    │  │  │  ├─ project
    │  │  │  │  ├─ s [310]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [310]
    │  │  │  │  ╰─ _
    │  │  │  │     ├─ groups [308]
    │  │  │  │     │  ╰─ .
    │  │  │  │     │     ╰─ {format} [308]
    │  │  │  │     ╰─ routes [309]
    │  │  │  │        ╰─ .
    │  │  │  │           ╰─ {format} [309]
    │  │  │  ╰─ users [312]
    │  │  │     ├─ .
    │  │  │     │  ╰─ {format} [312]
    │  │  │     ╰─ /
    │  │  │        ╰─ {id} [311]
    │  │  │           ╰─ .
    │  │  │              ╰─ {format} [311]
    │  │  ├─ cme-challenge [15]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [15]
    │  │  ╰─ buse_reports [14]
    │  │     ├─ /add_category [13]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [13]
    │  │     ╰─ .
    │  │        ╰─ {format} [14]
    │  ├─ c
    │  │  ├─ ustomers_dot/proxy/graphql [332]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [332]
    │  │  ├─ haos/
    │  │  │  ├─ cpu_spin [314]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [314]
    │  │  │  ├─ db_spin [315]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [315]
    │  │  │  ├─ leakmem [318]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [318]
    │  │  │  ├─ sleep [320]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [320]
    │  │  │  ├─ kill [317]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [317]
    │  │  │  ├─ quit [319]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [319]
    │  │  │  ╰─ gc [316]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [316]
    │  │  ╰─ ountr
    │  │     ├─ y_states [331]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [331]
    │  │     ╰─ ies [330]
    │  │        ╰─ .
    │  │           ╰─ {format} [330]
    │  ├─ g
    │  │  ├─ oogle_api/auth/callback [397]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [397]
    │  │  ├─ itlab_subscriptions/hand_raise_leads [383]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [383]
    │  │  ├─ raphql-explorer [2]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [2]
    │  │  ╰─ /
    │  │     ╰─ {id} [644]
    │  │        ╰─ .
    │  │           ╰─ {format} [644]
    │  ├─ i
    │  │  ├─ de [790]
    │  │  │  ├─ ntity_verification [2052]
    │  │  │  │  ├─ /
    │  │  │  │  │  ├─ toggle_phone_exemption [2054]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [2054]
    │  │  │  │  │  ├─ verif
    │  │  │  │  │  │  ├─ ication_state [2055]
    │  │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │  │     ╰─ {format} [2055]
    │  │  │  │  │  │  ╰─ y_
    │  │  │  │  │  │     ├─ phone_verification_code [2058]
    │  │  │  │  │  │     │  ╰─ .
    │  │  │  │  │  │     │     ╰─ {format} [2058]
    │  │  │  │  │  │     ╰─ credit_card [2056]
    │  │  │  │  │  │        ├─ _captcha [2057]
    │  │  │  │  │  │        │  ╰─ .
    │  │  │  │  │  │        │     ╰─ {format} [2057]
    │  │  │  │  │  │        ╰─ .
    │  │  │  │  │  │           ╰─ {format} [2056]
    │  │  │  │  │  ╰─ s
    │  │  │  │  │     ├─ end_phone_verification_code [2051]
    │  │  │  │  │     │  ╰─ .
    │  │  │  │  │     │     ╰─ {format} [2051]
    │  │  │  │  │     ╰─ uccess [2053]
    │  │  │  │  │        ╰─ .
    │  │  │  │  │           ╰─ {format} [2053]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [2052]
    │  │  │  ╰─ /
    │  │  │     ├─ reset_oauth_application_settings [73]
    │  │  │     ├─ oauth_redirect [806]
    │  │  │     ╰─ project [791]
    │  │  │        ╰─ /
    │  │  │           ╰─ {project_id:2} [792]
    │  │  │              ╰─ /
    │  │  │                 ├─ blob [793]
    │  │  │                 │  ╰─ /
    │  │  │                 │     ├─ {*branch}
    │  │  │                 │     │  ╰─ /- [795]
    │  │  │                 │     │     ╰─ /
    │  │  │                 │     │        ╰─ {*path} [796]
    │  │  │                 │     ╰─ {*branch} [794]
    │  │  │                 ├─ edit [797]
    │  │  │                 │  ╰─ /
    │  │  │                 │     ├─ {*branch}
    │  │  │                 │     │  ╰─ /- [799]
    │  │  │                 │     │     ╰─ /
    │  │  │                 │     │        ╰─ {*path} [800]
    │  │  │                 │     ╰─ {*branch} [798]
    │  │  │                 ├─ tree [802]
    │  │  │                 │  ╰─ /
    │  │  │                 │     ├─ {*branch}
    │  │  │                 │     │  ╰─ /- [804]
    │  │  │                 │     │     ╰─ /
    │  │  │                 │     │        ╰─ {*path} [805]
    │  │  │                 │     ╰─ {*branch} [803]
    │  │  │                 ╰─ merge_requests/
    │  │  │                    ╰─ {merge_request_id:3} [801]
    │  │  ╰─ nvites/
    │  │     ╰─ {id:10} [865]
    │  │        ├─ .
    │  │        │  ╰─ {format} [865]
    │  │        ╰─ /
    │  │           ├─ decline [864]
    │  │           │  ╰─ .
    │  │           │     ╰─ {format} [864]
    │  │           ╰─ accept [863]
    │  │              ╰─ .
    │  │                 ╰─ {format} [863]
    │  ├─ j
    │  │  ├─ ira
    │  │  │  ├─ _connect [3]
    │  │  │  │  ├─ /
    │  │  │  │  │  ├─ workspaces/search [884]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [884]
    │  │  │  │  │  ├─ app_descriptor [866]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [866]
    │  │  │  │  │  ├─ installations [871]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [871]
    │  │  │  │  │  ├─ subscriptions [879]
    │  │  │  │  │  │  ├─ .
    │  │  │  │  │  │  │  ╰─ {format} [879]
    │  │  │  │  │  │  ╰─ /
    │  │  │  │  │  │     ╰─ {id} [880]
    │  │  │  │  │  │        ╰─ .
    │  │  │  │  │  │           ╰─ {format} [880]
    │  │  │  │  │  ├─ repositories/
    │  │  │  │  │  │  ├─ associate [877]
    │  │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │  │     ╰─ {format} [877]
    │  │  │  │  │  │  ╰─ search [878]
    │  │  │  │  │  │     ╰─ .
    │  │  │  │  │  │        ╰─ {format} [878]
    │  │  │  │  │  ├─ public_keys/
    │  │  │  │  │  │  ╰─ {id} [876]
    │  │  │  │  │  │     ╰─ .
    │  │  │  │  │  │        ╰─ {format} [876]
    │  │  │  │  │  ├─ branches/
    │  │  │  │  │  │  ├─ route [868]
    │  │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │  │     ╰─ {format} [868]
    │  │  │  │  │  │  ╰─ new [867]
    │  │  │  │  │  │     ╰─ .
    │  │  │  │  │  │        ╰─ {format} [867]
    │  │  │  │  │  ├─ events/
    │  │  │  │  │  │  ├─ uninstalled [870]
    │  │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │  │     ╰─ {format} [870]
    │  │  │  │  │  │  ╰─ installed [869]
    │  │  │  │  │  │     ╰─ .
    │  │  │  │  │  │        ╰─ {format} [869]
    │  │  │  │  │  ╰─ oauth_
    │  │  │  │  │     ├─ application_id [873]
    │  │  │  │  │     │  ╰─ .
    │  │  │  │  │     │     ╰─ {format} [873]
    │  │  │  │  │     ╰─ callbacks [875]
    │  │  │  │  │        ╰─ .
    │  │  │  │  │           ╰─ {format} [875]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [3]
    │  │  │  ╰─ /
    │  │  │     ╰─ {*namespace_id:53}
    │  │  │        ╰─ /
    │  │  │           ╰─ {project_id:53} [1803]
    │  │  │              ├─ /
    │  │  │              │  ├─ commit/
    │  │  │              │  │  ╰─ {id:47} [1804]
    │  │  │              │  │     ╰─ .
    │  │  │              │  │        ╰─ {format} [1804]
    │  │  │              │  ╰─ tree/
    │  │  │              │     ├─ {*id}
    │  │  │              │     │  ╰─ .
    │  │  │              │     │     ╰─ {format} [1805]
    │  │  │              │     ╰─ {*id} [1805]
    │  │  │              ╰─ .
    │  │  │                 ╰─ {format} [1803]
    │  │  ╰─ wks [885]
    │  │     ╰─ .
    │  │        ╰─ {format} [885]
    │  ├─ m
    │  │  ├─ e
    │  │  │  ├─ mbers/mailgun/permanent_failures [909]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [909]
    │  │  │  ╰─ trics [910]
    │  │  │     ├─ /system [911]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [911]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [910]
    │  │  ╰─ a
    │  │     ├─ ilgun/webhooks [908]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [908]
    │  │     ╰─ nifest [1796]
    │  │        ╰─ .
    │  │           ╰─ {format} [1796]
    │  ├─ o
    │  │  ├─ rganizations [954]
    │  │  │  ├─ .
    │  │  │  │  ╰─ {format} [954]
    │  │  │  ╰─ /
    │  │  │     ├─ preview_markdown [956]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [956]
    │  │  │     ├─ new [955]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [955]
    │  │  │     ╰─ {organization_path} [957]
    │  │  │        ├─ .
    │  │  │        │  ╰─ {format} [957]
    │  │  │        ╰─ /
    │  │  │           ├─ settings/general [960]
    │  │  │           │  ╰─ .
    │  │  │           │     ╰─ {format} [960]
    │  │  │           ├─ activity [952]
    │  │  │           │  ╰─ .
    │  │  │           │     ╰─ {format} [952]
    │  │  │           ├─ groups [948]
    │  │  │           │  ├─ _and_projects [953]
    │  │  │           │  │  ╰─ .
    │  │  │           │  │     ╰─ {format} [953]
    │  │  │           │  ├─ .
    │  │  │           │  │  ╰─ {format} [948]
    │  │  │           │  ╰─ /
    │  │  │           │     ├─ new [951]
    │  │  │           │     │  ╰─ .
    │  │  │           │     │     ╰─ {format} [951]
    │  │  │           │     ╰─ {*id}
    │  │  │           │        ╰─ /edit [950]
    │  │  │           │           ╰─ .
    │  │  │           │              ╰─ {format} [950]
    │  │  │           ├─ users [958]
    │  │  │           │  ╰─ .
    │  │  │           │     ╰─ {format} [958]
    │  │  │           ╰─ projects/
    │  │  │              ╰─ {*namespace_id}
    │  │  │                 ╰─ /
    │  │  │                    ╰─ {id:4}
    │  │  │                       ╰─ /edit [959]
    │  │  │                          ╰─ .
    │  │  │                             ╰─ {format} [959]
    │  │  ├─ perations [942]
    │  │  │  ├─ /environments [943]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [943]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [942]
    │  │  ╰─ ffline [1797]
    │  │     ╰─ .
    │  │        ╰─ {format} [1797]
    │  ├─ p
    │  │  ├─ hone_verification/telesign_callback [968]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [968]
    │  │  ├─ eek [10]
    │  │  ├─ ush_from_secondary/
    │  │  │  ╰─ {geo_node_id}
    │  │  │     ╰─ /
    │  │  │        ├─ {*repository_path:5}
    │  │  │        │  ╰─ /
    │  │  │        │     ├─ info/
    │  │  │        │     │  ├─ lfs/
    │  │  │        │     │  │  ├─ objects [1908]
    │  │  │        │     │  │  │  ╰─ /
    │  │  │        │     │  │  │     ├─ batch [1904]
    │  │  │        │     │  │  │     ╰─ {*oid} [1906]
    │  │  │        │     │  │  ╰─ locks [1910]
    │  │  │        │     │  │     ╰─ /
    │  │  │        │     │  │        ├─ verify [1928]
    │  │  │        │     │  │        ├─ new [1918]
    │  │  │        │     │  │        ╰─ {id} [1912]
    │  │  │        │     │  │           ╰─ /
    │  │  │        │     │  │              ├─ unlock [1922]
    │  │  │        │     │  │              ╰─ edit [1914]
    │  │  │        │     │  ╰─ refs [1898]
    │  │  │        │     ├─ ssh-
    │  │  │        │     │  ├─ receive-pack [1900]
    │  │  │        │     │  ╰─ upload-pack [1902]
    │  │  │        │     ╰─ git
    │  │  │        │        ├─ lab-lfs/objects/
    │  │  │        │        │  ├─ {*oid:6}
    │  │  │        │        │  │  ╰─ /
    │  │  │        │        │  │     ├─ {*size:7}
    │  │  │        │        │  │     │  ╰─ /authorize [1932]
    │  │  │        │        │  │     ╰─ {*size:7} [1934]
    │  │  │        │        │  ╰─ {*oid:6} [1930]
    │  │  │        │        ╰─ -
    │  │  │        │           ├─ receive-pack [1894]
    │  │  │        │           ╰─ upload-pack [1896]
    │  │  │        ├─ {*repository_path:9}
    │  │  │        │  ╰─ /info/refs [1807]
    │  │  │        ╰─ {*repository_path:8} [1806]
    │  │  ├─ rofile/
    │  │  │  ├─ two_factor_auth [999]
    │  │  │  │  ├─ /
    │  │  │  │  │  ├─ skip [1005]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [1005]
    │  │  │  │  │  ├─ destroy_
    │  │  │  │  │  │  ├─ otp [1002]
    │  │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │  │     ╰─ {format} [1002]
    │  │  │  │  │  │  ╰─ webauthn/
    │  │  │  │  │  │     ╰─ {id} [1003]
    │  │  │  │  │  │        ╰─ .
    │  │  │  │  │  │           ╰─ {format} [1003]
    │  │  │  │  │  ╰─ c
    │  │  │  │  │     ├─ reate_webauthn [1000]
    │  │  │  │  │     │  ╰─ .
    │  │  │  │  │     │     ╰─ {format} [1000]
    │  │  │  │  │     ╰─ odes [998]
    │  │  │  │  │        ╰─ .
    │  │  │  │  │           ╰─ {format} [998]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [999]
    │  │  │  ├─ u
    │  │  │  │  ├─ pdate_username [972]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [972]
    │  │  │  │  ╰─ sage_quotas [1006]
    │  │  │  │     ╰─ .
    │  │  │  │        ╰─ {format} [1006]
    │  │  │  ├─ notifications [990]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [990]
    │  │  │  ├─ preferences [993]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [993]
    │  │  │  ├─ billings [976]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [976]
    │  │  │  ├─ emails [984]
    │  │  │  │  ├─ /
    │  │  │  │  │  ├─ confirmation [324]
    │  │  │  │  │  │  ├─ /new [326]
    │  │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │  │     ╰─ {format} [326]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [324]
    │  │  │  │  │  ╰─ {id} [985]
    │  │  │  │  │     ├─ /resend_confirmation_instructions [987]
    │  │  │  │  │     │  ╰─ .
    │  │  │  │  │     │     ╰─ {format} [987]
    │  │  │  │  │     ╰─ .
    │  │  │  │  │        ╰─ {format} [985]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [984]
    │  │  │  ├─ groups/
    │  │  │  │  ╰─ {*id:2}
    │  │  │  │     ╰─ /notifications [988]
    │  │  │  │        ╰─ .
    │  │  │  │           ╰─ {format:13} [988]
    │  │  │  ├─ reset_
    │  │  │  │  ├─ incoming_email_token [970]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [970]
    │  │  │  │  ├─ static_object_token [971]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [971]
    │  │  │  │  ╰─ feed_token [969]
    │  │  │  │     ╰─ .
    │  │  │  │        ╰─ {format} [969]
    │  │  │  ├─ slack/
    │  │  │  │  ├─ slack_link [997]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [997]
    │  │  │  │  ╰─ edit [996]
    │  │  │  │     ╰─ .
    │  │  │  │        ╰─ {format} [996]
    │  │  │  ├─ a
    │  │  │  │  ├─ pplications [1857]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [1857]
    │  │  │  │  ├─ udit_log [1858]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [1858]
    │  │  │  │  ├─ ccount [973]
    │  │  │  │  │  ├─ /unlink [974]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [974]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [973]
    │  │  │  │  ╰─ vatar [975]
    │  │  │  │     ╰─ .
    │  │  │  │        ╰─ {format} [975]
    │  │  │  ╰─ c
    │  │  │     ├─ omment_templates [982]
    │  │  │     │  ├─ .
    │  │  │     │  │  ╰─ {format} [982]
    │  │  │     │  ╰─ /
    │  │  │     │     ╰─ {id} [983]
    │  │  │     │        ╰─ .
    │  │  │     │           ╰─ {format} [983]
    │  │  │     ╰─ hat_names [977]
    │  │  │        ├─ /
    │  │  │        │  ├─ deny [978]
    │  │  │        │  │  ╰─ .
    │  │  │        │  │     ╰─ {format} [978]
    │  │  │        │  ├─ new [981]
    │  │  │        │  │  ╰─ .
    │  │  │        │  │     ╰─ {format} [981]
    │  │  │        │  ╰─ {id} [979]
    │  │  │        │     ╰─ .
    │  │  │        │        ╰─ {format} [979]
    │  │  │        ╰─ .
    │  │  │           ╰─ {format} [977]
    │  │  ╰─ /
    │  │     ╰─ {id} [1607]
    │  │        ╰─ .
    │  │           ╰─ {format} [1607]
    │  ├─ r
    │  │  ├─ unner_setup/platforms [1937]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [1937]
    │  │  ╰─ e
    │  │     ├─ mote_development/workspaces [1883]
    │  │     │  ├─ _feature_flag [1893]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [1893]
    │  │     │  ├─ .
    │  │     │  │  ╰─ {format} [1883]
    │  │     │  ╰─ /
    │  │     │     ├─ new [1889]
    │  │     │     │  ╰─ .
    │  │     │     │     ╰─ {format} [1889]
    │  │     │     ├─ {id} [1884]
    │  │     │     │  ├─ /edit [1885]
    │  │     │     │  │  ╰─ .
    │  │     │     │  │     ╰─ {format} [1885]
    │  │     │     │  ╰─ .
    │  │     │     │     ╰─ {format} [1884]
    │  │     │     ├─ {workspace_id}
    │  │     │     │  ╰─ /workspaces [1887]
    │  │     │     │     ├─ /new [1888]
    │  │     │     │     │  ╰─ .
    │  │     │     │     │     ╰─ {format} [1888]
    │  │     │     │     ╰─ .
    │  │     │     │        ╰─ {format} [1887]
    │  │     │     ├─ {*vueroute}
    │  │     │     │  ├─ .
    │  │     │     │  │  ╰─ {format} [1883]
    │  │     │     │  ╰─ /
    │  │     │     │     ├─ new [1889]
    │  │     │     │     │  ╰─ .
    │  │     │     │     │     ╰─ {format} [1889]
    │  │     │     │     ├─ {id} [1884]
    │  │     │     │     │  ├─ /edit [1885]
    │  │     │     │     │  │  ╰─ .
    │  │     │     │     │  │     ╰─ {format} [1885]
    │  │     │     │     │  ╰─ .
    │  │     │     │     │     ╰─ {format} [1884]
    │  │     │     │     ╰─ {workspace_id}
    │  │     │     │        ╰─ /workspaces [1887]
    │  │     │     │           ├─ /new [1888]
    │  │     │     │           │  ╰─ .
    │  │     │     │           │     ╰─ {format} [1888]
    │  │     │     │           ╰─ .
    │  │     │     │              ╰─ {format} [1887]
    │  │     │     ╰─ {*vueroute} [1883]
    │  │     ╰─ adiness [782]
    │  │        ╰─ .
    │  │           ╰─ {format} [782]
    │  ├─ s
    │  │  ├─ ubscriptions [386]
    │  │  │  ├─ .
    │  │  │  │  ╰─ {format} [386]
    │  │  │  ╰─ /
    │  │  │     ├─ validate_payment_method [390]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [390]
    │  │  │     ├─ groups [378]
    │  │  │     │  ├─ .
    │  │  │     │  │  ╰─ {format} [378]
    │  │  │     │  ╰─ /
    │  │  │     │     ├─ new [380]
    │  │  │     │     │  ╰─ .
    │  │  │     │     │     ╰─ {format} [380]
    │  │  │     │     ╰─ {id} [381]
    │  │  │     │        ├─ /edit [379]
    │  │  │     │        │  ╰─ .
    │  │  │     │        │     ╰─ {format} [379]
    │  │  │     │        ╰─ .
    │  │  │     │           ╰─ {format} [381]
    │  │  │     ├─ new [387]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [387]
    │  │  │     ├─ payment_
    │  │  │     │  ├─ method [389]
    │  │  │     │  │  ╰─ .
    │  │  │     │  │     ╰─ {format} [389]
    │  │  │     │  ╰─ form [388]
    │  │  │     │     ╰─ .
    │  │  │     │        ╰─ {format} [388]
    │  │  │     ╰─ buy_
    │  │  │        ├─ minutes [384]
    │  │  │        │  ╰─ .
    │  │  │        │     ╰─ {format} [384]
    │  │  │        ╰─ storage [385]
    │  │  │           ╰─ .
    │  │  │              ╰─ {format} [385]
    │  │  ├─ martcard/
    │  │  │  ├─ extract_certificate [1964]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [1964]
    │  │  │  ├─ verify_certificate [1965]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [1965]
    │  │  │  ╰─ auth [1963]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [1963]
    │  │  ├─ nippets [1967]
    │  │  │  ├─ .
    │  │  │  │  ╰─ {format} [1967]
    │  │  │  ╰─ /
    │  │  │     ├─ preview_markdown [1970]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [1970]
    │  │  │     ├─ new [1969]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [1969]
    │  │  │     ├─ {id:3} [1973]
    │  │  │     │  ├─ .
    │  │  │     │  │  ╰─ {format} [1973]
    │  │  │     │  ╰─ /
    │  │  │     │     ├─ toggle_award_emoji [1974]
    │  │  │     │     │  ╰─ .
    │  │  │     │     │     ╰─ {format} [1974]
    │  │  │     │     ├─ mark_as_spam [1968]
    │  │  │     │     │  ╰─ .
    │  │  │     │     │     ╰─ {format} [1968]
    │  │  │     │     ├─ edit [1966]
    │  │  │     │     │  ╰─ .
    │  │  │     │     │     ╰─ {format} [1966]
    │  │  │     │     ╰─ raw [1971]
    │  │  │     │        ╰─ .
    │  │  │     │           ╰─ {format} [1971]
    │  │  │     ╰─ {snippet_id:3}
    │  │  │        ╰─ /
    │  │  │           ├─ notes [1976]
    │  │  │           │  ├─ .
    │  │  │           │  │  ╰─ {format} [1976]
    │  │  │           │  ╰─ /
    │  │  │           │     ╰─ {id:3} [1978]
    │  │  │           │        ├─ /
    │  │  │           │        │  ├─ toggle_award_emoji [1980]
    │  │  │           │        │  │  ╰─ .
    │  │  │           │        │  │     ╰─ {format} [1980]
    │  │  │           │        │  ╰─ delete_attachment [1977]
    │  │  │           │        │     ╰─ .
    │  │  │           │        │        ╰─ {format} [1977]
    │  │  │           │        ╰─ .
    │  │  │           │           ╰─ {format} [1978]
    │  │  │           ╰─ raw/
    │  │  │              ╰─ {ref}
    │  │  │                 ╰─ /
    │  │  │                    ╰─ {*path} [1975]
    │  │  ├─ andbox/
    │  │  │  ├─ mermaid [1938]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [1938]
    │  │  │  ╰─ swagger [1939]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [1939]
    │  │  ├─ /
    │  │  │  ╰─ {username:12} [1868]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [1868]
    │  │  ╰─ e
    │  │     ├─ curity [1856]
    │  │     │  ├─ /
    │  │     │  │  ├─ vulnerabilities [1951]
    │  │     │  │  │  ╰─ .
    │  │     │  │  │     ╰─ {format} [1951]
    │  │     │  │  ├─ dashboard [1947]
    │  │     │  │  │  ├─ /settings [1946]
    │  │     │  │  │  │  ╰─ .
    │  │     │  │  │  │     ╰─ {format} [1946]
    │  │     │  │  │  ╰─ .
    │  │     │  │  │     ╰─ {format} [1947]
    │  │     │  │  ╰─ projects [1948]
    │  │     │  │     ├─ .
    │  │     │  │     │  ╰─ {format} [1948]
    │  │     │  │     ╰─ /
    │  │     │  │        ╰─ {id} [1949]
    │  │     │  │           ╰─ .
    │  │     │  │              ╰─ {format} [1949]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [1856]
    │  │     ╰─ nt_notifications/
    │  │        ╰─ {id:11}
    │  │           ╰─ /unsubscribe [1952]
    │  │              ╰─ .
    │  │                 ╰─ {format} [1952]
    │  ├─ t
    │  │  ├─ imelogs [1984]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [1984]
    │  │  ╰─ r
    │  │     ├─ ack_namespace_visits [2059]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [2059]
    │  │     ╰─ ial
    │  │        ├─ _registrations [1991]
    │  │        │  ├─ /new [1992]
    │  │        │  │  ╰─ .
    │  │        │  │     ╰─ {format} [1992]
    │  │        │  ╰─ .
    │  │        │     ╰─ {format} [1991]
    │  │        ╰─ s [391]
    │  │           ├─ /
    │  │           │  ├─ duo_
    │  │           │  │  ├─ enterprise [393]
    │  │           │  │  │  ├─ /new [394]
    │  │           │  │  │  │  ╰─ .
    │  │           │  │  │  │     ╰─ {format} [394]
    │  │           │  │  │  ╰─ .
    │  │           │  │  │     ╰─ {format} [393]
    │  │           │  │  ╰─ pro [395]
    │  │           │  │     ├─ /new [396]
    │  │           │  │     │  ╰─ .
    │  │           │  │     │     ╰─ {format} [396]
    │  │           │  │     ╰─ .
    │  │           │  │        ╰─ {format} [395]
    │  │           │  ╰─ new [392]
    │  │           │     ╰─ .
    │  │           │        ╰─ {format} [392]
    │  │           ╰─ .
    │  │              ╰─ {format} [391]
    │  ╰─ {model:1}
    │     ╰─ /
    │        ╰─ {model_id}
    │           ╰─ /uploads/
    │              ╰─ {secret}
    │                 ╰─ /
    │                    ╰─ {filename:0} [313]
    │                       ╰─ .
    │                          ╰─ {format} [313]
    ├─ he
    │  ├─ alth_check [783]
    │  │  ├─ .
    │  │  │  ╰─ {format} [783]
    │  │  ╰─ /
    │  │     ╰─ {checks} [783]
    │  │        ╰─ .
    │  │           ╰─ {format} [783]
    │  ╰─ lp [785]
    │     ├─ /
    │     │  ├─ instance_configuration [786]
    │     │  │  ╰─ .
    │     │  │     ╰─ {format} [786]
    │     │  ├─ shortcuts [788]
    │     │  │  ╰─ .
    │     │  │     ╰─ {format} [788]
    │     │  ├─ d
    │     │  │  ├─ ocs [787]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [787]
    │     │  │  ╰─ rawers/
    │     │  │     ├─ {*markdown_file}
    │     │  │     │  ╰─ .
    │     │  │     │     ╰─ {format} [784]
    │     │  │     ╰─ {*markdown_file} [784]
    │     │  ├─ {*path}
    │     │  │  ╰─ .
    │     │  │     ╰─ {format} [789]
    │     │  ╰─ {*path} [789]
    │     ╰─ .
    │        ╰─ {format} [785]
    ├─ a
    │  ├─ pi/
    │  │  ├─ v4/geo/graphql [399]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [399]
    │  │  ╰─ graphql [398]
    │  │     ╰─ .
    │  │        ╰─ {format} [398]
    │  ╰─ dmin [115]
    │     ├─ .
    │     │  ╰─ {format} [115]
    │     ╰─ /
    │        ├─ namespace_limits [209]
    │        │  ├─ /export_usage [208]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [208]
    │        │  ╰─ .
    │        │     ╰─ {format} [209]
    │        ├─ organizations [210]
    │        │  ╰─ .
    │        │     ╰─ {format} [210]
    │        ├─ version_check [291]
    │        │  ╰─ .
    │        │     ╰─ {format} [291]
    │        ├─ topics [249]
    │        │  ├─ .
    │        │  │  ╰─ {format} [249]
    │        │  ╰─ /
    │        │     ├─ preview_markdown [255]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [255]
    │        │     ├─ merge [253]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [253]
    │        │     ├─ new [254]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [254]
    │        │     ├─ {id} [250]
    │        │     │  ├─ /edit [251]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [251]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [250]
    │        │     ╰─ {topic_id}
    │        │        ╰─ /avatar [258]
    │        │           ╰─ .
    │        │              ╰─ {format} [258]
    │        ├─ jobs [191]
    │        │  ├─ /cancel_all [190]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [190]
    │        │  ╰─ .
    │        │     ╰─ {format} [191]
    │        ├─ us
    │        │  ├─ age_trends [259]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [259]
    │        │  ╰─ er
    │        │     ├─ _permission_exports [260]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [260]
    │        │     ╰─ s [267]
    │        │        ├─ .
    │        │        │  ╰─ {format} [267]
    │        │        ╰─ /
    │        │           ├─ new [277]
    │        │           │  ╰─ .
    │        │           │     ╰─ {format} [277]
    │        │           ├─ {user_id:34}
    │        │           │  ╰─ /
    │        │           │     ├─ keys/
    │        │           │     │  ╰─ {id:34} [192]
    │        │           │     │     ╰─ .
    │        │           │     │        ╰─ {format} [192]
    │        │           │     ╰─ i
    │        │           │        ├─ mpersonation_tokens [176]
    │        │           │        │  ├─ .
    │        │           │        │  │  ╰─ {format} [176]
    │        │           │        │  ╰─ /
    │        │           │        │     ╰─ {id:34}
    │        │           │        │        ╰─ /revoke [178]
    │        │           │        │           ╰─ .
    │        │           │        │              ╰─ {format} [178]
    │        │           │        ╰─ dentities [169]
    │        │           │           ├─ .
    │        │           │           │  ╰─ {format} [169]
    │        │           │           ╰─ /
    │        │           │              ├─ new [173]
    │        │           │              │  ╰─ .
    │        │           │              │     ╰─ {format} [173]
    │        │           │              ╰─ {id:34} [170]
    │        │           │                 ├─ /edit [171]
    │        │           │                 │  ╰─ .
    │        │           │                 │     ╰─ {format} [171]
    │        │           │                 ╰─ .
    │        │           │                    ╰─ {format} [170]
    │        │           ╰─ {id:34} [269]
    │        │              ├─ .
    │        │              │  ╰─ {format} [269]
    │        │              ╰─ /
    │        │                 ├─ trust [284]
    │        │                 │  ╰─ .
    │        │                 │     ╰─ {format} [284]
    │        │                 ├─ un
    │        │                 │  ├─ trust [288]
    │        │                 │  │  ╰─ .
    │        │                 │  │     ╰─ {format} [288]
    │        │                 │  ├─ lock [287]
    │        │                 │  │  ╰─ .
    │        │                 │  │     ╰─ {format} [287]
    │        │                 │  ╰─ b
    │        │                 │     ├─ lock [286]
    │        │                 │     │  ╰─ .
    │        │                 │     │     ╰─ {format} [286]
    │        │                 │     ╰─ an [285]
    │        │                 │        ╰─ .
    │        │                 │           ╰─ {format} [285]
    │        │                 ├─ edit [272]
    │        │                 │  ╰─ .
    │        │                 │     ╰─ {format} [272]
    │        │                 ├─ keys [276]
    │        │                 │  ╰─ .
    │        │                 │     ╰─ {format} [276]
    │        │                 ├─ re
    │        │                 │  ├─ set_runners_minutes [282]
    │        │                 │  │  ╰─ .
    │        │                 │  │     ╰─ {format} [282]
    │        │                 │  ├─ ject [280]
    │        │                 │  │  ╰─ .
    │        │                 │  │     ╰─ {format} [280]
    │        │                 │  ╰─ move/
    │        │                 │     ╰─ {email_id} [281]
    │        │                 │        ╰─ .
    │        │                 │           ╰─ {format} [281]
    │        │                 ├─ a
    │        │                 │  ├─ ctivate [261]
    │        │                 │  │  ╰─ .
    │        │                 │  │     ╰─ {format} [261]
    │        │                 │  ╰─ pprove [262]
    │        │                 │     ╰─ .
    │        │                 │        ╰─ {format} [262]
    │        │                 ├─ b
    │        │                 │  ├─ lock [264]
    │        │                 │  │  ╰─ .
    │        │                 │  │     ╰─ {format} [264]
    │        │                 │  ╰─ an [263]
    │        │                 │     ╰─ .
    │        │                 │        ╰─ {format} [263]
    │        │                 ├─ c
    │        │                 │  ├─ ard_match [265]
    │        │                 │  │  ╰─ .
    │        │                 │  │     ╰─ {format} [265]
    │        │                 │  ╰─ onfirm [266]
    │        │                 │     ╰─ .
    │        │                 │        ╰─ {format} [266]
    │        │                 ├─ d
    │        │                 │  ├─ isable_two_factor [271]
    │        │                 │  │  ╰─ .
    │        │                 │  │     ╰─ {format} [271]
    │        │                 │  ╰─ e
    │        │                 │     ├─ stroy_identity_verification_exemption [270]
    │        │                 │     │  ╰─ .
    │        │                 │     │     ╰─ {format} [270]
    │        │                 │     ╰─ activate [268]
    │        │                 │        ╰─ .
    │        │                 │           ╰─ {format} [268]
    │        │                 ├─ i
    │        │                 │  ├─ dentity_verification_exemption [273]
    │        │                 │  │  ╰─ .
    │        │                 │  │     ╰─ {format} [273]
    │        │                 │  ╰─ mpersonate [274]
    │        │                 │     ╰─ .
    │        │                 │        ╰─ {format} [274]
    │        │                 ╰─ p
    │        │                    ├─ hone_match [278]
    │        │                    │  ╰─ .
    │        │                    │     ╰─ {format} [278]
    │        │                    ╰─ rojects [279]
    │        │                       ╰─ .
    │        │                          ╰─ {format} [279]
    │        ├─ a
    │        │  ├─ i/self_hosted_models [25]
    │        │  │  ├─ .
    │        │  │  │  ╰─ {format} [25]
    │        │  │  ╰─ /
    │        │  │     ├─ terms_and_conditions [26]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [26]
    │        │  │     ├─ {*vueroute}
    │        │  │     │  ├─ /terms_and_conditions [26]
    │        │  │     │  │  ╰─ .
    │        │  │     │  │     ╰─ {format} [26]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [25]
    │        │  │     ╰─ {*vueroute} [25]
    │        │  ├─ udit_log
    │        │  │  ├─ _reports [77]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format:14} [77]
    │        │  │  ╰─ s [78]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [78]
    │        │  ├─ buse_reports [20]
    │        │  │  ├─ .
    │        │  │  │  ╰─ {format} [20]
    │        │  │  ╰─ /
    │        │  │     ╰─ {id} [19]
    │        │  │        ├─ /moderate_user [21]
    │        │  │        │  ╰─ .
    │        │  │        │     ╰─ {format} [21]
    │        │  │        ╰─ .
    │        │  │           ╰─ {format} [19]
    │        │  ╰─ pplication
    │        │     ├─ _settings [49]
    │        │     │  ├─ .
    │        │     │  │  ╰─ {format} [49]
    │        │     │  ╰─ /
    │        │     │     ├─ lets_encrypt_terms_of_service [34]
    │        │     │     │  ╰─ .
    │        │     │     │     ╰─ {format} [34]
    │        │     │     ├─ u
    │        │     │     │  ├─ pdate_microsoft_application [51]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [51]
    │        │     │     │  ╰─ sage_data [52]
    │        │     │     │     ╰─ .
    │        │     │     │        ╰─ {format} [52]
    │        │     │     ├─ metrics_and_profiling [35]
    │        │     │     │  ╰─ .
    │        │     │     │     ╰─ {format} [35]
    │        │     │     ├─ integrations [33]
    │        │     │     │  ├─ .
    │        │     │     │  │  ╰─ {format} [33]
    │        │     │     │  ╰─ /
    │        │     │     │     ╰─ {id} [188]
    │        │     │     │        ├─ .
    │        │     │     │        │  ╰─ {format} [188]
    │        │     │     │        ╰─ /
    │        │     │     │           ├─ overrides [185]
    │        │     │     │           │  ╰─ .
    │        │     │     │           │     ╰─ {format} [185]
    │        │     │     │           ├─ reset [186]
    │        │     │     │           │  ╰─ .
    │        │     │     │           │     ╰─ {format} [186]
    │        │     │     │           ├─ edit [184]
    │        │     │     │           │  ╰─ .
    │        │     │     │           │     ╰─ {format} [184]
    │        │     │     │           ╰─ test [187]
    │        │     │     │              ╰─ .
    │        │     │     │                 ╰─ {format} [187]
    │        │     │     ├─ preferences [38]
    │        │     │     │  ╰─ .
    │        │     │     │     ╰─ {format} [38]
    │        │     │     ├─ templates [48]
    │        │     │     │  ╰─ .
    │        │     │     │     ╰─ {format} [48]
    │        │     │     ├─ ge
    │        │     │     │  ├─ neral [32]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [32]
    │        │     │     │  ╰─ o [141]
    │        │     │     │     ╰─ .
    │        │     │     │        ╰─ {format} [141]
    │        │     │     ├─ r
    │        │     │     │  ├─ oles_and_permissions [63]
    │        │     │     │  │  ├─ .
    │        │     │     │  │  │  ╰─ {format} [63]
    │        │     │     │  │  ╰─ /
    │        │     │     │  │     ├─ new [64]
    │        │     │     │  │     │  ╰─ .
    │        │     │     │  │     │     ╰─ {format} [64]
    │        │     │     │  │     ╰─ {id} [65]
    │        │     │     │  │        ├─ /edit [62]
    │        │     │     │  │        │  ╰─ .
    │        │     │     │  │        │     ╰─ {format} [62]
    │        │     │     │  │        ╰─ .
    │        │     │     │  │           ╰─ {format} [65]
    │        │     │     │  ╰─ e
    │        │     │     │     ├─ set_
    │        │     │     │     │  ├─ error_tracking_access_token [41]
    │        │     │     │     │  │  ╰─ .
    │        │     │     │     │  │     ╰─ {format} [41]
    │        │     │     │     │  ├─ health_check_token [42]
    │        │     │     │     │  │  ╰─ .
    │        │     │     │     │  │     ╰─ {format} [42]
    │        │     │     │     │  ╰─ registration_token [43]
    │        │     │     │     │     ╰─ .
    │        │     │     │     │        ╰─ {format} [43]
    │        │     │     │     ╰─ po
    │        │     │     │        ├─ sitory [40]
    │        │     │     │        │  ╰─ .
    │        │     │     │        │     ╰─ {format} [40]
    │        │     │     │        ╰─ rting [39]
    │        │     │     │           ╰─ .
    │        │     │     │              ╰─ {format} [39]
    │        │     │     ├─ a
    │        │     │     │  ├─ dvanced_search [28]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [28]
    │        │     │     │  ├─ ppearance [53]
    │        │     │     │  │  ├─ /
    │        │     │     │  │  │  ├─ p
    │        │     │     │  │  │  │  ├─ review_sign_in [57]
    │        │     │     │  │  │  │  │  ╰─ .
    │        │     │     │  │  │  │  │     ╰─ {format} [57]
    │        │     │     │  │  │  │  ╰─ wa_icon [58]
    │        │     │     │  │  │  │     ╰─ .
    │        │     │     │  │  │  │        ╰─ {format} [58]
    │        │     │     │  │  │  ├─ header_logos [55]
    │        │     │     │  │  │  │  ╰─ .
    │        │     │     │  │  │  │     ╰─ {format} [55]
    │        │     │     │  │  │  ├─ favicon [54]
    │        │     │     │  │  │  │  ╰─ .
    │        │     │     │  │  │  │     ╰─ {format} [54]
    │        │     │     │  │  │  ╰─ logo [56]
    │        │     │     │  │  │     ╰─ .
    │        │     │     │  │  │        ╰─ {format} [56]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [53]
    │        │     │     │  ╰─ nalytics [29]
    │        │     │     │     ╰─ .
    │        │     │     │        ╰─ {format} [29]
    │        │     │     ├─ c
    │        │     │     │  ├─ lear_repository_check_states [31]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [31]
    │        │     │     │  ╰─ i_cd [30]
    │        │     │     │     ╰─ .
    │        │     │     │        ╰─ {format} [30]
    │        │     │     ├─ n
    │        │     │     │  ├─ amespace_storage [36]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [36]
    │        │     │     │  ╰─ etwork [37]
    │        │     │     │     ╰─ .
    │        │     │     │        ╰─ {format} [37]
    │        │     │     ╰─ s
    │        │     │        ├─ cim_oauth [66]
    │        │     │        │  ╰─ .
    │        │     │        │     ╰─ {format} [66]
    │        │     │        ├─ lack [242]
    │        │     │        │  ├─ /slack_auth [243]
    │        │     │        │  │  ╰─ .
    │        │     │        │  │     ╰─ {format} [243]
    │        │     │        │  ├─ _app_manifest_
    │        │     │        │  │  ├─ download [46]
    │        │     │        │  │  │  ╰─ .
    │        │     │        │  │  │     ╰─ {format} [46]
    │        │     │        │  │  ╰─ share [47]
    │        │     │        │  │     ╰─ .
    │        │     │        │  │        ╰─ {format} [47]
    │        │     │        │  ╰─ .
    │        │     │        │     ╰─ {format} [242]
    │        │     │        ╰─ e
    │        │     │           ├─ curity_and_compliance [45]
    │        │     │           │  ╰─ .
    │        │     │           │     ╰─ {format} [45]
    │        │     │           ╰─ at_link_payload [44]
    │        │     │              ╰─ .
    │        │     │                 ╰─ {format} [44]
    │        │     ╰─ s [67]
    │        │        ├─ .
    │        │        │  ╰─ {format} [67]
    │        │        ╰─ /
    │        │           ├─ new [71]
    │        │           │  ╰─ .
    │        │           │     ╰─ {format} [71]
    │        │           ╰─ {id} [68]
    │        │              ├─ /
    │        │              │  ├─ renew [72]
    │        │              │  │  ╰─ .
    │        │              │  │     ╰─ {format} [72]
    │        │              │  ╰─ edit [69]
    │        │              │     ╰─ .
    │        │              │        ╰─ {format} [69]
    │        │              ╰─ .
    │        │                 ╰─ {format} [68]
    │        ├─ b
    │        │  ├─ roadcast_messages [86]
    │        │  │  ├─ .
    │        │  │  │  ╰─ {format} [86]
    │        │  │  ╰─ /
    │        │  │     ├─ preview [90]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [90]
    │        │  │     ╰─ {id} [87]
    │        │  │        ├─ /edit [88]
    │        │  │        │  ╰─ .
    │        │  │        │     ╰─ {format} [88]
    │        │  │        ╰─ .
    │        │  │           ╰─ {format} [87]
    │        │  ╰─ ackground_
    │        │     ├─ migrations [80]
    │        │     │  ├─ .
    │        │     │  │  ╰─ {format} [80]
    │        │     │  ╰─ /
    │        │     │     ├─ {id} [84]
    │        │     │     │  ├─ .
    │        │     │     │  │  ╰─ {format} [84]
    │        │     │     │  ╰─ /
    │        │     │     │     ├─ re
    │        │     │     │     │  ├─ sume [82]
    │        │     │     │     │  │  ╰─ .
    │        │     │     │     │  │     ╰─ {format} [82]
    │        │     │     │     │  ╰─ try [83]
    │        │     │     │     │     ╰─ .
    │        │     │     │     │        ╰─ {format} [83]
    │        │     │     │     ╰─ pause [81]
    │        │     │     │        ╰─ .
    │        │     │     │           ╰─ {format} [81]
    │        │     │     ╰─ {background_migration_id}
    │        │     │        ╰─ /batched_jobs/
    │        │     │           ╰─ {id} [85]
    │        │     │              ╰─ .
    │        │     │                 ╰─ {format} [85]
    │        │     ╰─ jobs [79]
    │        │        ╰─ .
    │        │           ╰─ {format} [79]
    │        ├─ c
    │        │  ├─ i/variables [93]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [93]
    │        │  ├─ lusters [102]
    │        │  │  ├─ .
    │        │  │  │  ╰─ {format} [102]
    │        │  │  ╰─ /
    │        │  │     ├─ new_cluster_docs [105]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [105]
    │        │  │     ├─ c
    │        │  │     │  ├─ reate_user [99]
    │        │  │     │  │  ╰─ .
    │        │  │     │  │     ╰─ {format} [99]
    │        │  │     │  ╰─ onnect [98]
    │        │  │     │     ╰─ .
    │        │  │     │        ╰─ {format} [98]
    │        │  │     ├─ {id} [100]
    │        │  │     │  ├─ /
    │        │  │     │  │  ├─ environments [101]
    │        │  │     │  │  │  ╰─ .
    │        │  │     │  │  │     ╰─ {format} [101]
    │        │  │     │  │  ├─ metrics [103]
    │        │  │     │  │  │  ├─ _dashboard [104]
    │        │  │     │  │  │  │  ╰─ .
    │        │  │     │  │  │  │     ╰─ {format} [104]
    │        │  │     │  │  │  ╰─ .
    │        │  │     │  │  │     ╰─ {format} [103]
    │        │  │     │  │  ╰─ cl
    │        │  │     │  │     ├─ uster_status [97]
    │        │  │     │  │     │  ╰─ .
    │        │  │     │  │     │     ╰─ {format} [97]
    │        │  │     │  │     ╰─ ear_cache [96]
    │        │  │     │  │        ╰─ .
    │        │  │     │  │           ╰─ {format} [96]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [100]
    │        │  │     ╰─ {cluster_id}
    │        │  │        ╰─ /integration/create_or_update [109]
    │        │  │           ╰─ .
    │        │  │              ╰─ {format} [109]
    │        │  ├─ o
    │        │  │  ├─ de_suggestions [1861]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [1861]
    │        │  │  ╰─ horts [110]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [110]
    │        │  ╰─ redentials [112]
    │        │     ├─ .
    │        │     │  ╰─ {format} [112]
    │        │     ╰─ /
    │        │        ├─ {id} [111]
    │        │        │  ├─ /revoke [114]
    │        │        │  │  ╰─ .
    │        │        │  │     ╰─ {format} [114]
    │        │        │  ╰─ .
    │        │        │     ╰─ {format} [111]
    │        │        ╰─ {credential_id}
    │        │           ╰─ /resources/
    │        │              ╰─ {resource_id}
    │        │                 ╰─ /revoke [113]
    │        │                    ╰─ .
    │        │                       ╰─ {format} [113]
    │        ├─ d
    │        │  ├─ ashboard/stats [116]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [116]
    │        │  ╰─ e
    │        │     ├─ v_ops_report [1860]
    │        │     │  ├─ s [124]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [124]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [1860]
    │        │     ╰─ ploy_keys [117]
    │        │        ├─ .
    │        │        │  ╰─ {format} [117]
    │        │        ╰─ /
    │        │           ├─ new [121]
    │        │           │  ╰─ .
    │        │           │     ╰─ {format} [121]
    │        │           ╰─ {id} [118]
    │        │              ├─ /edit [119]
    │        │              │  ╰─ .
    │        │              │     ╰─ {format} [119]
    │        │              ╰─ .
    │        │                 ╰─ {format} [118]
    │        ├─ e
    │        │  ├─ mail [129]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [129]
    │        │  ╰─ lasticsearch/
    │        │     ├─ cancel_index_deletion [125]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [125]
    │        │     ├─ trigger_reindexing [128]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [128]
    │        │     ├─ retry_migration [127]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [127]
    │        │     ╰─ enqueue_index [126]
    │        │        ╰─ .
    │        │           ╰─ {format} [126]
    │        ├─ g
    │        │  ├─ roups [149]
    │        │  │  ├─ .
    │        │  │  │  ╰─ {format} [149]
    │        │  │  ╰─ /
    │        │  │     ├─ new [154]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [154]
    │        │  │     ├─ {*id}
    │        │  │     │  ├─ /
    │        │  │     │  │  ├─ reset_runners_minutes [155]
    │        │  │     │  │  │  ╰─ .
    │        │  │     │  │  │     ╰─ {format:18} [155]
    │        │  │     │  │  ├─ members_update [153]
    │        │  │     │  │  │  ╰─ .
    │        │  │     │  │  │     ╰─ {format:18} [153]
    │        │  │     │  │  ╰─ edit [151]
    │        │  │     │  │     ╰─ .
    │        │  │     │  │        ╰─ {format:18} [151]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format:18} [150]
    │        │  │     ╰─ {*id} [150]
    │        │  ├─ eo [133]
    │        │  │  ├─ /
    │        │  │  │  ├─ s
    │        │  │  │  │  ├─ ettings [142]
    │        │  │  │  │  │  ╰─ .
    │        │  │  │  │  │     ╰─ {format} [142]
    │        │  │  │  │  ╰─ ites [131]
    │        │  │  │  │     ├─ .
    │        │  │  │  │     │  ╰─ {format} [131]
    │        │  │  │  │     ╰─ /
    │        │  │  │  │        ├─ new [136]
    │        │  │  │  │        │  ╰─ .
    │        │  │  │  │        │     ╰─ {format} [136]
    │        │  │  │  │        ╰─ {id} [137]
    │        │  │  │  │           ├─ .
    │        │  │  │  │           │  ╰─ {format} [137]
    │        │  │  │  │           ╰─ /
    │        │  │  │  │              ├─ replication [135]
    │        │  │  │  │              │  ├─ .
    │        │  │  │  │              │  │  ╰─ {format} [135]
    │        │  │  │  │              │  ╰─ /
    │        │  │  │  │              │     ╰─ {replicable_name_plural} [140]
    │        │  │  │  │              │        ╰─ .
    │        │  │  │  │              │           ╰─ {format} [140]
    │        │  │  │  │              ╰─ edit [132]
    │        │  │  │  │                 ╰─ .
    │        │  │  │  │                    ╰─ {format} [132]
    │        │  │  │  ╰─ replication [1866]
    │        │  │  │     ├─ .
    │        │  │  │     │  ╰─ {format} [1866]
    │        │  │  │     ╰─ /
    │        │  │  │        ╰─ {replicable_name_plural} [139]
    │        │  │  │           ╰─ .
    │        │  │  │              ╰─ {format} [139]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [133]
    │        │  ╰─ it
    │        │     ├─ aly_servers [145]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [145]
    │        │     ╰─ lab_duo [146]
    │        │        ├─ /
    │        │        │  ├─ seat_utilization [148]
    │        │        │  │  ╰─ .
    │        │        │  │     ╰─ {format} [148]
    │        │        │  ╰─ configuration [147]
    │        │        │     ╰─ .
    │        │        │        ╰─ {format} [147]
    │        │        ╰─ .
    │        │           ╰─ {format} [146]
    │        ├─ h
    │        │  ├─ ealth_check [159]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [159]
    │        │  ╰─ ooks [162]
    │        │     ├─ .
    │        │     │  ╰─ {format} [162]
    │        │     ╰─ /
    │        │        ├─ {id} [163]
    │        │        │  ├─ /
    │        │        │  │  ├─ edit [164]
    │        │        │  │  │  ╰─ .
    │        │        │  │  │     ╰─ {format} [164]
    │        │        │  │  ╰─ test [166]
    │        │        │  │     ╰─ .
    │        │        │  │        ╰─ {format} [166]
    │        │        │  ╰─ .
    │        │        │     ╰─ {format} [163]
    │        │        ╰─ {hook_id}
    │        │           ╰─ /hook_logs/
    │        │              ╰─ {id} [161]
    │        │                 ├─ /retry [160]
    │        │                 │  ╰─ .
    │        │                 │     ╰─ {format} [160]
    │        │                 ╰─ .
    │        │                    ╰─ {format} [161]
    │        ├─ i
    │        │  ├─ n
    │        │  │  ├─ stance_review [183]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [183]
    │        │  │  ╰─ itial_setup [181]
    │        │  │     ├─ /new [180]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [180]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [181]
    │        │  ╰─ mpersonation [179]
    │        │     ╰─ .
    │        │        ╰─ {format} [179]
    │        ├─ l
    │        │  ├─ icense [202]
    │        │  │  ├─ /
    │        │  │  │  ├─ sync_seat_link [206]
    │        │  │  │  │  ╰─ .
    │        │  │  │  │     ╰─ {format} [206]
    │        │  │  │  ├─ usage_export [207]
    │        │  │  │  │  ╰─ .
    │        │  │  │  │     ╰─ {format} [207]
    │        │  │  │  ╰─ download [204]
    │        │  │  │     ╰─ .
    │        │  │  │        ╰─ {format} [204]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [202]
    │        │  ╰─ abels [194]
    │        │     ├─ .
    │        │     │  ╰─ {format} [194]
    │        │     ╰─ /
    │        │        ├─ new [198]
    │        │        │  ╰─ .
    │        │        │     ╰─ {format} [198]
    │        │        ╰─ {id} [195]
    │        │           ├─ /edit [196]
    │        │           │  ╰─ .
    │        │           │     ╰─ {format} [196]
    │        │           ╰─ .
    │        │              ╰─ {format} [195]
    │        ├─ p
    │        │  ├─ lan_limits [211]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [211]
    │        │  ├─ ush_rule [220]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [220]
    │        │  ╰─ rojects [214]
    │        │     ├─ .
    │        │     │  ╰─ {format} [214]
    │        │     ╰─ /
    │        │        ╰─ {*namespace_id}
    │        │           ╰─ /
    │        │              ├─ {id:4} [212]
    │        │              │  ├─ /
    │        │              │  │  ├─ repository_check [215]
    │        │              │  │  │  ╰─ .
    │        │              │  │  │     ╰─ {format} [215]
    │        │              │  │  ├─ transfer [217]
    │        │              │  │  │  ╰─ .
    │        │              │  │  │     ╰─ {format} [217]
    │        │              │  │  ╰─ edit [213]
    │        │              │  │     ╰─ .
    │        │              │  │        ╰─ {format} [213]
    │        │              │  ╰─ .
    │        │              │     ╰─ {format} [212]
    │        │              ╰─ {project_id:4}
    │        │                 ╰─ /runner_projects [224]
    │        │                    ├─ .
    │        │                    │  ╰─ {format} [224]
    │        │                    ╰─ /
    │        │                       ╰─ {id:4} [225]
    │        │                          ╰─ .
    │        │                             ╰─ {format} [225]
    │        ├─ r
    │        │  ├─ unners [229]
    │        │  │  ├─ .
    │        │  │  │  ╰─ {format} [229]
    │        │  │  ╰─ /
    │        │  │     ├─ runner_setup_scripts [234]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [234]
    │        │  │     ├─ dashboard [226]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [226]
    │        │  │     ├─ tag_list [236]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [236]
    │        │  │     ├─ new [230]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [230]
    │        │  │     ╰─ {id} [227]
    │        │  │        ├─ /
    │        │  │        │  ├─ re
    │        │  │        │  │  ├─ gister [232]
    │        │  │        │  │  │  ╰─ .
    │        │  │        │  │  │     ╰─ {format} [232]
    │        │  │        │  │  ╰─ sume [233]
    │        │  │        │  │     ╰─ .
    │        │  │        │  │        ╰─ {format} [233]
    │        │  │        │  ├─ pause [231]
    │        │  │        │  │  ╰─ .
    │        │  │        │  │     ╰─ {format} [231]
    │        │  │        │  ╰─ edit [228]
    │        │  │        │     ╰─ .
    │        │  │        │        ╰─ {format} [228]
    │        │  │        ╰─ .
    │        │  │           ╰─ {format} [227]
    │        │  ╰─ ole_promotion_requests [223]
    │        │     ╰─ .
    │        │        ╰─ {format} [223]
    │        ╰─ s
    │           ├─ ubscription [247]
    │           │  ╰─ .
    │           │     ╰─ {format} [247]
    │           ├─ ystem_info [248]
    │           │  ╰─ .
    │           │     ╰─ {format} [248]
    │           ├─ pam_logs [245]
    │           │  ├─ .
    │           │  │  ╰─ {format} [245]
    │           │  ╰─ /
    │           │     ╰─ {id} [244]
    │           │        ├─ /mark_as_ham [246]
    │           │        │  ╰─ .
    │           │        │     ╰─ {format} [246]
    │           │        ╰─ .
    │           │           ╰─ {format} [244]
    │           ├─ ession [239]
    │           │  ├─ /
    │           │  │  ├─ destroy [240]
    │           │  │  │  ╰─ .
    │           │  │  │     ╰─ {format} [240]
    │           │  │  ╰─ new [241]
    │           │  │     ╰─ .
    │           │  │        ╰─ {format} [241]
    │           │  ╰─ .
    │           │     ╰─ {format} [239]
    │           ╰─ idekiq [11]
    ├─ f
    │  ├─ iles/note/
    │  │  ╰─ {id}
    │  │     ╰─ /
    │  │        ╰─ {filename:0} [1867]
    │  │           ╰─ .
    │  │              ╰─ {format} [1867]
    │  ╰─ avicon.
    │     ├─ ico [1808]
    │     │  ╰─ .
    │     │     ╰─ {format} [1808]
    │     ╰─ png [1809]
    │        ╰─ .
    │           ╰─ {format} [1809]
    ├─ g
    │  ├─ itlab_experiment_engine/
    │  │  ╰─ {id} [377]
    │  │     ╰─ .
    │  │        ╰─ {format} [377]
    │  ╰─ roups [401]
    │     ├─ .
    │     │  ╰─ {format} [401]
    │     ╰─ /
    │        ├─ new [411]
    │        │  ╰─ .
    │        │     ╰─ {format} [411]
    │        ├─ {*group_id:2}
    │        │  ╰─ /-/
    │        │     ├─ analytics/dashboards [449]
    │        │     │  ╰─ /
    │        │     │     ╰─ {*vueroute} [449]
    │        │     ├─ uploads/
    │        │     │  ╰─ {secret}
    │        │     │     ╰─ /
    │        │     │        ╰─ {filename:0} [757]
    │        │     ╰─ wikis/
    │        │        ├─ {*id}
    │        │        │  ╰─ /
    │        │        │     ├─ preview_markdown [772]
    │        │        │     ├─ history [769]
    │        │        │     ├─ diff [766]
    │        │        │     ├─ edit [767]
    │        │        │     ╰─ raw [773]
    │        │        ╰─ {*id} [765]
    │        ├─ {*group_id}
    │        │  ╰─ /-/
    │        │     ├─ w
    │        │     │  ├─ ikis [764]
    │        │     │  │  ├─ /
    │        │     │  │  │  ├─ -/confluence [489]
    │        │     │  │  │  │  ╰─ .
    │        │     │  │  │  │     ╰─ {format} [489]
    │        │     │  │  │  ├─ git_access [768]
    │        │     │  │  │  │  ╰─ .
    │        │     │  │  │  │     ╰─ {format} [768]
    │        │     │  │  │  ├─ templates [775]
    │        │     │  │  │  │  ╰─ .
    │        │     │  │  │  │     ╰─ {format} [775]
    │        │     │  │  │  ├─ pages [771]
    │        │     │  │  │  │  ╰─ .
    │        │     │  │  │  │     ╰─ {format} [771]
    │        │     │  │  │  ╰─ new [770]
    │        │     │  │  │     ╰─ .
    │        │     │  │  │        ╰─ {format} [770]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [764]
    │        │     │  ╰─ ork_items [779]
    │        │     │     ├─ .
    │        │     │     │  ╰─ {format} [779]
    │        │     │     ╰─ /
    │        │     │        ╰─ {iid} [780]
    │        │     │           ├─ /descriptions/
    │        │     │           │  ╰─ {version_id} [777]
    │        │     │           │     ├─ /diff [778]
    │        │     │           │     │  ╰─ .
    │        │     │           │     │     ╰─ {format} [778]
    │        │     │           │     ╰─ .
    │        │     │           │        ╰─ {format} [777]
    │        │     │           ╰─ .
    │        │     │              ╰─ {format} [780]
    │        │     ├─ notification_setting [629]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [629]
    │        │     ├─ variables [761]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [761]
    │        │     ├─ group_
    │        │     │  ├─ members [560]
    │        │     │  │  ├─ .
    │        │     │  │  │  ╰─ {format} [560]
    │        │     │  │  ╰─ /
    │        │     │  │     ├─ bulk_reassignment_file [557]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [557]
    │        │     │  │     ├─ request_access [563]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [563]
    │        │     │  │     ├─ export_csv [559]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [559]
    │        │     │  │     ├─ leave [561]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [561]
    │        │     │  │     ╰─ {id} [558]
    │        │     │  │        ├─ .
    │        │     │  │        │  ╰─ {format} [558]
    │        │     │  │        ╰─ /
    │        │     │  │           ├─ approve_access_request [555]
    │        │     │  │           │  ╰─ .
    │        │     │  │           │     ╰─ {format} [555]
    │        │     │  │           ├─ resend_invite [565]
    │        │     │  │           │  ╰─ .
    │        │     │  │           │     ╰─ {format} [565]
    │        │     │  │           ├─ override [562]
    │        │     │  │           │  ╰─ .
    │        │     │  │           │     ╰─ {format} [562]
    │        │     │  │           ├─ unban [566]
    │        │     │  │           │  ╰─ .
    │        │     │  │           │     ╰─ {format} [566]
    │        │     │  │           ╰─ ban [556]
    │        │     │  │              ╰─ .
    │        │     │  │                 ╰─ {format} [556]
    │        │     │  ╰─ links/
    │        │     │     ╰─ {id:16} [552]
    │        │     │        ╰─ .
    │        │     │           ╰─ {format} [552]
    │        │     ├─ a
    │        │     │  ├─ chievements [424]
    │        │     │  │  ├─ .
    │        │     │  │  │  ╰─ {format} [424]
    │        │     │  │  ╰─ /
    │        │     │  │     ├─ new [425]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [425]
    │        │     │  │     ╰─ {id}
    │        │     │  │        ╰─ /edit [423]
    │        │     │  │           ╰─ .
    │        │     │  │              ╰─ {format} [423]
    │        │     │  ├─ vatar [467]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [467]
    │        │     │  ├─ dd_ons/discover_duo_
    │        │     │  │  ├─ enterprise [426]
    │        │     │  │  │  ╰─ .
    │        │     │  │  │     ╰─ {format} [426]
    │        │     │  │  ╰─ pro [427]
    │        │     │  │     ╰─ .
    │        │     │  │        ╰─ {format} [427]
    │        │     │  ├─ nalytics [1862]
    │        │     │  │  ├─ .
    │        │     │  │  │  ╰─ {format} [1862]
    │        │     │  │  ╰─ /
    │        │     │  │     ├─ type_of_work/tasks_by_type [454]
    │        │     │  │     │  ├─ /top_labels [455]
    │        │     │  │     │  │  ╰─ .
    │        │     │  │     │  │     ╰─ {format} [455]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [454]
    │        │     │  │     ├─ merge_request_analytics [451]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [451]
    │        │     │  │     ├─ productivity_analytics [452]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [452]
    │        │     │  │     ├─ value_stream_analytics [430]
    │        │     │  │     │  ├─ /
    │        │     │  │     │  │  ├─ time_summary [440]
    │        │     │  │     │  │  │  ╰─ .
    │        │     │  │     │  │  │     ╰─ {format} [440]
    │        │     │  │     │  │  ├─ cycle_times [437]
    │        │     │  │     │  │  │  ╰─ .
    │        │     │  │     │  │  │     ╰─ {format} [437]
    │        │     │  │     │  │  ├─ lead_times [438]
    │        │     │  │     │  │  │  ╰─ .
    │        │     │  │     │  │  │     ╰─ {format} [438]
    │        │     │  │     │  │  ├─ summary [439]
    │        │     │  │     │  │  │  ╰─ .
    │        │     │  │     │  │  │     ╰─ {format} [439]
    │        │     │  │     │  │  ╰─ value_streams [441]
    │        │     │  │     │  │     ├─ .
    │        │     │  │     │  │     │  ╰─ {format} [441]
    │        │     │  │     │  │     ╰─ /
    │        │     │  │     │  │        ├─ new [445]
    │        │     │  │     │  │        │  ╰─ .
    │        │     │  │     │  │        │     ╰─ {format} [445]
    │        │     │  │     │  │        ├─ {id} [442]
    │        │     │  │     │  │        │  ├─ /edit [443]
    │        │     │  │     │  │        │  │  ╰─ .
    │        │     │  │     │  │        │  │     ╰─ {format} [443]
    │        │     │  │     │  │        │  ╰─ .
    │        │     │  │     │  │        │     ╰─ {format} [442]
    │        │     │  │     │  │        ╰─ {value_stream_id}
    │        │     │  │     │  │           ╰─ /stages [434]
    │        │     │  │     │  │              ├─ .
    │        │     │  │     │  │              │  ╰─ {format} [434]
    │        │     │  │     │  │              ╰─ /
    │        │     │  │     │  │                 ╰─ {id}
    │        │     │  │     │  │                    ╰─ /
    │        │     │  │     │  │                       ├─ average [431]
    │        │     │  │     │  │                       │  ├─ _duration_chart [432]
    │        │     │  │     │  │                       │  │  ╰─ .
    │        │     │  │     │  │                       │  │     ╰─ {format} [432]
    │        │     │  │     │  │                       │  ╰─ .
    │        │     │  │     │  │                       │     ╰─ {format} [431]
    │        │     │  │     │  │                       ├─ records [436]
    │        │     │  │     │  │                       │  ╰─ .
    │        │     │  │     │  │                       │     ╰─ {format} [436]
    │        │     │  │     │  │                       ├─ median [435]
    │        │     │  │     │  │                       │  ╰─ .
    │        │     │  │     │  │                       │     ╰─ {format} [435]
    │        │     │  │     │  │                       ╰─ count [433]
    │        │     │  │     │  │                          ╰─ .
    │        │     │  │     │  │                             ╰─ {format} [433]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [430]
    │        │     │  │     ├─ repository_analytics [453]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [453]
    │        │     │  │     ├─ devops_adoption [450]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [450]
    │        │     │  │     ╰─ c
    │        │     │  │        ├─ overage_reports [429]
    │        │     │  │        │  ╰─ .
    │        │     │  │        │     ╰─ {format} [429]
    │        │     │  │        ├─ ycle_analytics [1855]
    │        │     │  │        │  ╰─ .
    │        │     │  │        │     ╰─ {format} [1855]
    │        │     │  │        ╰─ i_cd [428]
    │        │     │  │           ╰─ .
    │        │     │  │              ╰─ {format} [428]
    │        │     │  ╰─ u
    │        │     │     ├─ tocomplete_sources/
    │        │     │     │  ├─ vulnerabilities [465]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [465]
    │        │     │     │  ├─ commands [457]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [457]
    │        │     │     │  ├─ labels [461]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [461]
    │        │     │     │  ├─ epics [458]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [458]
    │        │     │     │  ├─ wikis [466]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [466]
    │        │     │     │  ├─ i
    │        │     │     │  │  ├─ terations [460]
    │        │     │     │  │  │  ╰─ .
    │        │     │     │  │  │     ╰─ {format} [460]
    │        │     │     │  │  ╰─ ssues [459]
    │        │     │     │  │     ╰─ .
    │        │     │     │  │        ╰─ {format} [459]
    │        │     │     │  ╰─ m
    │        │     │     │     ├─ ilestones [464]
    │        │     │     │     │  ╰─ .
    │        │     │     │     │     ╰─ {format} [464]
    │        │     │     │     ╰─ e
    │        │     │     │        ├─ rge_requests [463]
    │        │     │     │        │  ╰─ .
    │        │     │     │        │     ╰─ {format} [463]
    │        │     │     │        ╰─ mbers [462]
    │        │     │     │           ╰─ .
    │        │     │     │              ╰─ {format} [462]
    │        │     │     ╰─ dit_events [456]
    │        │     │        ╰─ .
    │        │     │           ╰─ {format} [456]
    │        │     ├─ b
    │        │     │  ├─ illings [468]
    │        │     │  │  ├─ /refresh_seats [469]
    │        │     │  │  │  ╰─ .
    │        │     │  │  │     ╰─ {format} [469]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [468]
    │        │     │  ╰─ oards [470]
    │        │     │     ├─ .
    │        │     │     │  ╰─ {format} [470]
    │        │     │     ╰─ /
    │        │     │        ╰─ {id:3} [471]
    │        │     │           ╰─ .
    │        │     │              ╰─ {format} [471]
    │        │     ├─ c
    │        │     │  ├─ ustom_emoji [497]
    │        │     │  │  ├─ /new [498]
    │        │     │  │  │  ╰─ .
    │        │     │  │  │     ╰─ {format} [498]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [497]
    │        │     │  ├─ hildren [472]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [472]
    │        │     │  ├─ lusters [479]
    │        │     │  │  ├─ .
    │        │     │  │  │  ╰─ {format} [479]
    │        │     │  │  ╰─ /
    │        │     │  │     ├─ new_cluster_docs [482]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [482]
    │        │     │  │     ├─ c
    │        │     │  │     │  ├─ reate_user [476]
    │        │     │  │     │  │  ╰─ .
    │        │     │  │     │  │     ╰─ {format} [476]
    │        │     │  │     │  ╰─ onnect [475]
    │        │     │  │     │     ╰─ .
    │        │     │  │     │        ╰─ {format} [475]
    │        │     │  │     ├─ {id} [477]
    │        │     │  │     │  ├─ /
    │        │     │  │     │  │  ├─ environments [478]
    │        │     │  │     │  │  │  ╰─ .
    │        │     │  │     │  │  │     ╰─ {format} [478]
    │        │     │  │     │  │  ├─ metrics [480]
    │        │     │  │     │  │  │  ├─ _dashboard [481]
    │        │     │  │     │  │  │  │  ╰─ .
    │        │     │  │     │  │  │  │     ╰─ {format} [481]
    │        │     │  │     │  │  │  ╰─ .
    │        │     │  │     │  │  │     ╰─ {format} [480]
    │        │     │  │     │  │  ╰─ cl
    │        │     │  │     │  │     ├─ uster_status [474]
    │        │     │  │     │  │     │  ╰─ .
    │        │     │  │     │  │     │     ╰─ {format} [474]
    │        │     │  │     │  │     ╰─ ear_cache [473]
    │        │     │  │     │  │        ╰─ .
    │        │     │  │     │  │           ╰─ {format} [473]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [477]
    │        │     │  │     ╰─ {cluster_id}
    │        │     │  │        ╰─ /integration/create_or_update [486]
    │        │     │  │           ╰─ .
    │        │     │  │              ╰─ {format} [486]
    │        │     │  ├─ adences [589]
    │        │     │  │  ├─ .
    │        │     │  │  │  ╰─ {format} [589]
    │        │     │  │  ╰─ /
    │        │     │  │     ├─ new [590]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [590]
    │        │     │  │     ├─ {id} [588]
    │        │     │  │     │  ├─ /edit [592]
    │        │     │  │     │  │  ╰─ .
    │        │     │  │     │  │     ╰─ {format} [592]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [588]
    │        │     │  │     ├─ {iteration_cadence_id}
    │        │     │  │     │  ╰─ /iterations [593]
    │        │     │  │     │     ├─ /
    │        │     │  │     │     │  ├─ new [594]
    │        │     │  │     │     │  │  ╰─ .
    │        │     │  │     │     │  │     ╰─ {format} [594]
    │        │     │  │     │     │  ╰─ {id:3} [595]
    │        │     │  │     │     │     ├─ /edit [596]
    │        │     │  │     │     │     │  ╰─ .
    │        │     │  │     │     │     │     ╰─ {format} [596]
    │        │     │  │     │     │     ╰─ .
    │        │     │  │     │     │        ╰─ {format} [595]
    │        │     │  │     │     ╰─ .
    │        │     │  │     │        ╰─ {format} [593]
    │        │     │  │     ├─ {*vueroute}
    │        │     │  │     │  ├─ .
    │        │     │  │     │  │  ╰─ {format} [589]
    │        │     │  │     │  ╰─ /
    │        │     │  │     │     ├─ new [590]
    │        │     │  │     │     │  ╰─ .
    │        │     │  │     │     │     ╰─ {format} [590]
    │        │     │  │     │     ├─ {id} [588]
    │        │     │  │     │     │  ├─ /edit [592]
    │        │     │  │     │     │  │  ╰─ .
    │        │     │  │     │     │  │     ╰─ {format} [592]
    │        │     │  │     │     │  ╰─ .
    │        │     │  │     │     │     ╰─ {format} [588]
    │        │     │  │     │     ╰─ {iteration_cadence_id}
    │        │     │  │     │        ╰─ /iterations [593]
    │        │     │  │     │           ├─ /
    │        │     │  │     │           │  ├─ new [594]
    │        │     │  │     │           │  │  ╰─ .
    │        │     │  │     │           │  │     ╰─ {format} [594]
    │        │     │  │     │           │  ╰─ {id:3} [595]
    │        │     │  │     │           │     ├─ /edit [596]
    │        │     │  │     │           │     │  ╰─ .
    │        │     │  │     │           │     │     ╰─ {format} [596]
    │        │     │  │     │           │     ╰─ .
    │        │     │  │     │           │        ╰─ {format} [595]
    │        │     │  │     │           ╰─ .
    │        │     │  │     │              ╰─ {format} [593]
    │        │     │  │     ╰─ {*vueroute} [589]
    │        │     │  ├─ rm/
    │        │     │  │  ├─ contacts [492]
    │        │     │  │  │  ├─ .
    │        │     │  │  │  │  ╰─ {format} [492]
    │        │     │  │  │  ╰─ /
    │        │     │  │  │     ├─ new [493]
    │        │     │  │  │     │  ╰─ .
    │        │     │  │  │     │     ╰─ {format} [493]
    │        │     │  │  │     ╰─ {id}
    │        │     │  │  │        ╰─ /edit [491]
    │        │     │  │  │           ╰─ .
    │        │     │  │  │              ╰─ {format} [491]
    │        │     │  │  ╰─ organizations [495]
    │        │     │  │     ├─ .
    │        │     │  │     │  ╰─ {format} [495]
    │        │     │  │     ╰─ /
    │        │     │  │        ├─ new [496]
    │        │     │  │        │  ╰─ .
    │        │     │  │        │     ╰─ {format} [496]
    │        │     │  │        ╰─ {id}
    │        │     │  │           ╰─ /edit [494]
    │        │     │  │              ╰─ .
    │        │     │  │                 ╰─ {format} [494]
    │        │     │  ╰─ o
    │        │     │     ├─ nt
    │        │     │     │  ├─ ribution_analytics [490]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [490]
    │        │     │     │  ╰─ ainer_registries [645]
    │        │     │     │     ├─ .
    │        │     │     │     │  ╰─ {format} [645]
    │        │     │     │     ╰─ /
    │        │     │     │        ╰─ {id} [646]
    │        │     │     │           ╰─ .
    │        │     │     │              ╰─ {format} [646]
    │        │     │     ╰─ mment_templates [487]
    │        │     │        ├─ .
    │        │     │        │  ╰─ {format} [487]
    │        │     │        ╰─ /
    │        │     │           ╰─ {id} [488]
    │        │     │              ╰─ .
    │        │     │                 ╰─ {format} [488]
    │        │     ├─ d
    │        │     │  ├─ iscover [513]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [513]
    │        │     │  ╰─ ep
    │        │     │     ├─ loy_tokens/
    │        │     │     │  ╰─ {id:3}
    │        │     │     │     ╰─ /revoke [512]
    │        │     │     │        ╰─ .
    │        │     │     │           ╰─ {format} [512]
    │        │     │     ╰─ endenc
    │        │     │        ├─ y_proxy [502]
    │        │     │        │  ╰─ .
    │        │     │        │     ╰─ {format} [502]
    │        │     │        ╰─ ies [499]
    │        │     │           ├─ /l
    │        │     │           │  ├─ ocations [501]
    │        │     │           │  │  ╰─ .
    │        │     │           │  │     ╰─ {format} [501]
    │        │     │           │  ╰─ icenses [500]
    │        │     │           │     ╰─ .
    │        │     │           │        ╰─ {format} [500]
    │        │     │           ╰─ .
    │        │     │              ╰─ {format} [499]
    │        │     ├─ e
    │        │     │  ├─ arly_access_opt_in [514]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [514]
    │        │     │  ╰─ pic
    │        │     │     ├─ _boards [516]
    │        │     │     │  ├─ .
    │        │     │     │  │  ╰─ {format} [516]
    │        │     │     │  ╰─ /
    │        │     │     │     ╰─ {id} [517]
    │        │     │     │        ╰─ .
    │        │     │     │           ╰─ {format} [517]
    │        │     │     ╰─ s [524]
    │        │     │        ├─ .
    │        │     │        │  ╰─ {format} [524]
    │        │     │        ╰─ /
    │        │     │           ├─ bulk_update [523]
    │        │     │           │  ╰─ .
    │        │     │           │     ╰─ {format} [523]
    │        │     │           ├─ new [531]
    │        │     │           │  ╰─ .
    │        │     │           │     ╰─ {format} [531]
    │        │     │           ├─ {epic_id:3}
    │        │     │           │  ╰─ /
    │        │     │           │     ├─ related_epic_links [549]
    │        │     │           │     │  ├─ .
    │        │     │           │     │  │  ╰─ {format} [549]
    │        │     │           │     │  ╰─ /
    │        │     │           │     │     ╰─ {id:3} [550]
    │        │     │           │     │        ╰─ .
    │        │     │           │     │           ╰─ {format} [550]
    │        │     │           │     ├─ issues [518]
    │        │     │           │     │  ├─ .
    │        │     │           │     │  │  ╰─ {format} [518]
    │        │     │           │     │  ╰─ /
    │        │     │           │     │     ╰─ {id:3} [519]
    │        │     │           │     │        ╰─ .
    │        │     │           │     │           ╰─ {format} [519]
    │        │     │           │     ├─ links [538]
    │        │     │           │     │  ├─ .
    │        │     │           │     │  │  ╰─ {format} [538]
    │        │     │           │     │  ╰─ /
    │        │     │           │     │     ╰─ {id:3} [539]
    │        │     │           │     │        ╰─ .
    │        │     │           │     │           ╰─ {format} [539]
    │        │     │           │     ╰─ notes [543]
    │        │     │           │        ├─ .
    │        │     │           │        │  ╰─ {format} [543]
    │        │     │           │        ╰─ /
    │        │     │           │           ╰─ {id:3} [544]
    │        │     │           │              ├─ /toggle_award_emoji [546]
    │        │     │           │              │  ╰─ .
    │        │     │           │              │     ╰─ {format} [546]
    │        │     │           │              ╰─ .
    │        │     │           │                 ╰─ {format} [544]
    │        │     │           ╰─ {id:3} [527]
    │        │     │              ├─ /
    │        │     │              │  ├─ toggle_
    │        │     │              │  │  ├─ subscription [535]
    │        │     │              │  │  │  ╰─ .
    │        │     │              │  │  │     ╰─ {format} [535]
    │        │     │              │  │  ╰─ award_emoji [534]
    │        │     │              │  │     ╰─ .
    │        │     │              │  │        ╰─ {format} [534]
    │        │     │              │  ├─ realtime_changes [532]
    │        │     │              │  │  ╰─ .
    │        │     │              │  │     ╰─ {format} [532]
    │        │     │              │  ├─ edit [529]
    │        │     │              │  │  ╰─ .
    │        │     │              │  │     ╰─ {format} [529]
    │        │     │              │  ╰─ d
    │        │     │              │     ├─ iscussions [528]
    │        │     │              │     │  ╰─ .
    │        │     │              │     │     ╰─ {format} [528]
    │        │     │              │     ╰─ escriptions/
    │        │     │              │        ╰─ {version_id} [525]
    │        │     │              │           ├─ /diff [526]
    │        │     │              │           │  ╰─ .
    │        │     │              │           │     ╰─ {format} [526]
    │        │     │              │           ╰─ .
    │        │     │              │              ╰─ {format} [525]
    │        │     │              ╰─ .
    │        │     │                 ╰─ {format} [527]
    │        │     ├─ h
    │        │     │  ├─ arbor/repositories [570]
    │        │     │  │  ├─ .
    │        │     │  │  │  ╰─ {format} [570]
    │        │     │  │  ╰─ /
    │        │     │  │     ├─ {id:17} [571]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [571]
    │        │     │  │     ╰─ {repository_id:17}
    │        │     │  │        ╰─ /artifacts [569]
    │        │     │  │           ├─ .
    │        │     │  │           │  ╰─ {format} [569]
    │        │     │  │           ╰─ /
    │        │     │  │              ╰─ {artifact_id:17}
    │        │     │  │                 ╰─ /tags [572]
    │        │     │  │                    ╰─ .
    │        │     │  │                       ╰─ {format} [572]
    │        │     │  ╰─ ooks [575]
    │        │     │     ├─ .
    │        │     │     │  ╰─ {format} [575]
    │        │     │     ╰─ /
    │        │     │        ├─ {id:3} [576]
    │        │     │        │  ├─ /
    │        │     │        │  │  ├─ edit [577]
    │        │     │        │  │  │  ╰─ .
    │        │     │        │  │  │     ╰─ {format} [577]
    │        │     │        │  │  ╰─ test [579]
    │        │     │        │  │     ╰─ .
    │        │     │        │  │        ╰─ {format} [579]
    │        │     │        │  ╰─ .
    │        │     │        │     ╰─ {format} [576]
    │        │     │        ╰─ {hook_id:3}
    │        │     │           ╰─ /hook_logs/
    │        │     │              ╰─ {id:3} [574]
    │        │     │                 ├─ /retry [573]
    │        │     │                 │  ╰─ .
    │        │     │                 │     ╰─ {format} [573]
    │        │     │                 ╰─ .
    │        │     │                    ╰─ {format} [574]
    │        │     ├─ i
    │        │     │  ├─ n
    │        │     │  │  ├─ frastructure_registry [1864]
    │        │     │  │  │  ╰─ .
    │        │     │  │  │     ╰─ {format} [1864]
    │        │     │  │  ╰─ sights [585]
    │        │     │  │     ├─ /query [584]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [584]
    │        │     │  │     ╰─ .
    │        │     │  │        ╰─ {format} [585]
    │        │     │  ├─ mport [582]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [582]
    │        │     │  ├─ terations [601]
    │        │     │  │  ├─ .
    │        │     │  │  │  ╰─ {format} [601]
    │        │     │  │  ╰─ /
    │        │     │  │     ├─ new [602]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [602]
    │        │     │  │     ╰─ {id:3} [603]
    │        │     │  │        ├─ /edit [600]
    │        │     │  │        │  ╰─ .
    │        │     │  │        │     ╰─ {format} [600]
    │        │     │  │        ╰─ .
    │        │     │  │           ╰─ {format} [603]
    │        │     │  ╰─ ssues
    │        │     │     ├─ /bulk_update [586]
    │        │     │     │  ╰─ .
    │        │     │     │     ╰─ {format} [586]
    │        │     │     ╰─ _analytics [587]
    │        │     │        ╰─ .
    │        │     │           ╰─ {format} [587]
    │        │     ├─ l
    │        │     │  ├─ dap
    │        │     │  │  ├─ /sync [615]
    │        │     │  │  │  ╰─ .
    │        │     │  │  │     ╰─ {format} [615]
    │        │     │  │  ╰─ _group_links [612]
    │        │     │  │     ├─ .
    │        │     │  │     │  ╰─ {format} [612]
    │        │     │  │     ╰─ /
    │        │     │  │        ╰─ {id} [613]
    │        │     │  │           ╰─ .
    │        │     │  │              ╰─ {format} [613]
    │        │     │  ╰─ abels [604]
    │        │     │     ├─ .
    │        │     │     │  ╰─ {format} [604]
    │        │     │     ╰─ /
    │        │     │        ├─ new [608]
    │        │     │        │  ╰─ .
    │        │     │        │     ╰─ {format} [608]
    │        │     │        ╰─ {id} [605]
    │        │     │           ├─ /
    │        │     │           │  ├─ toggle_subscription [609]
    │        │     │           │  │  ╰─ .
    │        │     │           │  │     ╰─ {format} [609]
    │        │     │           │  ╰─ edit [606]
    │        │     │           │     ╰─ .
    │        │     │           │        ╰─ {format} [606]
    │        │     │           ╰─ .
    │        │     │              ╰─ {format} [605]
    │        │     ├─ m
    │        │     │  ├─ erge_requests/bulk_update [616]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [616]
    │        │     │  ╰─ ilestones [617]
    │        │     │     ├─ .
    │        │     │     │  ╰─ {format} [617]
    │        │     │     ╰─ /
    │        │     │        ├─ new [624]
    │        │     │        │  ╰─ .
    │        │     │        │     ╰─ {format} [624]
    │        │     │        ╰─ {id:0} [618]
    │        │     │           ├─ /
    │        │     │           │  ├─ merge_requests [623]
    │        │     │           │  │  ╰─ .
    │        │     │           │  │     ╰─ {format} [623]
    │        │     │           │  ├─ participants [625]
    │        │     │           │  │  ╰─ .
    │        │     │           │  │     ╰─ {format} [625]
    │        │     │           │  ├─ issues [621]
    │        │     │           │  │  ╰─ .
    │        │     │           │  │     ╰─ {format} [621]
    │        │     │           │  ├─ labels [622]
    │        │     │           │  │  ╰─ .
    │        │     │           │  │     ╰─ {format} [622]
    │        │     │           │  ╰─ edit [619]
    │        │     │           │     ╰─ .
    │        │     │           │        ╰─ {format} [619]
    │        │     │           ╰─ .
    │        │     │              ╰─ {format} [618]
    │        │     ├─ p
    │        │     │  ├─ ush_rules [642]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [642]
    │        │     │  ├─ ackages [632]
    │        │     │  │  ├─ .
    │        │     │  │  │  ╰─ {format} [632]
    │        │     │  │  ╰─ /
    │        │     │  │     ╰─ {id} [633]
    │        │     │  │        ╰─ .
    │        │     │  │           ╰─ {format} [633]
    │        │     │  ╰─ r
    │        │     │     ├─ otected_
    │        │     │     │  ├─ environments [638]
    │        │     │     │  │  ├─ .
    │        │     │     │  │  │  ╰─ {format} [638]
    │        │     │     │  │  ╰─ /
    │        │     │     │  │     ╰─ {id} [639]
    │        │     │     │  │        ╰─ .
    │        │     │     │  │           ╰─ {format} [639]
    │        │     │     │  ╰─ branches [634]
    │        │     │     │     ├─ .
    │        │     │     │     │  ╰─ {format} [634]
    │        │     │     │     ╰─ /
    │        │     │     │        ╰─ {id} [635]
    │        │     │     │           ╰─ .
    │        │     │     │              ╰─ {format} [635]
    │        │     │     ╰─ eview_markdown [412]
    │        │     │        ╰─ .
    │        │     │           ╰─ {format} [412]
    │        │     ├─ r
    │        │     │  ├─ unners [652]
    │        │     │  │  ├─ .
    │        │     │  │  │  ╰─ {format} [652]
    │        │     │  │  ╰─ /
    │        │     │  │     ├─ dashboard [649]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [649]
    │        │     │  │     ├─ new [653]
    │        │     │  │     │  ╰─ .
    │        │     │  │     │     ╰─ {format} [653]
    │        │     │  │     ╰─ {id} [650]
    │        │     │  │        ├─ /
    │        │     │  │        │  ├─ re
    │        │     │  │        │  │  ├─ gister [655]
    │        │     │  │        │  │  │  ╰─ .
    │        │     │  │        │  │  │     ╰─ {format} [655]
    │        │     │  │        │  │  ╰─ sume [656]
    │        │     │  │        │  │     ╰─ .
    │        │     │  │        │  │        ╰─ {format} [656]
    │        │     │  │        │  ├─ pause [654]
    │        │     │  │        │  │  ╰─ .
    │        │     │  │        │  │     ╰─ {format} [654]
    │        │     │  │        │  ╰─ edit [651]
    │        │     │  │        │     ╰─ .
    │        │     │  │        │        ╰─ {format} [651]
    │        │     │  │        ╰─ .
    │        │     │  │           ╰─ {format} [650]
    │        │     │  ├─ oadmap [648]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [648]
    │        │     │  ╰─ e
    │        │     │     ├─ leases [647]
    │        │     │     │  ╰─ .
    │        │     │     │     ╰─ {format} [647]
    │        │     │     ╰─ store [414]
    │        │     │        ╰─ .
    │        │     │           ╰─ {format} [414]
    │        │     ├─ s
    │        │     │  ├─ hared_projects [749]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [749]
    │        │     │  ├─ cim_oauth [668]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [668]
    │        │     │  ├─ aml [663]
    │        │     │  │  ├─ /
    │        │     │  │  │  ├─ u
    │        │     │  │  │  │  ├─ pdate_microsoft_application [667]
    │        │     │  │  │  │  │  ╰─ .
    │        │     │  │  │  │  │     ╰─ {format} [667]
    │        │     │  │  │  │  ╰─ nlink [752]
    │        │     │  │  │  │     ╰─ .
    │        │     │  │  │  │        ╰─ {format} [752]
    │        │     │  │  │  ├─ callback [631]
    │        │     │  │  │  │  ╰─ .
    │        │     │  │  │  │     ╰─ {format} [631]
    │        │     │  │  │  ╰─ sso [750]
    │        │     │  │  │     ╰─ .
    │        │     │  │  │        ╰─ {format} [750]
    │        │     │  │  ├─ _group_links [660]
    │        │     │  │  │  ├─ .
    │        │     │  │  │  │  ╰─ {format} [660]
    │        │     │  │  │  ╰─ /
    │        │     │  │  │     ╰─ {id} [661]
    │        │     │  │  │        ╰─ .
    │        │     │  │  │           ╰─ {format} [661]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [663]
    │        │     │  ╰─ e
    │        │     │     ├─ ttings/
    │        │     │     │  ├─ packages_and_registries [736]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [736]
    │        │     │     │  ├─ domain_verification [716]
    │        │     │     │  │  ├─ .
    │        │     │     │  │  │  ╰─ {format} [716]
    │        │     │     │  │  ╰─ /
    │        │     │     │  │     ├─ new [719]
    │        │     │     │  │     │  ╰─ .
    │        │     │     │  │     │     ╰─ {format} [719]
    │        │     │     │  │     ╰─ {id:0} [717]
    │        │     │     │  │        ├─ /
    │        │     │     │  │        │  ├─ clean_certificate [715]
    │        │     │     │  │        │  │  ╰─ .
    │        │     │     │  │        │  │     ╰─ {format} [715]
    │        │     │     │  │        │  ├─ retry_auto_ssl [720]
    │        │     │     │  │        │  │  ╰─ .
    │        │     │     │  │        │  │     ╰─ {format} [720]
    │        │     │     │  │        │  ╰─ verify [724]
    │        │     │     │  │        │     ╰─ .
    │        │     │     │  │        │        ╰─ {format} [724]
    │        │     │     │  │        ╰─ .
    │        │     │     │  │           ╰─ {format} [717]
    │        │     │     │  ├─ merge_requests [734]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [734]
    │        │     │     │  ├─ i
    │        │     │     │  │  ├─ ntegrations [729]
    │        │     │     │  │  │  ├─ .
    │        │     │     │  │  │  │  ╰─ {format} [729]
    │        │     │     │  │  │  ╰─ /
    │        │     │     │  │  │     ╰─ {id} [732]
    │        │     │     │  │  │        ├─ .
    │        │     │     │  │  │        │  ╰─ {format} [732]
    │        │     │     │  │  │        ╰─ /
    │        │     │     │  │  │           ├─ reset [730]
    │        │     │     │  │  │           │  ╰─ .
    │        │     │     │  │  │           │     ╰─ {format} [730]
    │        │     │     │  │  │           ├─ edit [728]
    │        │     │     │  │  │           │  ╰─ .
    │        │     │     │  │  │           │     ╰─ {format} [728]
    │        │     │     │  │  │           ╰─ test [731]
    │        │     │     │  │  │              ╰─ .
    │        │     │     │  │  │                 ╰─ {format} [731]
    │        │     │     │  │  ╰─ ssues [748]
    │        │     │     │  │     ╰─ .
    │        │     │     │  │        ╰─ {format} [748]
    │        │     │     │  ├─ gitlab_duo [725]
    │        │     │     │  │  ├─ _usage [1863]
    │        │     │     │  │  │  ╰─ .
    │        │     │     │  │  │     ╰─ {format} [1863]
    │        │     │     │  │  ├─ .
    │        │     │     │  │  │  ╰─ {format} [725]
    │        │     │     │  │  ╰─ /
    │        │     │     │  │     ├─ seat_utilization [727]
    │        │     │     │  │     │  ╰─ .
    │        │     │     │  │     │     ╰─ {format} [727]
    │        │     │     │  │     ╰─ configuration [726]
    │        │     │     │  │        ╰─ .
    │        │     │     │  │           ╰─ {format} [726]
    │        │     │     │  ├─ workspaces [737]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [737]
    │        │     │     │  ├─ ci_cd [711]
    │        │     │     │  │  ├─ /
    │        │     │     │  │  │  ├─ deploy_token/create [739]
    │        │     │     │  │  │  │  ╰─ .
    │        │     │     │  │  │  │     ╰─ {format} [739]
    │        │     │     │  │  │  ├─ update_auto_devops [714]
    │        │     │     │  │  │  │  ╰─ .
    │        │     │     │  │  │  │     ╰─ {format} [714]
    │        │     │     │  │  │  ╰─ r
    │        │     │     │  │  │     ├─ eset_registration_token [709]
    │        │     │     │  │  │     │  ╰─ .
    │        │     │     │  │  │     │     ╰─ {format} [709]
    │        │     │     │  │  │     ╰─ unner_setup_scripts [710]
    │        │     │     │  │  │        ╰─ .
    │        │     │     │  │  │           ╰─ {format} [710]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [711]
    │        │     │     │  ├─ slack [746]
    │        │     │     │  │  ├─ /slack_auth [747]
    │        │     │     │  │  │  ╰─ .
    │        │     │     │  │  │     ╰─ {format} [747]
    │        │     │     │  │  ╰─ .
    │        │     │     │  │     ╰─ {format} [746]
    │        │     │     │  ├─ a
    │        │     │     │  │  ├─ ccess_tokens [694]
    │        │     │     │  │  │  ├─ .
    │        │     │     │  │  │  │  ╰─ {format} [694]
    │        │     │     │  │  │  ╰─ /
    │        │     │     │  │  │     ╰─ {id}
    │        │     │     │  │  │        ╰─ /revoke [696]
    │        │     │     │  │  │           ╰─ .
    │        │     │     │  │  │              ╰─ {format} [696]
    │        │     │     │  │  ├─ pplications [700]
    │        │     │     │  │  │  ├─ .
    │        │     │     │  │  │  │  ╰─ {format} [700]
    │        │     │     │  │  │  ╰─ /
    │        │     │     │  │  │     ├─ new [704]
    │        │     │     │  │  │     │  ╰─ .
    │        │     │     │  │  │     │     ╰─ {format} [704]
    │        │     │     │  │  │     ╰─ {id} [701]
    │        │     │     │  │  │        ├─ /
    │        │     │     │  │  │        │  ├─ renew [705]
    │        │     │     │  │  │        │  │  ╰─ .
    │        │     │     │  │  │        │  │     ╰─ {format} [705]
    │        │     │     │  │  │        │  ╰─ edit [702]
    │        │     │     │  │  │        │     ╰─ .
    │        │     │     │  │  │        │        ╰─ {format} [702]
    │        │     │     │  │  │        ╰─ .
    │        │     │     │  │  │           ╰─ {format} [701]
    │        │     │     │  │  ╰─ nalytics [697]
    │        │     │     │  │     ╰─ .
    │        │     │     │  │        ╰─ {format} [697]
    │        │     │     │  ╰─ r
    │        │     │     │     ├─ oles_and_permissions [743]
    │        │     │     │     │  ├─ .
    │        │     │     │     │  │  ╰─ {format} [743]
    │        │     │     │     │  ╰─ /
    │        │     │     │     │     ├─ new [744]
    │        │     │     │     │     │  ╰─ .
    │        │     │     │     │     │     ╰─ {format} [744]
    │        │     │     │     │     ╰─ {id} [745]
    │        │     │     │     │        ├─ /edit [742]
    │        │     │     │     │        │  ╰─ .
    │        │     │     │     │        │     ╰─ {format} [742]
    │        │     │     │     │        ╰─ .
    │        │     │     │     │           ╰─ {format} [745]
    │        │     │     │     ╰─ epo
    │        │     │     │        ├─ sitory [741]
    │        │     │     │        │  ├─ /deploy_token/create [740]
    │        │     │     │        │  │  ╰─ .
    │        │     │     │        │  │     ╰─ {format} [740]
    │        │     │     │        │  ╰─ .
    │        │     │     │        │     ╰─ {format} [741]
    │        │     │     │        ╰─ rting [738]
    │        │     │     │           ╰─ .
    │        │     │     │              ╰─ {format} [738]
    │        │     │     ├─ rvice_accounts [687]
    │        │     │     │  ├─ .
    │        │     │     │  │  ╰─ {format} [687]
    │        │     │     │  ╰─ /
    │        │     │     │     ├─ new [688]
    │        │     │     │     │  ╰─ .
    │        │     │     │     │     ╰─ {format} [688]
    │        │     │     │     ├─ {id} [686]
    │        │     │     │     │  ├─ /edit [690]
    │        │     │     │     │  │  ╰─ .
    │        │     │     │     │  │     ╰─ {format} [690]
    │        │     │     │     │  ╰─ .
    │        │     │     │     │     ╰─ {format} [686]
    │        │     │     │     ├─ {*vueroute}
    │        │     │     │     │  ├─ .
    │        │     │     │     │  │  ╰─ {format} [687]
    │        │     │     │     │  ╰─ /
    │        │     │     │     │     ├─ new [688]
    │        │     │     │     │     │  ╰─ .
    │        │     │     │     │     │     ╰─ {format} [688]
    │        │     │     │     │     ╰─ {id} [686]
    │        │     │     │     │        ├─ /edit [690]
    │        │     │     │     │        │  ╰─ .
    │        │     │     │     │        │     ╰─ {format} [690]
    │        │     │     │     │        ╰─ .
    │        │     │     │     │           ╰─ {format} [686]
    │        │     │     │     ╰─ {*vueroute} [687]
    │        │     │     ├─ at_usage [669]
    │        │     │     │  ╰─ .
    │        │     │     │     ╰─ {format} [669]
    │        │     │     ╰─ curity/
    │        │     │        ├─ merge_commit_reports [680]
    │        │     │        │  ╰─ .
    │        │     │        │     ╰─ {format:14} [680]
    │        │     │        ├─ vulnerabilities [685]
    │        │     │        │  ╰─ .
    │        │     │        │     ╰─ {format} [685]
    │        │     │        ├─ policies [682]
    │        │     │        │  ├─ .
    │        │     │        │  │  ╰─ {format} [682]
    │        │     │        │  ╰─ /
    │        │     │        │     ├─ schema [684]
    │        │     │        │     │  ╰─ .
    │        │     │        │     │     ╰─ {format} [684]
    │        │     │        │     ├─ new [683]
    │        │     │        │     │  ╰─ .
    │        │     │        │     │     ╰─ {format} [683]
    │        │     │        │     ╰─ {id:0}
    │        │     │        │        ╰─ /edit [681]
    │        │     │        │           ╰─ .
    │        │     │        │              ╰─ {format} [681]
    │        │     │        ├─ c
    │        │     │        │  ├─ redentials [676]
    │        │     │        │  │  ├─ .
    │        │     │        │  │  │  ╰─ {format} [676]
    │        │     │        │  │  ╰─ /
    │        │     │        │  │     ╰─ {id} [675]
    │        │     │        │  │        ├─ /revoke [677]
    │        │     │        │  │        │  ╰─ .
    │        │     │        │  │        │     ╰─ {format} [677]
    │        │     │        │  │        ╰─ .
    │        │     │        │  │           ╰─ {format} [675]
    │        │     │        │  ╰─ ompliance_
    │        │     │        │     ├─ standards_adherence_reports [673]
    │        │     │        │     │  ╰─ .
    │        │     │        │     │     ╰─ {format:14} [673]
    │        │     │        │     ├─ project_framework_reports [672]
    │        │     │        │     │  ╰─ .
    │        │     │        │     │     ╰─ {format:14} [672]
    │        │     │        │     ├─ framework_reports [671]
    │        │     │        │     │  ╰─ .
    │        │     │        │     │     ╰─ {format:14} [671]
    │        │     │        │     ├─ violation_reports [674]
    │        │     │        │     │  ╰─ .
    │        │     │        │     │     ╰─ {format:14} [674]
    │        │     │        │     ╰─ dashboard [670]
    │        │     │        │        ├─ .
    │        │     │        │        │  ╰─ {format} [670]
    │        │     │        │        ╰─ /
    │        │     │        │           ├─ {*vueroute}
    │        │     │        │           │  ╰─ .
    │        │     │        │           │     ╰─ {format} [670]
    │        │     │        │           ╰─ {*vueroute} [670]
    │        │     │        ╰─ d
    │        │     │           ├─ ashboard [678]
    │        │     │           │  ╰─ .
    │        │     │           │     ╰─ {format} [678]
    │        │     │           ╰─ iscover [679]
    │        │     │              ╰─ .
    │        │     │                 ╰─ {format} [679]
    │        │     ├─ t
    │        │     │  ├─ erraform_module_registry [583]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [583]
    │        │     │  ├─ wo_factor_auth [754]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [754]
    │        │     │  ╰─ odos [753]
    │        │     │     ╰─ .
    │        │     │        ╰─ {format} [753]
    │        │     ╰─ u
    │        │        ├─ sage_quotas [758]
    │        │        │  ├─ /
    │        │        │  │  ├─ subscription_history [760]
    │        │        │  │  │  ╰─ .
    │        │        │  │  │     ╰─ {format:14} [760]
    │        │        │  │  ╰─ pending_members [759]
    │        │        │  │     ╰─ .
    │        │        │  │        ╰─ {format} [759]
    │        │        │  ╰─ .
    │        │        │     ╰─ {format} [758]
    │        │        ╰─ ploads [756]
    │        │           ├─ /authorize [755]
    │        │           │  ╰─ .
    │        │           │     ╰─ {format} [755]
    │        │           ╰─ .
    │        │              ╰─ {format} [756]
    │        ├─ {*id}
    │        │  ├─ /-/
    │        │  │  ├─ unfoldered_environment_names [420]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format:15} [420]
    │        │  │  ├─ merge_requests [410]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format:15} [410]
    │        │  │  ├─ a
    │        │  │  │  ├─ ctivity [400]
    │        │  │  │  │  ╰─ .
    │        │  │  │  │     ╰─ {format:15} [400]
    │        │  │  │  ╰─ rchived [1865]
    │        │  │  │     ╰─ .
    │        │  │  │        ╰─ {format:15} [1865]
    │        │  │  ├─ projects [413]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format:15} [413]
    │        │  │  ├─ transfer [419]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format:15} [419]
    │        │  │  ├─ shared [417]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format:15} [417]
    │        │  │  ├─ d
    │        │  │  │  ├─ ownload_export [404]
    │        │  │  │  │  ╰─ .
    │        │  │  │  │     ╰─ {format:15} [404]
    │        │  │  │  ╰─ etails [403]
    │        │  │  │     ╰─ .
    │        │  │  │        ╰─ {format:15} [403]
    │        │  │  ├─ e
    │        │  │  │  ├─ xport [406]
    │        │  │  │  │  ╰─ .
    │        │  │  │  │     ╰─ {format:15} [406]
    │        │  │  │  ╰─ dit [405]
    │        │  │  │     ╰─ .
    │        │  │  │        ╰─ {format:15} [405]
    │        │  │  ╰─ i
    │        │  │     ├─ nactive [416]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format:15} [416]
    │        │  │     ╰─ ssues [408]
    │        │  │        ╰─ .
    │        │  │           ├─ ics [409]
    │        │  │           ╰─ {format:15} [408]
    │        │  ╰─ .
    │        │     ╰─ {format:15} [415]
    │        ╰─ {*id} [415]
    ├─ l
    │  ├─ ookbook_engine [899]
    │  │  ╰─ /
    │  │     ├─ cable [1]
    │  │     ├─ embed [901]
    │  │     │  ├─ .
    │  │     │  │  ╰─ {format} [901]
    │  │     │  ╰─ /
    │  │     │     ├─ {*path}
    │  │     │     │  ╰─ .
    │  │     │     │     ╰─ {format} [902]
    │  │     │     ╰─ {*path} [902]
    │  │     ├─ p
    │  │     │  ├─ review
    │  │     │  │  ├─ s [906]
    │  │     │  │  │  ╰─ .
    │  │     │  │  │     ╰─ {format} [906]
    │  │     │  │  ╰─ /
    │  │     │  │     ├─ {*path}
    │  │     │  │     │  ╰─ .
    │  │     │  │     │     ╰─ {format} [907]
    │  │     │  │     ╰─ {*path} [907]
    │  │     │  ╰─ ages [904]
    │  │     │     ├─ .
    │  │     │     │  ╰─ {format} [904]
    │  │     │     ╰─ /
    │  │     │        ├─ {*path}
    │  │     │        │  ╰─ .
    │  │     │        │     ╰─ {format} [905]
    │  │     │        ╰─ {*path} [905]
    │  │     ├─ inspect/
    │  │     │  ├─ {*path}
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [903]
    │  │     │  ╰─ {*path} [903]
    │  │     ├─ {*path}
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [900]
    │  │     ╰─ {*path} [900]
    │  ╰─ etteropenerweb_engine [897]
    │     ╰─ /
    │        ├─ clear [895]
    │        │  ╰─ .
    │        │     ╰─ {format} [895]
    │        ╰─ {id} [898]
    │           ├─ .
    │           │  ╰─ {format} [898]
    │           ╰─ /
    │              ├─ delete [896]
    │              │  ╰─ .
    │              │     ╰─ {format} [896]
    │              ├─ attachments/
    │              │  ╰─ {file:0} [894]
    │              │     ╰─ .
    │              │        ╰─ {format} [894]
    │              ╰─ {style} [898]
    │                 ╰─ .
    │                    ╰─ {format} [898]
    ├─ p
    │  ├─ eek_railtie/results [967]
    │  │  ╰─ .
    │  │     ╰─ {format} [967]
    │  ├─ rojects [1009]
    │  │  ├─ /
    │  │  │  ├─ new [1017]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [1017]
    │  │  │  ╰─ {id} [1608]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [1608]
    │  │  ╰─ .
    │  │     ╰─ {format} [1009]
    │  ╰─ ublic [369]
    │     ├─ /projects [370]
    │     │  ╰─ .
    │     │     ╰─ {format} [370]
    │     ╰─ .
    │        ╰─ {format} [369]
    ├─ s
    │  ├─ nippets [1816]
    │  │  ├─ .
    │  │  │  ╰─ {format} [1816]
    │  │  ╰─ /
    │  │     ├─ {id:3}
    │  │     │  ╰─ /raw [1972]
    │  │     ├─ {*rest}
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [1816]
    │  │     ╰─ {*rest} [1816]
    │  ├─ itemap [1962]
    │  │  ╰─ .
    │  │     ╰─ {format} [1962]
    │  ╰─ earch [1945]
    │     ├─ .
    │     │  ╰─ {format} [1945]
    │     ╰─ /
    │        ├─ opensearch [1943]
    │        │  ╰─ .
    │        │     ╰─ {format} [1943]
    │        ├─ settings [1944]
    │        │  ╰─ .
    │        │     ╰─ {format} [1944]
    │        ├─ count [1942]
    │        │  ╰─ .
    │        │     ╰─ {format} [1942]
    │        ╰─ a
    │           ├─ ggregations [1940]
    │           │  ╰─ .
    │           │     ╰─ {format} [1940]
    │           ╰─ utocomplete [1941]
    │              ╰─ .
    │                 ╰─ {format} [1941]
    ├─ {username:35} [2043]
    │  ╰─ .
    │     ├─ keys [2045]
    │     │  ╰─ .
    │     │     ╰─ {format} [2045]
    │     ├─ gpg [2040]
    │     │  ╰─ .
    │     │     ╰─ {format} [2040]
    │     ╰─ {format} [2043]
    ├─ {*repository_path:5}
    │  ╰─ /
    │     ├─ info/
    │     │  ├─ lfs/
    │     │  │  ├─ objects [1909]
    │     │  │  │  ╰─ /
    │     │  │  │     ├─ batch [1905]
    │     │  │  │     ╰─ {*oid} [1907]
    │     │  │  ╰─ locks [1911]
    │     │  │     ╰─ /
    │     │  │        ├─ verify [1929]
    │     │  │        ├─ new [1919]
    │     │  │        ╰─ {id} [1913]
    │     │  │           ╰─ /
    │     │  │              ├─ unlock [1923]
    │     │  │              ╰─ edit [1915]
    │     │  ╰─ refs [1899]
    │     ├─ ssh-
    │     │  ├─ receive-pack [1901]
    │     │  ╰─ upload-pack [1903]
    │     ╰─ git
    │        ├─ lab-lfs/objects/
    │        │  ├─ {*oid:6}
    │        │  │  ╰─ /
    │        │  │     ├─ {*size:7}
    │        │  │     │  ╰─ /authorize [1933]
    │        │  │     ╰─ {*size:7} [1935]
    │        │  ╰─ {*oid:6} [1931]
    │        ╰─ -
    │           ├─ receive-pack [1895]
    │           ╰─ upload-pack [1897]
    ├─ {*repository_path:9}
    │  ╰─ /info/refs [1815]
    ├─ {*namespace_id:2}
    │  ╰─ /
    │     ├─ {project_id:4} [293]
    │     │  ├─ /
    │     │  │  ├─ uploads [1761]
    │     │  │  │  ├─ /
    │     │  │  │  │  ├─ authorize [1760]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1760]
    │     │  │  │  │  ╰─ {secret}
    │     │  │  │  │     ╰─ /
    │     │  │  │  │        ╰─ {filename:0} [1762]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [1761]
    │     │  │  ├─ hooks [1829]
    │     │  │  │  ├─ .
    │     │  │  │  │  ╰─ {format} [1829]
    │     │  │  │  ╰─ /
    │     │  │  │     ├─ {*rest}
    │     │  │  │     │  ╰─ .
    │     │  │  │     │     ╰─ {format} [1829]
    │     │  │  │     ╰─ {*rest} [1829]
    │     │  │  ├─ wikis [1845]
    │     │  │  │  ├─ .
    │     │  │  │  │  ╰─ {format} [1845]
    │     │  │  │  ╰─ /
    │     │  │  │     ├─ {*rest}
    │     │  │  │     │  ╰─ .
    │     │  │  │     │     ╰─ {format} [1845]
    │     │  │  │     ╰─ {*rest} [1845]
    │     │  │  ├─ n
    │     │  │  │  ├─ ew/
    │     │  │  │  │  ╰─ {*id:46} [1849]
    │     │  │  │  ╰─ ote
    │     │  │  │     ├─ s [1493]
    │     │  │  │     │  ├─ .
    │     │  │  │     │  │  ╰─ {format} [1493]
    │     │  │  │     │  ╰─ /
    │     │  │  │     │     ╰─ {id:3} [1495]
    │     │  │  │     │        ├─ /
    │     │  │  │     │        │  ├─ outdated_line_change [1497]
    │     │  │  │     │        │  │  ╰─ .
    │     │  │  │     │        │  │     ╰─ {format} [1497]
    │     │  │  │     │        │  ├─ toggle_award_emoji [1499]
    │     │  │  │     │        │  │  ╰─ .
    │     │  │  │     │        │  │     ╰─ {format} [1499]
    │     │  │  │     │        │  ├─ delete_attachment [1494]
    │     │  │  │     │        │  │  ╰─ .
    │     │  │  │     │        │  │     ╰─ {format} [1494]
    │     │  │  │     │        │  ╰─ resolve [1498]
    │     │  │  │     │        │     ╰─ .
    │     │  │  │     │        │        ╰─ {format} [1498]
    │     │  │  │     │        ╰─ .
    │     │  │  │     │           ╰─ {format} [1495]
    │     │  │  │     ╰─ able/
    │     │  │  │        ╰─ {target_type}
    │     │  │  │           ╰─ /
    │     │  │  │              ╰─ {target_id}
    │     │  │  │                 ╰─ /notes [1496]
    │     │  │  │                    ╰─ .
    │     │  │  │                       ╰─ {format} [1496]
    │     │  │  ├─ -/
    │     │  │  │  ├─ w
    │     │  │  │  │  ├─ ork_items/
    │     │  │  │  │  │  ├─ import_csv [1793]
    │     │  │  │  │  │  │  ├─ /authorize [1792]
    │     │  │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │  │     ╰─ {format} [1792]
    │     │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │     ╰─ {format} [1793]
    │     │  │  │  │  │  ╰─ {iid} [1794]
    │     │  │  │  │  │     ├─ /designs [1795]
    │     │  │  │  │  │     │  ╰─ /
    │     │  │  │  │  │     │     ╰─ {*vueroute} [1795]
    │     │  │  │  │  │     ╰─ .
    │     │  │  │  │  │        ╰─ {format} [1794]
    │     │  │  │  │  ╰─ ikis [1779]
    │     │  │  │  │     ├─ /
    │     │  │  │  │     │  ├─ -/confluence [1169]
    │     │  │  │  │     │  │  ╰─ .
    │     │  │  │  │     │  │     ╰─ {format} [1169]
    │     │  │  │  │     │  ├─ git_access [1783]
    │     │  │  │  │     │  │  ╰─ .
    │     │  │  │  │     │  │     ╰─ {format} [1783]
    │     │  │  │  │     │  ├─ templates [1790]
    │     │  │  │  │     │  │  ╰─ .
    │     │  │  │  │     │  │     ╰─ {format} [1790]
    │     │  │  │  │     │  ├─ pages [1786]
    │     │  │  │  │     │  │  ╰─ .
    │     │  │  │  │     │  │     ╰─ {format} [1786]
    │     │  │  │  │     │  ├─ new [1785]
    │     │  │  │  │     │  │  ╰─ .
    │     │  │  │  │     │  │     ╰─ {format} [1785]
    │     │  │  │  │     │  ├─ {*id}
    │     │  │  │  │     │  │  ╰─ /
    │     │  │  │  │     │  │     ├─ preview_markdown [1787]
    │     │  │  │  │     │  │     ├─ history [1784]
    │     │  │  │  │     │  │     ├─ diff [1781]
    │     │  │  │  │     │  │     ├─ edit [1782]
    │     │  │  │  │     │  │     ╰─ raw [1788]
    │     │  │  │  │     │  ╰─ {*id} [1780]
    │     │  │  │  │     ╰─ .
    │     │  │  │  │        ╰─ {format} [1779]
    │     │  │  │  ├─ quality/test_cases [1602]
    │     │  │  │  │  ├─ /
    │     │  │  │  │  │  ├─ new [1603]
    │     │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │     ╰─ {format} [1603]
    │     │  │  │  │  │  ╰─ {id} [1604]
    │     │  │  │  │  │     ╰─ .
    │     │  │  │  │  │        ╰─ {format} [1604]
    │     │  │  │  │  ╰─ .
    │     │  │  │  │     ╰─ {format} [1602]
    │     │  │  │  ├─ t
    │     │  │  │  │  ├─ erraform [1748]
    │     │  │  │  │  │  ├─ _module_registry [1506]
    │     │  │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  │  ╰─ {format} [1506]
    │     │  │  │  │  │  │  ╰─ /
    │     │  │  │  │  │  │     ╰─ {id} [1507]
    │     │  │  │  │  │  │        ╰─ .
    │     │  │  │  │  │  │           ╰─ {format} [1507]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1748]
    │     │  │  │  │  ├─ r
    │     │  │  │  │  │  ├─ iggers [1755]
    │     │  │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  │  ╰─ {format} [1755]
    │     │  │  │  │  │  │  ╰─ /
    │     │  │  │  │  │  │     ╰─ {id} [1756]
    │     │  │  │  │  │  │        ╰─ .
    │     │  │  │  │  │  │           ╰─ {format} [1756]
    │     │  │  │  │  │  ├─ acing [1750]
    │     │  │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  │  ╰─ {format} [1750]
    │     │  │  │  │  │  │  ╰─ /
    │     │  │  │  │  │  │     ╰─ {id} [1751]
    │     │  │  │  │  │  │        ╰─ .
    │     │  │  │  │  │  │           ╰─ {format} [1751]
    │     │  │  │  │  │  ╰─ ee/
    │     │  │  │  │  │     ╰─ {*id:46} [1753]
    │     │  │  │  │  ╰─ a
    │     │  │  │  │     ├─ rget_branch_rules [1742]
    │     │  │  │  │     │  ├─ .
    │     │  │  │  │     │  │  ╰─ {format} [1742]
    │     │  │  │  │     │  ╰─ /
    │     │  │  │  │     │     ╰─ {id} [1743]
    │     │  │  │  │     │        ╰─ .
    │     │  │  │  │     │           ╰─ {format} [1743]
    │     │  │  │  │     ╰─ gs [1737]
    │     │  │  │  │        ╰─ /
    │     │  │  │  │           ├─ new [1740]
    │     │  │  │  │           ╰─ {id:42} [1738]
    │     │  │  │  ├─ v
    │     │  │  │  │  ├─ ulnerability_feedback [1768]
    │     │  │  │  │  │  ├─ /
    │     │  │  │  │  │  │  ├─ count [1767]
    │     │  │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │  │     ╰─ {format} [1767]
    │     │  │  │  │  │  │  ╰─ {id:3} [1769]
    │     │  │  │  │  │  │     ╰─ .
    │     │  │  │  │  │  │        ╰─ {format} [1769]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1768]
    │     │  │  │  │  ╰─ a
    │     │  │  │  │     ├─ lue_stream_analytics [1170]
    │     │  │  │  │     │  ├─ /events/
    │     │  │  │  │     │  │  ├─ staging [1176]
    │     │  │  │  │     │  │  │  ╰─ .
    │     │  │  │  │     │  │  │     ╰─ {format} [1176]
    │     │  │  │  │     │  │  ├─ review [1175]
    │     │  │  │  │     │  │  │  ╰─ .
    │     │  │  │  │     │  │  │     ╰─ {format} [1175]
    │     │  │  │  │     │  │  ├─ issue [1172]
    │     │  │  │  │     │  │  │  ╰─ .
    │     │  │  │  │     │  │  │     ╰─ {format} [1172]
    │     │  │  │  │     │  │  ├─ code [1171]
    │     │  │  │  │     │  │  │  ╰─ .
    │     │  │  │  │     │  │  │     ╰─ {format} [1171]
    │     │  │  │  │     │  │  ├─ test [1177]
    │     │  │  │  │     │  │  │  ╰─ .
    │     │  │  │  │     │  │  │     ╰─ {format} [1177]
    │     │  │  │  │     │  │  ╰─ p
    │     │  │  │  │     │  │     ├─ roduction [1174]
    │     │  │  │  │     │  │     │  ╰─ .
    │     │  │  │  │     │  │     │     ╰─ {format} [1174]
    │     │  │  │  │     │  │     ╰─ lan [1173]
    │     │  │  │  │     │  │        ╰─ .
    │     │  │  │  │     │  │           ╰─ {format} [1173]
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1170]
    │     │  │  │  │     ╰─ riables [1764]
    │     │  │  │  │        ╰─ .
    │     │  │  │  │           ╰─ {format} [1764]
    │     │  │  │  ├─ s
    │     │  │  │  │  ├─ ubscriptions [1735]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1735]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ╰─ {id} [1736]
    │     │  │  │  │  │        ╰─ .
    │     │  │  │  │  │           ╰─ {format} [1736]
    │     │  │  │  │  ├─ nippets [1726]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1726]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ├─ new [1728]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1728]
    │     │  │  │  │  │     ├─ {id:3} [1731]
    │     │  │  │  │  │     │  ├─ .
    │     │  │  │  │  │     │  │  ╰─ {format} [1731]
    │     │  │  │  │  │     │  ╰─ /
    │     │  │  │  │  │     │     ├─ toggle_award_emoji [1732]
    │     │  │  │  │  │     │     │  ╰─ .
    │     │  │  │  │  │     │     │     ╰─ {format} [1732]
    │     │  │  │  │  │     │     ├─ mark_as_spam [1727]
    │     │  │  │  │  │     │     │  ╰─ .
    │     │  │  │  │  │     │     │     ╰─ {format} [1727]
    │     │  │  │  │  │     │     ├─ edit [1725]
    │     │  │  │  │  │     │     │  ╰─ .
    │     │  │  │  │  │     │     │     ╰─ {format} [1725]
    │     │  │  │  │  │     │     ╰─ raw [1729]
    │     │  │  │  │  │     │        ╰─ .
    │     │  │  │  │  │     │           ╰─ {format} [1729]
    │     │  │  │  │  │     ╰─ {snippet_id:3}
    │     │  │  │  │  │        ╰─ /raw/
    │     │  │  │  │  │           ╰─ {ref}
    │     │  │  │  │  │              ╰─ /
    │     │  │  │  │  │                 ╰─ {*path} [1733]
    │     │  │  │  │  ├─ tarrers [1734]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1734]
    │     │  │  │  │  ├─ chema/
    │     │  │  │  │  │  ╰─ {branch}
    │     │  │  │  │  │     ╰─ /
    │     │  │  │  │  │        ╰─ {*filename} [1773]
    │     │  │  │  │  ╰─ e
    │     │  │  │  │     ├─ rvice_desk/custom_email [1677]
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1677]
    │     │  │  │  │     ├─ ttings/
    │     │  │  │  │     │  ├─ packages_and_registries [1713]
    │     │  │  │  │     │  │  ├─ /cleanup_image_tags [1712]
    │     │  │  │  │     │  │  │  ╰─ .
    │     │  │  │  │     │  │  │     ╰─ {format} [1712]
    │     │  │  │  │     │  │  ╰─ .
    │     │  │  │  │     │  │     ╰─ {format} [1713]
    │     │  │  │  │     │  ├─ merge_requests [1704]
    │     │  │  │  │     │  │  ╰─ .
    │     │  │  │  │     │  │     ╰─ {format} [1704]
    │     │  │  │  │     │  ├─ integrations [1700]
    │     │  │  │  │     │  │  ├─ .
    │     │  │  │  │     │  │  │  ╰─ {format} [1700]
    │     │  │  │  │     │  │  ╰─ /
    │     │  │  │  │     │  │     ├─ {integration_id:0}
    │     │  │  │  │     │  │     │  ╰─ /hook_logs/
    │     │  │  │  │     │  │     │     ╰─ {id:0} [1698]
    │     │  │  │  │     │  │     │        ├─ /retry [1697]
    │     │  │  │  │     │  │     │        │  ╰─ .
    │     │  │  │  │     │  │     │        │     ╰─ {format} [1697]
    │     │  │  │  │     │  │     │        ╰─ .
    │     │  │  │  │     │  │     │           ╰─ {format} [1698]
    │     │  │  │  │     │  │     ╰─ {id:0} [1702]
    │     │  │  │  │     │  │        ├─ .
    │     │  │  │  │     │  │        │  ╰─ {format} [1702]
    │     │  │  │  │     │  │        ╰─ /
    │     │  │  │  │     │  │           ├─ edit [1699]
    │     │  │  │  │     │  │           │  ╰─ .
    │     │  │  │  │     │  │           │     ╰─ {format} [1699]
    │     │  │  │  │     │  │           ╰─ test [1701]
    │     │  │  │  │     │  │              ╰─ .
    │     │  │  │  │     │  │                 ╰─ {format} [1701]
    │     │  │  │  │     │  ├─ operations [1709]
    │     │  │  │  │     │  │  ├─ /reset_
    │     │  │  │  │     │  │  │  ├─ pagerduty_token [1708]
    │     │  │  │  │     │  │  │  │  ╰─ .
    │     │  │  │  │     │  │  │  │     ╰─ {format} [1708]
    │     │  │  │  │     │  │  │  ╰─ alerting_token [1707]
    │     │  │  │  │     │  │  │     ╰─ .
    │     │  │  │  │     │  │  │        ╰─ {format} [1707]
    │     │  │  │  │     │  │  ╰─ .
    │     │  │  │  │     │  │     ╰─ {format} [1709]
    │     │  │  │  │     │  ├─ repository [1717]
    │     │  │  │  │     │  │  ├─ .
    │     │  │  │  │     │  │  │  ╰─ {format} [1717]
    │     │  │  │  │     │  │  ╰─ /
    │     │  │  │  │     │  │     ├─ deploy_token/create [1716]
    │     │  │  │  │     │  │     │  ╰─ .
    │     │  │  │  │     │  │     │     ╰─ {format} [1716]
    │     │  │  │  │     │  │     ├─ branch_rules [1689]
    │     │  │  │  │     │  │     │  ╰─ .
    │     │  │  │  │     │  │     │     ╰─ {format} [1689]
    │     │  │  │  │     │  │     ╰─ cleanup [1714]
    │     │  │  │  │     │  │        ╰─ .
    │     │  │  │  │     │  │           ╰─ {format} [1714]
    │     │  │  │  │     │  ├─ ci_cd [1694]
    │     │  │  │  │     │  │  ├─ .
    │     │  │  │  │     │  │  │  ╰─ {format} [1694]
    │     │  │  │  │     │  │  ╰─ /
    │     │  │  │  │     │  │     ├─ deploy_token/create [1715]
    │     │  │  │  │     │  │     │  ╰─ .
    │     │  │  │  │     │  │     │     ╰─ {format} [1715]
    │     │  │  │  │     │  │     ├─ export_job_token_authorizations [1690]
    │     │  │  │  │     │  │     │  ╰─ .
    │     │  │  │  │     │  │     │     ╰─ {format} [1690]
    │     │  │  │  │     │  │     ╰─ r
    │     │  │  │  │     │  │        ├─ unner_setup_scripts [1693]
    │     │  │  │  │     │  │        │  ╰─ .
    │     │  │  │  │     │  │        │     ╰─ {format} [1693]
    │     │  │  │  │     │  │        ╰─ eset_
    │     │  │  │  │     │  │           ├─ registration_token [1692]
    │     │  │  │  │     │  │           │  ╰─ .
    │     │  │  │  │     │  │           │     ╰─ {format} [1692]
    │     │  │  │  │     │  │           ╰─ cache [1691]
    │     │  │  │  │     │  │              ╰─ .
    │     │  │  │  │     │  │                 ╰─ {format} [1691]
    │     │  │  │  │     │  ├─ slack [1720]
    │     │  │  │  │     │  │  ├─ /
    │     │  │  │  │     │  │  │  ├─ slack_auth [1722]
    │     │  │  │  │     │  │  │  │  ╰─ .
    │     │  │  │  │     │  │  │  │     ╰─ {format} [1722]
    │     │  │  │  │     │  │  │  ╰─ edit [1721]
    │     │  │  │  │     │  │  │     ╰─ .
    │     │  │  │  │     │  │  │        ╰─ {format} [1721]
    │     │  │  │  │     │  │  ╰─ .
    │     │  │  │  │     │  │     ╰─ {format} [1720]
    │     │  │  │  │     │  ╰─ a
    │     │  │  │  │     │     ├─ ccess_tokens [1683]
    │     │  │  │  │     │     │  ├─ .
    │     │  │  │  │     │     │  │  ╰─ {format} [1683]
    │     │  │  │  │     │     │  ╰─ /
    │     │  │  │  │     │     │     ╰─ {id}
    │     │  │  │  │     │     │        ╰─ /revoke [1685]
    │     │  │  │  │     │     │           ╰─ .
    │     │  │  │  │     │     │              ╰─ {format} [1685]
    │     │  │  │  │     │     ╰─ nalytics [1686]
    │     │  │  │  │     │        ╰─ .
    │     │  │  │  │     │           ╰─ {format} [1686]
    │     │  │  │  │     ╰─ c
    │     │  │  │  │        ├─ urity/
    │     │  │  │  │        │  ├─ scanned_resources [1663]
    │     │  │  │  │        │  │  ╰─ .
    │     │  │  │  │        │  │     ╰─ {format} [1663]
    │     │  │  │  │        │  ├─ policies [1659]
    │     │  │  │  │        │  │  ├─ .
    │     │  │  │  │        │  │  │  ╰─ {format} [1659]
    │     │  │  │  │        │  │  ╰─ /
    │     │  │  │  │        │  │     ├─ schema [1661]
    │     │  │  │  │        │  │     │  ╰─ .
    │     │  │  │  │        │  │     │     ╰─ {format} [1661]
    │     │  │  │  │        │  │     ├─ new [1660]
    │     │  │  │  │        │  │     │  ╰─ .
    │     │  │  │  │        │  │     │     ╰─ {format} [1660]
    │     │  │  │  │        │  │     ╰─ {id:0}
    │     │  │  │  │        │  │        ╰─ /edit [1658]
    │     │  │  │  │        │  │           ╰─ .
    │     │  │  │  │        │  │              ╰─ {format} [1658]
    │     │  │  │  │        │  ├─ vulnerabilit
    │     │  │  │  │        │  │  ├─ y_report [1674]
    │     │  │  │  │        │  │  │  ╰─ .
    │     │  │  │  │        │  │  │     ╰─ {format} [1674]
    │     │  │  │  │        │  │  ╰─ ies/
    │     │  │  │  │        │  │     ├─ new [1666]
    │     │  │  │  │        │  │     │  ╰─ .
    │     │  │  │  │        │  │     │     ╰─ {format} [1666]
    │     │  │  │  │        │  │     ├─ {id} [1667]
    │     │  │  │  │        │  │     │  ├─ /discussions [1665]
    │     │  │  │  │        │  │     │  │  ╰─ .
    │     │  │  │  │        │  │     │  │     ╰─ {format} [1665]
    │     │  │  │  │        │  │     │  ╰─ .
    │     │  │  │  │        │  │     │     ╰─ {format} [1667]
    │     │  │  │  │        │  │     ╰─ {vulnerability_id}
    │     │  │  │  │        │  │        ╰─ /notes [1668]
    │     │  │  │  │        │  │           ├─ .
    │     │  │  │  │        │  │           │  ╰─ {format} [1668]
    │     │  │  │  │        │  │           ╰─ /
    │     │  │  │  │        │  │              ╰─ {id:3} [1669]
    │     │  │  │  │        │  │                 ├─ /toggle_award_emoji [1671]
    │     │  │  │  │        │  │                 │  ╰─ .
    │     │  │  │  │        │  │                 │     ╰─ {format} [1671]
    │     │  │  │  │        │  │                 ╰─ .
    │     │  │  │  │        │  │                    ╰─ {format} [1669]
    │     │  │  │  │        │  ├─ co
    │     │  │  │  │        │  │  ├─ nfiguration [1648]
    │     │  │  │  │        │  │  │  ├─ /
    │     │  │  │  │        │  │  │  │  ├─ corpus_management [1649]
    │     │  │  │  │        │  │  │  │  │  ╰─ .
    │     │  │  │  │        │  │  │  │  │     ╰─ {format} [1649]
    │     │  │  │  │        │  │  │  │  ├─ profile_library [1652]
    │     │  │  │  │        │  │  │  │  │  ├─ /dast_s
    │     │  │  │  │        │  │  │  │  │  │  ├─ canner_profiles/
    │     │  │  │  │        │  │  │  │  │  │  │  ├─ new [1654]
    │     │  │  │  │        │  │  │  │  │  │  │  │  ╰─ .
    │     │  │  │  │        │  │  │  │  │  │  │  │     ╰─ {format} [1654]
    │     │  │  │  │        │  │  │  │  │  │  │  ╰─ {id}
    │     │  │  │  │        │  │  │  │  │  │  │     ╰─ /edit [1653]
    │     │  │  │  │        │  │  │  │  │  │  │        ╰─ .
    │     │  │  │  │        │  │  │  │  │  │  │           ╰─ {format} [1653]
    │     │  │  │  │        │  │  │  │  │  │  ╰─ ite_profiles/
    │     │  │  │  │        │  │  │  │  │  │     ├─ new [1656]
    │     │  │  │  │        │  │  │  │  │  │     │  ╰─ .
    │     │  │  │  │        │  │  │  │  │  │     │     ╰─ {format} [1656]
    │     │  │  │  │        │  │  │  │  │  │     ╰─ {id}
    │     │  │  │  │        │  │  │  │  │  │        ╰─ /edit [1655]
    │     │  │  │  │        │  │  │  │  │  │           ╰─ .
    │     │  │  │  │        │  │  │  │  │  │              ╰─ {format} [1655]
    │     │  │  │  │        │  │  │  │  │  ╰─ .
    │     │  │  │  │        │  │  │  │  │     ╰─ {format} [1652]
    │     │  │  │  │        │  │  │  │  ├─ api_fuzzing [1646]
    │     │  │  │  │        │  │  │  │  │  ╰─ .
    │     │  │  │  │        │  │  │  │  │     ╰─ {format} [1646]
    │     │  │  │  │        │  │  │  │  ├─ dast [1651]
    │     │  │  │  │        │  │  │  │  │  ╰─ .
    │     │  │  │  │        │  │  │  │  │     ╰─ {format} [1651]
    │     │  │  │  │        │  │  │  │  ╰─ s
    │     │  │  │  │        │  │  │  │     ├─ ecret_detection [1664]
    │     │  │  │  │        │  │  │  │     │  ╰─ .
    │     │  │  │  │        │  │  │  │     │     ╰─ {format} [1664]
    │     │  │  │  │        │  │  │  │     ╰─ ast [1662]
    │     │  │  │  │        │  │  │  │        ╰─ .
    │     │  │  │  │        │  │  │  │           ╰─ {format} [1662]
    │     │  │  │  │        │  │  │  ╰─ .
    │     │  │  │  │        │  │  │     ╰─ {format} [1648]
    │     │  │  │  │        │  │  ╰─ mpliance_dashboard [1647]
    │     │  │  │  │        │  │     ├─ .
    │     │  │  │  │        │  │     │  ╰─ {format} [1647]
    │     │  │  │  │        │  │     ╰─ /
    │     │  │  │  │        │  │        ├─ {*vueroute}
    │     │  │  │  │        │  │        │  ╰─ .
    │     │  │  │  │        │  │        │     ╰─ {format} [1647]
    │     │  │  │  │        │  │        ╰─ {*vueroute} [1647]
    │     │  │  │  │        │  ╰─ d
    │     │  │  │  │        │     ├─ ashboard [1650]
    │     │  │  │  │        │     │  ╰─ .
    │     │  │  │  │        │     │     ╰─ {format} [1650]
    │     │  │  │  │        │     ╰─ iscover [1657]
    │     │  │  │  │        │        ╰─ .
    │     │  │  │  │        │           ╰─ {format} [1657]
    │     │  │  │  │        ╰─ rets [1645]
    │     │  │  │  │           ├─ .
    │     │  │  │  │           │  ╰─ {format} [1645]
    │     │  │  │  │           ╰─ /
    │     │  │  │  │              ├─ {*vueroute}
    │     │  │  │  │              │  ╰─ .
    │     │  │  │  │              │     ╰─ {format} [1645]
    │     │  │  │  │              ╰─ {*vueroute} [1645]
    │     │  │  │  ├─ jobs [1341]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1341]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ artifacts/
    │     │  │  │  │     │  ╰─ {*ref_name_and_path} [1071]
    │     │  │  │  │     ├─ {job_id:3}
    │     │  │  │  │     │  ╰─ /artifacts/
    │     │  │  │  │     │     ├─ download [1066]
    │     │  │  │  │     │     │  ╰─ .
    │     │  │  │  │     │     │     ╰─ {format} [1066]
    │     │  │  │  │     │     ├─ browse [1064]
    │     │  │  │  │     │     │  ╰─ /
    │     │  │  │  │     │     │     ╰─ {*path} [1064]
    │     │  │  │  │     │     ├─ keep [1070]
    │     │  │  │  │     │     │  ╰─ .
    │     │  │  │  │     │     │     ╰─ {format} [1070]
    │     │  │  │  │     │     ├─ external_file/
    │     │  │  │  │     │     │  ╰─ {*path} [1067]
    │     │  │  │  │     │     ├─ file/
    │     │  │  │  │     │     │  ╰─ {*path} [1068]
    │     │  │  │  │     │     ╰─ raw/
    │     │  │  │  │     │        ╰─ {*path} [1072]
    │     │  │  │  │     ╰─ {id:3} [1347]
    │     │  │  │  │        ├─ .
    │     │  │  │  │        │  ╰─ {format} [1347]
    │     │  │  │  │        ╰─ /
    │     │  │  │  │           ├─ unschedule [1353]
    │     │  │  │  │           │  ╰─ .
    │     │  │  │  │           │     ╰─ {format} [1353]
    │     │  │  │  │           ├─ cancel [1339]
    │     │  │  │  │           │  ╰─ .
    │     │  │  │  │           │     ╰─ {format} [1339]
    │     │  │  │  │           ├─ status [1348]
    │     │  │  │  │           │  ╰─ .
    │     │  │  │  │           │     ╰─ {format} [1348]
    │     │  │  │  │           ├─ viewer [1354]
    │     │  │  │  │           │  ╰─ .
    │     │  │  │  │           │     ╰─ {format} [1354]
    │     │  │  │  │           ├─ erase [1340]
    │     │  │  │  │           │  ╰─ .
    │     │  │  │  │           │     ╰─ {format} [1340]
    │     │  │  │  │           ├─ p
    │     │  │  │  │           │  ├─ roxy [1343]
    │     │  │  │  │           │  │  ╰─ .
    │     │  │  │  │           │  │     ├─ ws/authorize [1344]
    │     │  │  │  │           │  │     ╰─ {format} [1343]
    │     │  │  │  │           │  ╰─ lay [1342]
    │     │  │  │  │           │     ╰─ .
    │     │  │  │  │           │        ╰─ {format} [1342]
    │     │  │  │  │           ├─ r
    │     │  │  │  │           │  ├─ etry [1346]
    │     │  │  │  │           │  │  ╰─ .
    │     │  │  │  │           │  │     ╰─ {format} [1346]
    │     │  │  │  │           │  ╰─ aw [1345]
    │     │  │  │  │           │     ╰─ .
    │     │  │  │  │           │        ╰─ {format} [1345]
    │     │  │  │  │           ╰─ t
    │     │  │  │  │              ├─ race [1352]
    │     │  │  │  │              │  ╰─ .
    │     │  │  │  │              │     ╰─ {format:37} [1352]
    │     │  │  │  │              ╰─ e
    │     │  │  │  │                 ├─ st_report_summary [1351]
    │     │  │  │  │                 │  ╰─ .
    │     │  │  │  │                 │     ╰─ {format} [1351]
    │     │  │  │  │                 ╰─ rminal [1349]
    │     │  │  │  │                    ╰─ .
    │     │  │  │  │                       ├─ ws/authorize [1350]
    │     │  │  │  │                       ╰─ {format} [1349]
    │     │  │  │  ├─ u
    │     │  │  │  │  ├─ sage_quotas [1763]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1763]
    │     │  │  │  │  ╰─ pdate/
    │     │  │  │  │     ╰─ {*id:46} [1108]
    │     │  │  │  ├─ de
    │     │  │  │  │  ├─ sign_management/designs/
    │     │  │  │  │  │  ╰─ {design_id}
    │     │  │  │  │  │     ╰─ /
    │     │  │  │  │  │        ├─ r
    │     │  │  │  │  │        │  ├─ aw_image [1196]
    │     │  │  │  │  │        │  │  ╰─ .
    │     │  │  │  │  │        │  │     ╰─ {format} [1196]
    │     │  │  │  │  │        │  ╰─ esized_image/
    │     │  │  │  │  │        │     ╰─ {id} [1197]
    │     │  │  │  │  │        │        ╰─ .
    │     │  │  │  │  │        │           ╰─ {format} [1197]
    │     │  │  │  │  │        ╰─ {sha}
    │     │  │  │  │  │           ╰─ /r
    │     │  │  │  │  │              ├─ aw_image [1196]
    │     │  │  │  │  │              │  ╰─ .
    │     │  │  │  │  │              │     ╰─ {format} [1196]
    │     │  │  │  │  │              ╰─ esized_image/
    │     │  │  │  │  │                 ╰─ {id} [1197]
    │     │  │  │  │  │                    ╰─ .
    │     │  │  │  │  │                       ╰─ {format} [1197]
    │     │  │  │  │  ╰─ p
    │     │  │  │  │     ├─ loy_
    │     │  │  │  │     │  ├─ keys [1182]
    │     │  │  │  │     │  │  ├─ /
    │     │  │  │  │     │  │  │  ├─ enabled_keys [1186]
    │     │  │  │  │     │  │  │  │  ╰─ .
    │     │  │  │  │     │  │  │  │     ╰─ {format} [1186]
    │     │  │  │  │     │  │  │  ├─ new [1188]
    │     │  │  │  │     │  │  │  │  ╰─ .
    │     │  │  │  │     │  │  │  │     ╰─ {format} [1188]
    │     │  │  │  │     │  │  │  ├─ available_p
    │     │  │  │  │     │  │  │  │  ├─ roject_keys [1180]
    │     │  │  │  │     │  │  │  │  │  ╰─ .
    │     │  │  │  │     │  │  │  │  │     ╰─ {format} [1180]
    │     │  │  │  │     │  │  │  │  ╰─ ublic_keys [1181]
    │     │  │  │  │     │  │  │  │     ╰─ .
    │     │  │  │  │     │  │  │  │        ╰─ {format} [1181]
    │     │  │  │  │     │  │  │  ╰─ {id:3} [1189]
    │     │  │  │  │     │  │  │     ├─ .
    │     │  │  │  │     │  │  │     │  ╰─ {format} [1189]
    │     │  │  │  │     │  │  │     ╰─ /
    │     │  │  │  │     │  │  │        ├─ disable [1183]
    │     │  │  │  │     │  │  │        │  ╰─ .
    │     │  │  │  │     │  │  │        │     ╰─ {format} [1183]
    │     │  │  │  │     │  │  │        ╰─ e
    │     │  │  │  │     │  │  │           ├─ nable [1185]
    │     │  │  │  │     │  │  │           │  ╰─ .
    │     │  │  │  │     │  │  │           │     ╰─ {format} [1185]
    │     │  │  │  │     │  │  │           ╰─ dit [1184]
    │     │  │  │  │     │  │  │              ╰─ .
    │     │  │  │  │     │  │  │                 ╰─ {format} [1184]
    │     │  │  │  │     │  │  ╰─ .
    │     │  │  │  │     │  │     ╰─ {format} [1182]
    │     │  │  │  │     │  ╰─ tokens/
    │     │  │  │  │     │     ╰─ {id:3}
    │     │  │  │  │     │        ╰─ /revoke [1191]
    │     │  │  │  │     │           ╰─ .
    │     │  │  │  │     │              ╰─ {format} [1191]
    │     │  │  │  │     ╰─ endencies [1178]
    │     │  │  │  │        ├─ /licenses [1179]
    │     │  │  │  │        │  ╰─ .
    │     │  │  │  │        │     ╰─ {format} [1179]
    │     │  │  │  │        ╰─ .
    │     │  │  │  │           ╰─ {format} [1178]
    │     │  │  │  ├─ ne
    │     │  │  │  │  ├─ twork/
    │     │  │  │  │  │  ╰─ {id:42} [1492]
    │     │  │  │  │  ╰─ w/
    │     │  │  │  │     ╰─ {*id:46} [1103]
    │     │  │  │  ├─ on
    │     │  │  │  │  ├─ call_schedules [1282]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1282]
    │     │  │  │  │  ╰─ _demand_scans [1504]
    │     │  │  │  │     ├─ .
    │     │  │  │  │     │  ╰─ {format} [1504]
    │     │  │  │  │     ╰─ /
    │     │  │  │  │        ├─ new [1505]
    │     │  │  │  │        │  ╰─ .
    │     │  │  │  │        │     ╰─ {format} [1505]
    │     │  │  │  │        ╰─ {id}
    │     │  │  │  │           ╰─ /edit [1503]
    │     │  │  │  │              ╰─ .
    │     │  │  │  │                 ╰─ {format} [1503]
    │     │  │  │  ├─ a
    │     │  │  │  │  ├─ ws [1846]
    │     │  │  │  │  │  ├─ /configuration [1089]
    │     │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │     ╰─ {format} [1089]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1846]
    │     │  │  │  │  ├─ lert_management [1033]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1033]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ╰─ {id} [1031]
    │     │  │  │  │  │        ├─ /details [1032]
    │     │  │  │  │  │        │  ├─ .
    │     │  │  │  │  │        │  │  ╰─ {format} [1032]
    │     │  │  │  │  │        │  ╰─ /
    │     │  │  │  │  │        │     ├─ {*page}
    │     │  │  │  │  │        │     │  ╰─ .
    │     │  │  │  │  │        │     │     ╰─ {format} [1032]
    │     │  │  │  │  │        │     ╰─ {*page} [1032]
    │     │  │  │  │  │        ╰─ .
    │     │  │  │  │  │           ╰─ {format} [1031]
    │     │  │  │  │  ├─ r
    │     │  │  │  │  │  ├─ tifacts [1069]
    │     │  │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  │  ╰─ {format} [1069]
    │     │  │  │  │  │  │  ╰─ /
    │     │  │  │  │  │  │     ╰─ {id} [1065]
    │     │  │  │  │  │  │        ╰─ .
    │     │  │  │  │  │  │           ╰─ {format} [1065]
    │     │  │  │  │  │  ╰─ chive/
    │     │  │  │  │  │     ╰─ {*id:33}
    │     │  │  │  │  │        ╰─ .
    │     │  │  │  │  │           ╰─ {format:36} [1625]
    │     │  │  │  │  ├─ vatar [1087]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1087]
    │     │  │  │  │  ├─ nalytics/
    │     │  │  │  │  │  ├─ merge_request_analytics [1058]
    │     │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │     ╰─ {format} [1058]
    │     │  │  │  │  │  ├─ value_stream_analytics [1039]
    │     │  │  │  │  │  │  ├─ /
    │     │  │  │  │  │  │  │  ├─ time_summary [1047]
    │     │  │  │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │  │  │     ╰─ {format} [1047]
    │     │  │  │  │  │  │  │  ├─ summary [1046]
    │     │  │  │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │  │  │     ╰─ {format} [1046]
    │     │  │  │  │  │  │  │  ╰─ value_streams [1048]
    │     │  │  │  │  │  │  │     ├─ .
    │     │  │  │  │  │  │  │     │  ╰─ {format} [1048]
    │     │  │  │  │  │  │  │     ╰─ /
    │     │  │  │  │  │  │  │        ├─ new [1052]
    │     │  │  │  │  │  │  │        │  ╰─ .
    │     │  │  │  │  │  │  │        │     ╰─ {format} [1052]
    │     │  │  │  │  │  │  │        ├─ {id} [1049]
    │     │  │  │  │  │  │  │        │  ├─ /edit [1050]
    │     │  │  │  │  │  │  │        │  │  ╰─ .
    │     │  │  │  │  │  │  │        │  │     ╰─ {format} [1050]
    │     │  │  │  │  │  │  │        │  ╰─ .
    │     │  │  │  │  │  │  │        │     ╰─ {format} [1049]
    │     │  │  │  │  │  │  │        ╰─ {value_stream_id}
    │     │  │  │  │  │  │  │           ╰─ /stages [1043]
    │     │  │  │  │  │  │  │              ├─ .
    │     │  │  │  │  │  │  │              │  ╰─ {format} [1043]
    │     │  │  │  │  │  │  │              ╰─ /
    │     │  │  │  │  │  │  │                 ╰─ {id}
    │     │  │  │  │  │  │  │                    ╰─ /
    │     │  │  │  │  │  │  │                       ├─ average [1040]
    │     │  │  │  │  │  │  │                       │  ├─ _duration_chart [1041]
    │     │  │  │  │  │  │  │                       │  │  ╰─ .
    │     │  │  │  │  │  │  │                       │  │     ╰─ {format} [1041]
    │     │  │  │  │  │  │  │                       │  ╰─ .
    │     │  │  │  │  │  │  │                       │     ╰─ {format} [1040]
    │     │  │  │  │  │  │  │                       ├─ records [1045]
    │     │  │  │  │  │  │  │                       │  ╰─ .
    │     │  │  │  │  │  │  │                       │     ╰─ {format} [1045]
    │     │  │  │  │  │  │  │                       ├─ median [1044]
    │     │  │  │  │  │  │  │                       │  ╰─ .
    │     │  │  │  │  │  │  │                       │     ╰─ {format} [1044]
    │     │  │  │  │  │  │  │                       ╰─ count [1042]
    │     │  │  │  │  │  │  │                          ╰─ .
    │     │  │  │  │  │  │  │                             ╰─ {format} [1042]
    │     │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │     ╰─ {format} [1039]
    │     │  │  │  │  │  ├─ issues_analytics [1057]
    │     │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │     ╰─ {format} [1057]
    │     │  │  │  │  │  ├─ code_reviews [1038]
    │     │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │     ╰─ {format} [1038]
    │     │  │  │  │  │  ╰─ dashboards [1056]
    │     │  │  │  │  │     ╰─ /
    │     │  │  │  │  │        ╰─ {*vueroute} [1056]
    │     │  │  │  │  ├─ pprover
    │     │  │  │  │  │  ├─ _groups/
    │     │  │  │  │  │  │  ╰─ {id} [1059]
    │     │  │  │  │  │  │     ╰─ .
    │     │  │  │  │  │  │        ╰─ {format} [1059]
    │     │  │  │  │  │  ╰─ s/
    │     │  │  │  │  │     ╰─ {id} [1061]
    │     │  │  │  │  │        ╰─ .
    │     │  │  │  │  │           ╰─ {format} [1061]
    │     │  │  │  │  ╰─ u
    │     │  │  │  │     ├─ to
    │     │  │  │  │     │  ├─ mations [1086]
    │     │  │  │  │     │  │  ╰─ .
    │     │  │  │  │     │  │     ╰─ {format} [1086]
    │     │  │  │  │     │  ╰─ complete_sources/
    │     │  │  │  │     │     ├─ vulnerabilities [1084]
    │     │  │  │  │     │     │  ╰─ .
    │     │  │  │  │     │     │     ╰─ {format} [1084]
    │     │  │  │  │     │     ├─ snippets [1083]
    │     │  │  │  │     │     │  ╰─ .
    │     │  │  │  │     │     │     ╰─ {format} [1083]
    │     │  │  │  │     │     ├─ labels [1079]
    │     │  │  │  │     │     │  ╰─ .
    │     │  │  │  │     │     │     ╰─ {format} [1079]
    │     │  │  │  │     │     ├─ epics [1076]
    │     │  │  │  │     │     │  ╰─ .
    │     │  │  │  │     │     │     ╰─ {format} [1076]
    │     │  │  │  │     │     ├─ wikis [1085]
    │     │  │  │  │     │     │  ╰─ .
    │     │  │  │  │     │     │     ╰─ {format} [1085]
    │     │  │  │  │     │     ├─ co
    │     │  │  │  │     │     │  ├─ mmands [1074]
    │     │  │  │  │     │     │  │  ╰─ .
    │     │  │  │  │     │     │  │     ╰─ {format} [1074]
    │     │  │  │  │     │     │  ╰─ ntacts [1075]
    │     │  │  │  │     │     │     ╰─ .
    │     │  │  │  │     │     │        ╰─ {format} [1075]
    │     │  │  │  │     │     ├─ i
    │     │  │  │  │     │     │  ├─ terations [1078]
    │     │  │  │  │     │     │  │  ╰─ .
    │     │  │  │  │     │     │  │     ╰─ {format} [1078]
    │     │  │  │  │     │     │  ╰─ ssues [1077]
    │     │  │  │  │     │     │     ╰─ .
    │     │  │  │  │     │     │        ╰─ {format} [1077]
    │     │  │  │  │     │     ╰─ m
    │     │  │  │  │     │        ├─ ilestones [1082]
    │     │  │  │  │     │        │  ╰─ .
    │     │  │  │  │     │        │     ╰─ {format} [1082]
    │     │  │  │  │     │        ╰─ e
    │     │  │  │  │     │           ├─ rge_requests [1081]
    │     │  │  │  │     │           │  ╰─ .
    │     │  │  │  │     │           │     ╰─ {format} [1081]
    │     │  │  │  │     │           ╰─ mbers [1080]
    │     │  │  │  │     │              ╰─ .
    │     │  │  │  │     │                 ╰─ {format} [1080]
    │     │  │  │  │     ╰─ dit_events [1073]
    │     │  │  │  │        ╰─ .
    │     │  │  │  │           ╰─ {format} [1073]
    │     │  │  │  ├─ b
    │     │  │  │  │  ├─ adges/release [1093]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format:48} [1093]
    │     │  │  │  │  ├─ ranches [1111]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ├─ diverging_commit_counts [1114]
    │     │  │  │  │  │     ├─ new [1117]
    │     │  │  │  │  │     ├─ {state:45} [1116]
    │     │  │  │  │  │     ╰─ {id:42} [1112]
    │     │  │  │  │  ├─ oards [1109]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1109]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ╰─ {id:3} [1110]
    │     │  │  │  │  │        ╰─ .
    │     │  │  │  │  │           ╰─ {format} [1110]
    │     │  │  │  │  ╰─ l
    │     │  │  │  │     ├─ ame
    │     │  │  │  │     │  ├─ _page/
    │     │  │  │  │     │  │  ╰─ {*id:46} [1094]
    │     │  │  │  │     │  ╰─ /
    │     │  │  │  │     │     ├─ {*id:46}
    │     │  │  │  │     │     │  ╰─ /streaming [1097]
    │     │  │  │  │     │     ╰─ {*id:46} [1095]
    │     │  │  │  │     ╰─ ob/
    │     │  │  │  │        ├─ {*id:46}
    │     │  │  │  │        │  ╰─ /diff [1101]
    │     │  │  │  │        ╰─ {*id:46} [1098]
    │     │  │  │  ├─ c
    │     │  │  │  │  ├─ ycle_analytics [1853]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1853]
    │     │  │  │  │  ├─ adences [1328]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1328]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ├─ new [1329]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1329]
    │     │  │  │  │  │     ├─ {id} [1327]
    │     │  │  │  │  │     │  ├─ /edit [1331]
    │     │  │  │  │  │     │  │  ╰─ .
    │     │  │  │  │  │     │  │     ╰─ {format} [1331]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1327]
    │     │  │  │  │  │     ├─ {iteration_cadence_id}
    │     │  │  │  │  │     │  ╰─ /iterations [1332]
    │     │  │  │  │  │     │     ├─ .
    │     │  │  │  │  │     │     │  ╰─ {format} [1332]
    │     │  │  │  │  │     │     ╰─ /
    │     │  │  │  │  │     │        ╰─ {id:3} [1333]
    │     │  │  │  │  │     │           ╰─ .
    │     │  │  │  │  │     │              ╰─ {format} [1333]
    │     │  │  │  │  │     ├─ {*vueroute}
    │     │  │  │  │  │     │  ├─ .
    │     │  │  │  │  │     │  │  ╰─ {format} [1328]
    │     │  │  │  │  │     │  ╰─ /
    │     │  │  │  │  │     │     ├─ new [1329]
    │     │  │  │  │  │     │     │  ╰─ .
    │     │  │  │  │  │     │     │     ╰─ {format} [1329]
    │     │  │  │  │  │     │     ├─ {id} [1327]
    │     │  │  │  │  │     │     │  ├─ /edit [1331]
    │     │  │  │  │  │     │     │  │  ╰─ .
    │     │  │  │  │  │     │     │  │     ╰─ {format} [1331]
    │     │  │  │  │  │     │     │  ╰─ .
    │     │  │  │  │  │     │     │     ╰─ {format} [1327]
    │     │  │  │  │  │     │     ╰─ {iteration_cadence_id}
    │     │  │  │  │  │     │        ╰─ /iterations [1332]
    │     │  │  │  │  │     │           ├─ .
    │     │  │  │  │  │     │           │  ╰─ {format} [1332]
    │     │  │  │  │  │     │           ╰─ /
    │     │  │  │  │  │     │              ╰─ {id:3} [1333]
    │     │  │  │  │  │     │                 ╰─ .
    │     │  │  │  │  │     │                    ╰─ {format} [1333]
    │     │  │  │  │  │     ╰─ {*vueroute} [1328]
    │     │  │  │  │  ├─ luster
    │     │  │  │  │  │  ├─ _agents/
    │     │  │  │  │  │  │  ╰─ {name} [1131]
    │     │  │  │  │  │  │     ╰─ .
    │     │  │  │  │  │  │        ╰─ {format} [1131]
    │     │  │  │  │  │  ╰─ s [1138]
    │     │  │  │  │  │     ├─ .
    │     │  │  │  │  │     │  ╰─ {format} [1138]
    │     │  │  │  │  │     ╰─ /
    │     │  │  │  │  │        ├─ new_cluster_docs [1141]
    │     │  │  │  │  │        │  ╰─ .
    │     │  │  │  │  │        │     ╰─ {format} [1141]
    │     │  │  │  │  │        ├─ c
    │     │  │  │  │  │        │  ├─ reate_user [1135]
    │     │  │  │  │  │        │  │  ╰─ .
    │     │  │  │  │  │        │  │     ╰─ {format} [1135]
    │     │  │  │  │  │        │  ╰─ onnect [1134]
    │     │  │  │  │  │        │     ╰─ .
    │     │  │  │  │  │        │        ╰─ {format} [1134]
    │     │  │  │  │  │        ├─ {id} [1136]
    │     │  │  │  │  │        │  ├─ /
    │     │  │  │  │  │        │  │  ├─ environments [1137]
    │     │  │  │  │  │        │  │  │  ╰─ .
    │     │  │  │  │  │        │  │  │     ╰─ {format} [1137]
    │     │  │  │  │  │        │  │  ├─ metrics [1139]
    │     │  │  │  │  │        │  │  │  ├─ _dashboard [1140]
    │     │  │  │  │  │        │  │  │  │  ╰─ .
    │     │  │  │  │  │        │  │  │  │     ╰─ {format} [1140]
    │     │  │  │  │  │        │  │  │  ╰─ .
    │     │  │  │  │  │        │  │  │     ╰─ {format} [1139]
    │     │  │  │  │  │        │  │  ╰─ cl
    │     │  │  │  │  │        │  │     ├─ uster_status [1133]
    │     │  │  │  │  │        │  │     │  ╰─ .
    │     │  │  │  │  │        │  │     │     ╰─ {format} [1133]
    │     │  │  │  │  │        │  │     ╰─ ear_cache [1132]
    │     │  │  │  │  │        │  │        ╰─ .
    │     │  │  │  │  │        │  │           ╰─ {format} [1132]
    │     │  │  │  │  │        │  ╰─ .
    │     │  │  │  │  │        │     ╰─ {format} [1136]
    │     │  │  │  │  │        ╰─ {cluster_id}
    │     │  │  │  │  │           ╰─ /integration/create_or_update [1145]
    │     │  │  │  │  │              ╰─ .
    │     │  │  │  │  │                 ╰─ {format} [1145]
    │     │  │  │  │  ├─ reate
    │     │  │  │  │  │  ├─ _dir/
    │     │  │  │  │  │  │  ╰─ {*id:46} [1752]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ╰─ {*id:46} [1099]
    │     │  │  │  │  ├─ i/
    │     │  │  │  │  │  ├─ prometheus_metrics/histograms [1130]
    │     │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │     ╰─ {format:37} [1130]
    │     │  │  │  │  │  ├─ daily_build_group_report_results [1126]
    │     │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │     ╰─ {format:38} [1126]
    │     │  │  │  │  │  ├─ editor [1129]
    │     │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │     ╰─ {format} [1129]
    │     │  │  │  │  │  ╰─ lint [1127]
    │     │  │  │  │  │     ╰─ .
    │     │  │  │  │  │        ╰─ {format} [1127]
    │     │  │  │  │  ╰─ om
    │     │  │  │  │     ├─ pare [1160]
    │     │  │  │  │     │  ╰─ /
    │     │  │  │  │     │     ├─ diff
    │     │  │  │  │     │     │  ├─ _for_path [1161]
    │     │  │  │  │     │     │  ╰─ s_stream [1168]
    │     │  │  │  │     │     ├─ signatures [1167]
    │     │  │  │  │     │     ├─ {from:26}
    │     │  │  │  │     │     │  ╰─ ..
    │     │  │  │  │     │     │     ├─ .
    │     │  │  │  │     │     │     │  ╰─ {to:26} [1165]
    │     │  │  │  │     │     │     ╰─ {to:26} [1166]
    │     │  │  │  │     │     ╰─ {from}
    │     │  │  │  │     │        ╰─ ..
    │     │  │  │  │     │           ├─ .
    │     │  │  │  │     │           │  ╰─ {to} [1163]
    │     │  │  │  │     │           ╰─ {to} [1164]
    │     │  │  │  │     ╰─ m
    │     │  │  │  │        ├─ ent_templates [1146]
    │     │  │  │  │        │  ├─ .
    │     │  │  │  │        │  │  ╰─ {format} [1146]
    │     │  │  │  │        │  ╰─ /
    │     │  │  │  │        │     ╰─ {id} [1147]
    │     │  │  │  │        │        ╰─ .
    │     │  │  │  │        │           ╰─ {format} [1147]
    │     │  │  │  │        ╰─ it
    │     │  │  │  │           ├─ s [1157]
    │     │  │  │  │           │  ╰─ /
    │     │  │  │  │           │     ├─ {*id:46}
    │     │  │  │  │           │     │  ╰─ /signatures [1159]
    │     │  │  │  │           │     ╰─ {*id:46} [1158]
    │     │  │  │  │           ╰─ /
    │     │  │  │  │              ╰─ {id:47} [1155]
    │     │  │  │  │                 ├─ .
    │     │  │  │  │                 │  ╰─ {format} [1155]
    │     │  │  │  │                 ╰─ /
    │     │  │  │  │                    ├─ merge_requests [1152]
    │     │  │  │  │                    │  ╰─ .
    │     │  │  │  │                    │     ╰─ {format} [1152]
    │     │  │  │  │                    ├─ cherry_pick [1149]
    │     │  │  │  │                    │  ╰─ .
    │     │  │  │  │                    │     ╰─ {format} [1149]
    │     │  │  │  │                    ├─ pipelines [1153]
    │     │  │  │  │                    │  ╰─ .
    │     │  │  │  │                    │     ╰─ {format} [1153]
    │     │  │  │  │                    ├─ branches [1148]
    │     │  │  │  │                    │  ╰─ .
    │     │  │  │  │                    │     ╰─ {format} [1148]
    │     │  │  │  │                    ├─ revert [1154]
    │     │  │  │  │                    │  ╰─ .
    │     │  │  │  │                    │     ╰─ {format} [1154]
    │     │  │  │  │                    ╰─ diff
    │     │  │  │  │                       ├─ s_stream [1156]
    │     │  │  │  │                       │  ╰─ .
    │     │  │  │  │                       │     ╰─ {format} [1156]
    │     │  │  │  │                       ╰─ _f
    │     │  │  │  │                          ├─ or_path [1151]
    │     │  │  │  │                          │  ╰─ .
    │     │  │  │  │                          │     ╰─ {format} [1151]
    │     │  │  │  │                          ╰─ iles [1150]
    │     │  │  │  │                             ╰─ .
    │     │  │  │  │                                ╰─ {format} [1150]
    │     │  │  │  ├─ e
    │     │  │  │  │  ├─ scalation_policies [1281]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1281]
    │     │  │  │  │  ├─ rror_tracking [1217]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1217]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ├─ projects [1219]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1219]
    │     │  │  │  │  │     ╰─ {issue_id} [1218]
    │     │  │  │  │  │        ├─ /
    │     │  │  │  │  │        │  ├─ stack_trace [1220]
    │     │  │  │  │  │        │  │  ╰─ .
    │     │  │  │  │  │        │  │     ╰─ {format} [1220]
    │     │  │  │  │  │        │  ╰─ details [1216]
    │     │  │  │  │  │        │     ╰─ .
    │     │  │  │  │  │        │        ╰─ {format} [1216]
    │     │  │  │  │  │        ╰─ .
    │     │  │  │  │  │           ╰─ {format} [1218]
    │     │  │  │  │  ├─ nvironments [1202]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1202]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ├─ search [1208]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1208]
    │     │  │  │  │  │     ├─ new [1207]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1207]
    │     │  │  │  │  │     ├─ folders/
    │     │  │  │  │  │     │  ├─ {*id}
    │     │  │  │  │  │     │  │  ╰─ .
    │     │  │  │  │  │     │  │     ╰─ {format:13} [1204]
    │     │  │  │  │  │     │  ╰─ {*id} [1204]
    │     │  │  │  │  │     ├─ {environment_id}
    │     │  │  │  │  │     │  ╰─ /deployments [1193]
    │     │  │  │  │  │     │     ├─ .
    │     │  │  │  │  │     │     │  ╰─ {format} [1193]
    │     │  │  │  │  │     │     ╰─ /
    │     │  │  │  │  │     │        ╰─ {id} [1195]
    │     │  │  │  │  │     │           ├─ .
    │     │  │  │  │  │     │           │  ╰─ {format} [1195]
    │     │  │  │  │  │     │           ╰─ /
    │     │  │  │  │  │     │              ├─ additional_metrics [1192]
    │     │  │  │  │  │     │              │  ╰─ .
    │     │  │  │  │  │     │              │     ╰─ {format} [1192]
    │     │  │  │  │  │     │              ╰─ metrics [1194]
    │     │  │  │  │  │     │                 ╰─ .
    │     │  │  │  │  │     │                    ╰─ {format} [1194]
    │     │  │  │  │  │     ╰─ {id} [1209]
    │     │  │  │  │  │        ├─ .
    │     │  │  │  │  │        │  ╰─ {format} [1209]
    │     │  │  │  │  │        ╰─ /
    │     │  │  │  │  │           ├─ cancel_auto_stop [1201]
    │     │  │  │  │  │           │  ╰─ .
    │     │  │  │  │  │           │     ╰─ {format} [1201]
    │     │  │  │  │  │           ├─ terminal [1211]
    │     │  │  │  │  │           │  ╰─ .
    │     │  │  │  │  │           │     ├─ ws/authorize [1212]
    │     │  │  │  │  │           │     ╰─ {format} [1211]
    │     │  │  │  │  │           ├─ edit [1203]
    │     │  │  │  │  │           │  ╰─ .
    │     │  │  │  │  │           │     ╰─ {format} [1203]
    │     │  │  │  │  │           ├─ stop [1210]
    │     │  │  │  │  │           │  ╰─ .
    │     │  │  │  │  │           │     ╰─ {format} [1210]
    │     │  │  │  │  │           ├─ k8s [1206]
    │     │  │  │  │  │           │  ├─ .
    │     │  │  │  │  │           │  │  ╰─ {format} [1206]
    │     │  │  │  │  │           │  ╰─ /
    │     │  │  │  │  │           │     ├─ {*vueroute}
    │     │  │  │  │  │           │     │  ╰─ .
    │     │  │  │  │  │           │     │     ╰─ {format} [1206]
    │     │  │  │  │  │           │     ╰─ {*vueroute} [1206]
    │     │  │  │  │  │           ╰─ prometheus/api/v1/
    │     │  │  │  │  │              ├─ {*proxy_path}
    │     │  │  │  │  │              │  ╰─ .
    │     │  │  │  │  │              │     ╰─ {format} [1215]
    │     │  │  │  │  │              ╰─ {*proxy_path} [1215]
    │     │  │  │  │  ╰─ dit/
    │     │  │  │  │     ╰─ {*id:46} [1102]
    │     │  │  │  ├─ f
    │     │  │  │  │  ├─ eature_flags [1224]
    │     │  │  │  │  │  ├─ _
    │     │  │  │  │  │  │  ├─ client/reset_token [1232]
    │     │  │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │  │     ╰─ {format} [1232]
    │     │  │  │  │  │  │  ╰─ user_lists [1234]
    │     │  │  │  │  │  │     ├─ .
    │     │  │  │  │  │  │     │  ╰─ {format} [1234]
    │     │  │  │  │  │  │     ╰─ /
    │     │  │  │  │  │  │        ├─ new [1235]
    │     │  │  │  │  │  │        │  ╰─ .
    │     │  │  │  │  │  │        │     ╰─ {format} [1235]
    │     │  │  │  │  │  │        ╰─ {iid} [1236]
    │     │  │  │  │  │  │           ├─ /edit [1233]
    │     │  │  │  │  │  │           │  ╰─ .
    │     │  │  │  │  │  │           │     ╰─ {format} [1233]
    │     │  │  │  │  │  │           ╰─ .
    │     │  │  │  │  │  │              ╰─ {format} [1236]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1224]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ├─ new [1228]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1228]
    │     │  │  │  │  │     ├─ {iid} [1225]
    │     │  │  │  │  │     │  ├─ /edit [1226]
    │     │  │  │  │  │     │  │  ╰─ .
    │     │  │  │  │  │     │  │     ╰─ {format} [1226]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1225]
    │     │  │  │  │  │     ╰─ {feature_flag_iid}
    │     │  │  │  │  │        ╰─ /issues [1221]
    │     │  │  │  │  │           ├─ .
    │     │  │  │  │  │           │  ╰─ {format} [1221]
    │     │  │  │  │  │           ╰─ /
    │     │  │  │  │  │              ╰─ {id} [1222]
    │     │  │  │  │  │                 ╰─ .
    │     │  │  │  │  │                    ╰─ {format} [1222]
    │     │  │  │  │  ├─ orks [1239]
    │     │  │  │  │  │  ├─ /new [1241]
    │     │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │     ╰─ {format} [1241]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1239]
    │     │  │  │  │  ╰─ i
    │     │  │  │  │     ├─ nd_file/
    │     │  │  │  │     │  ╰─ {*id:46} [1238]
    │     │  │  │  │     ╰─ les/
    │     │  │  │  │        ╰─ {*id:46} [1237]
    │     │  │  │  ├─ g
    │     │  │  │  │  ├─ oogle_cloud [1848]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1848]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ├─ artifact_registry [1242]
    │     │  │  │  │  │     │  ├─ /projects/
    │     │  │  │  │  │     │  │  ╰─ {project}
    │     │  │  │  │  │     │  │     ╰─ /locations/
    │     │  │  │  │  │     │  │        ╰─ {location}
    │     │  │  │  │  │     │  │           ╰─ /repositories/
    │     │  │  │  │  │     │  │              ╰─ {repository}
    │     │  │  │  │  │     │  │                 ╰─ /dockerImages/
    │     │  │  │  │  │     │  │                    ╰─ {image} [1243]
    │     │  │  │  │  │     │  │                       ╰─ .
    │     │  │  │  │  │     │  │                          ╰─ {format} [1243]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1242]
    │     │  │  │  │  │     ├─ service_accounts [1254]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1254]
    │     │  │  │  │  │     ├─ configuration [1244]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1244]
    │     │  │  │  │  │     ├─ revoke_oauth [1253]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1253]
    │     │  │  │  │  │     ├─ gcp_regions [1251]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1251]
    │     │  │  │  │  │     ╰─ d
    │     │  │  │  │  │        ├─ eployments [1250]
    │     │  │  │  │  │        │  ├─ /cloud_
    │     │  │  │  │  │        │  │  ├─ storage [1249]
    │     │  │  │  │  │        │  │  │  ╰─ .
    │     │  │  │  │  │        │  │  │     ╰─ {format} [1249]
    │     │  │  │  │  │        │  │  ╰─ run [1248]
    │     │  │  │  │  │        │  │     ╰─ .
    │     │  │  │  │  │        │  │        ╰─ {format} [1248]
    │     │  │  │  │  │        │  ╰─ .
    │     │  │  │  │  │        │     ╰─ {format} [1250]
    │     │  │  │  │  │        ╰─ atabases [1245]
    │     │  │  │  │  │           ├─ /new/
    │     │  │  │  │  │           │  ╰─ {product} [1247]
    │     │  │  │  │  │           │     ╰─ .
    │     │  │  │  │  │           │        ╰─ {format} [1247]
    │     │  │  │  │  │           ╰─ .
    │     │  │  │  │  │              ╰─ {format} [1245]
    │     │  │  │  │  ╰─ r
    │     │  │  │  │     ├─ oup_links/
    │     │  │  │  │     │  ╰─ {id:16} [1261]
    │     │  │  │  │     │     ╰─ .
    │     │  │  │  │     │        ╰─ {format} [1261]
    │     │  │  │  │     ╰─ aphs/
    │     │  │  │  │        ╰─ {id:42} [1260]
    │     │  │  │  │           ╰─ /
    │     │  │  │  │              ├─ languages [1259]
    │     │  │  │  │              ╰─ c
    │     │  │  │  │                 ├─ ommits [1258]
    │     │  │  │  │                 ├─ harts [1256]
    │     │  │  │  │                 ╰─ i [1257]
    │     │  │  │  ├─ h
    │     │  │  │  │  ├─ arbor/repositories [1265]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1265]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ├─ {id:17} [1266]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1266]
    │     │  │  │  │  │     ╰─ {repository_id:17}
    │     │  │  │  │  │        ╰─ /artifacts [1264]
    │     │  │  │  │  │           ├─ .
    │     │  │  │  │  │           │  ╰─ {format} [1264]
    │     │  │  │  │  │           ╰─ /
    │     │  │  │  │  │              ╰─ {artifact_id:17}
    │     │  │  │  │  │                 ╰─ /tags [1267]
    │     │  │  │  │  │                    ╰─ .
    │     │  │  │  │  │                       ╰─ {format} [1267]
    │     │  │  │  │  ╰─ ooks [1270]
    │     │  │  │  │     ├─ .
    │     │  │  │  │     │  ╰─ {format} [1270]
    │     │  │  │  │     ╰─ /
    │     │  │  │  │        ├─ {id:3} [1271]
    │     │  │  │  │        │  ├─ /
    │     │  │  │  │        │  │  ├─ edit [1272]
    │     │  │  │  │        │  │  │  ╰─ .
    │     │  │  │  │        │  │  │     ╰─ {format} [1272]
    │     │  │  │  │        │  │  ╰─ test [1274]
    │     │  │  │  │        │  │     ╰─ .
    │     │  │  │  │        │  │        ╰─ {format} [1274]
    │     │  │  │  │        │  ╰─ .
    │     │  │  │  │        │     ╰─ {format} [1271]
    │     │  │  │  │        ╰─ {hook_id:3}
    │     │  │  │  │           ╰─ /hook_logs/
    │     │  │  │  │              ╰─ {id:3} [1269]
    │     │  │  │  │                 ├─ /retry [1268]
    │     │  │  │  │                 │  ╰─ .
    │     │  │  │  │                 │     ╰─ {format} [1268]
    │     │  │  │  │                 ╰─ .
    │     │  │  │  │                    ╰─ {format} [1269]
    │     │  │  │  ├─ i
    │     │  │  │  │  ├─ terations [1337]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1337]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ╰─ {id:3} [1338]
    │     │  │  │  │  │        ╰─ .
    │     │  │  │  │  │           ╰─ {format} [1338]
    │     │  │  │  │  ├─ mport [1278]
    │     │  │  │  │  │  ├─ /
    │     │  │  │  │  │  │  ├─ jira [1277]
    │     │  │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │  │     ╰─ {format} [1277]
    │     │  │  │  │  │  │  ╰─ new [1279]
    │     │  │  │  │  │  │     ╰─ .
    │     │  │  │  │  │  │        ╰─ {format} [1279]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1278]
    │     │  │  │  │  ├─ ssues [1303]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ├─ ics [1301]
    │     │  │  │  │  │  │  ╰─ {format} [1303]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ├─ service_desk [1320]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1320]
    │     │  │  │  │  │     ├─ bulk_update [1300]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1300]
    │     │  │  │  │  │     ├─ export_csv [1311]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1311]
    │     │  │  │  │  │     ├─ new [1316]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1316]
    │     │  │  │  │  │     ├─ i
    │     │  │  │  │  │     │  ├─ mport_csv [1312]
    │     │  │  │  │  │     │  │  ╰─ .
    │     │  │  │  │  │     │  │     ╰─ {format} [1312]
    │     │  │  │  │  │     │  ╰─ ncident/
    │     │  │  │  │  │     │     ╰─ {id:3} [1286]
    │     │  │  │  │  │     │        ├─ .
    │     │  │  │  │  │     │        │  ╰─ {format} [1286]
    │     │  │  │  │  │     │        ╰─ /
    │     │  │  │  │  │     │           ╰─ {incident_tab:41} [1286]
    │     │  │  │  │  │     │              ╰─ .
    │     │  │  │  │  │     │                 ╰─ {format} [1286]
    │     │  │  │  │  │     ├─ {issue_id:3}
    │     │  │  │  │  │     │  ╰─ /
    │     │  │  │  │  │     │     ├─ feature_flags [1295]
    │     │  │  │  │  │     │     │  ├─ .
    │     │  │  │  │  │     │     │  │  ╰─ {format} [1295]
    │     │  │  │  │  │     │     │  ╰─ /
    │     │  │  │  │  │     │     │     ╰─ {id:3} [1296]
    │     │  │  │  │  │     │     │        ╰─ .
    │     │  │  │  │  │     │     │           ╰─ {format} [1296]
    │     │  │  │  │  │     │     ╰─ links [1297]
    │     │  │  │  │  │     │        ├─ .
    │     │  │  │  │  │     │        │  ╰─ {format} [1297]
    │     │  │  │  │  │     │        ╰─ /
    │     │  │  │  │  │     │           ╰─ {id:3} [1298]
    │     │  │  │  │  │     │              ╰─ .
    │     │  │  │  │  │     │                 ╰─ {format} [1298]
    │     │  │  │  │  │     ╰─ {id:3} [1308]
    │     │  │  │  │  │        ├─ .
    │     │  │  │  │  │        │  ╰─ {format} [1308]
    │     │  │  │  │  │        ╰─ /
    │     │  │  │  │  │           ├─ toggle_
    │     │  │  │  │  │           │  ├─ subscription [1324]
    │     │  │  │  │  │           │  │  ╰─ .
    │     │  │  │  │  │           │  │     ╰─ {format} [1324]
    │     │  │  │  │  │           │  ╰─ award_emoji [1323]
    │     │  │  │  │  │           │     ╰─ .
    │     │  │  │  │  │           │        ╰─ {format} [1323]
    │     │  │  │  │  │           ├─ edit [1310]
    │     │  │  │  │  │           │  ╰─ .
    │     │  │  │  │  │           │     ╰─ {format} [1310]
    │     │  │  │  │  │           ├─ re
    │     │  │  │  │  │           │  ├─ altime_changes [1317]
    │     │  │  │  │  │           │  │  ╰─ .
    │     │  │  │  │  │           │  │     ╰─ {format} [1317]
    │     │  │  │  │  │           │  ├─ lated_branches [1318]
    │     │  │  │  │  │           │  │  ╰─ .
    │     │  │  │  │  │           │  │     ╰─ {format} [1318]
    │     │  │  │  │  │           │  ╰─ order [1319]
    │     │  │  │  │  │           │     ╰─ .
    │     │  │  │  │  │           │        ╰─ {format} [1319]
    │     │  │  │  │  │           ├─ c
    │     │  │  │  │  │           │  ├─ reate_merge_request [1304]
    │     │  │  │  │  │           │  │  ╰─ .
    │     │  │  │  │  │           │  │     ╰─ {format} [1304]
    │     │  │  │  │  │           │  ╰─ an_create_branch [1302]
    │     │  │  │  │  │           │     ╰─ .
    │     │  │  │  │  │           │        ╰─ {format} [1302]
    │     │  │  │  │  │           ├─ d
    │     │  │  │  │  │           │  ├─ iscussions [1309]
    │     │  │  │  │  │           │  │  ╰─ .
    │     │  │  │  │  │           │  │     ╰─ {format} [1309]
    │     │  │  │  │  │           │  ╰─ es
    │     │  │  │  │  │           │     ├─ igns [1307]
    │     │  │  │  │  │           │     │  ╰─ /
    │     │  │  │  │  │           │     │     ╰─ {*vueroute} [1307]
    │     │  │  │  │  │           │     ╰─ criptions/
    │     │  │  │  │  │           │        ╰─ {version_id} [1305]
    │     │  │  │  │  │           │           ├─ /diff [1306]
    │     │  │  │  │  │           │           │  ╰─ .
    │     │  │  │  │  │           │           │     ╰─ {format} [1306]
    │     │  │  │  │  │           │           ╰─ .
    │     │  │  │  │  │           │              ╰─ {format} [1305]
    │     │  │  │  │  │           ├─ m
    │     │  │  │  │  │           │  ├─ ark_as_spam [1314]
    │     │  │  │  │  │           │  │  ╰─ .
    │     │  │  │  │  │           │  │     ╰─ {format} [1314]
    │     │  │  │  │  │           │  ╰─ ove [1315]
    │     │  │  │  │  │           │     ╰─ .
    │     │  │  │  │  │           │        ╰─ {format} [1315]
    │     │  │  │  │  │           ╰─ {incident_tab:41} [1322]
    │     │  │  │  │  │              ╰─ .
    │     │  │  │  │  │                 ╰─ {format} [1322]
    │     │  │  │  │  ╰─ n
    │     │  │  │  │     ├─ frastructure_registry [1852]
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1852]
    │     │  │  │  │     ├─ tegrations/
    │     │  │  │  │     │  ├─ zentao/issues [1293]
    │     │  │  │  │     │  │  ├─ .
    │     │  │  │  │     │  │  │  ╰─ {format} [1293]
    │     │  │  │  │     │  │  ╰─ /
    │     │  │  │  │     │  │     ╰─ {id} [1294]
    │     │  │  │  │     │  │        ╰─ .
    │     │  │  │  │     │  │           ╰─ {format} [1294]
    │     │  │  │  │     │  ├─ jira/issues [1289]
    │     │  │  │  │     │  │  ├─ .
    │     │  │  │  │     │  │  │  ╰─ {format} [1289]
    │     │  │  │  │     │  │  ╰─ /
    │     │  │  │  │     │  │     ╰─ {id} [1290]
    │     │  │  │  │     │  │        ╰─ .
    │     │  │  │  │     │  │           ╰─ {format} [1290]
    │     │  │  │  │     │  ╰─ slash_commands [1292]
    │     │  │  │  │     │     ├─ /confirm [1291]
    │     │  │  │  │     │     │  ╰─ .
    │     │  │  │  │     │     │     ╰─ {format} [1291]
    │     │  │  │  │     │     ╰─ .
    │     │  │  │  │     │        ╰─ {format} [1292]
    │     │  │  │  │     ╰─ cident
    │     │  │  │  │        ├─ _management/timeline_events/preview_markdown [1284]
    │     │  │  │  │        │  ╰─ .
    │     │  │  │  │        │     ╰─ {format} [1284]
    │     │  │  │  │        ╰─ s [1285]
    │     │  │  │  │           ├─ /integrations/pagerduty [1283]
    │     │  │  │  │           │  ╰─ .
    │     │  │  │  │           │     ╰─ {format} [1283]
    │     │  │  │  │           ╰─ .
    │     │  │  │  │              ╰─ {format} [1285]
    │     │  │  │  ├─ l
    │     │  │  │  │  ├─ earn_gitlab [1368]
    │     │  │  │  │  │  ├─ /end_tutorial [1367]
    │     │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │     ╰─ {format} [1367]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1368]
    │     │  │  │  │  ├─ abels [1355]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1355]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ├─ set_priorities [1363]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1363]
    │     │  │  │  │  │     ├─ generate [1358]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1358]
    │     │  │  │  │  │     ├─ new [1360]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1360]
    │     │  │  │  │  │     ╰─ {id:3} [1356]
    │     │  │  │  │  │        ├─ /
    │     │  │  │  │  │        │  ├─ toggle_subscription [1364]
    │     │  │  │  │  │        │  │  ╰─ .
    │     │  │  │  │  │        │  │     ╰─ {format} [1364]
    │     │  │  │  │  │        │  ├─ remove_priority [1362]
    │     │  │  │  │  │        │  │  ╰─ .
    │     │  │  │  │  │        │  │     ╰─ {format} [1362]
    │     │  │  │  │  │        │  ├─ promote [1361]
    │     │  │  │  │  │        │  │  ╰─ .
    │     │  │  │  │  │        │  │     ╰─ {format} [1361]
    │     │  │  │  │  │        │  ╰─ edit [1357]
    │     │  │  │  │  │        │     ╰─ .
    │     │  │  │  │  │        │        ╰─ {format} [1357]
    │     │  │  │  │  │        ╰─ .
    │     │  │  │  │  │           ╰─ {format} [1356]
    │     │  │  │  │  ╰─ ogs [1369]
    │     │  │  │  │     ╰─ .
    │     │  │  │  │        ╰─ {format} [1369]
    │     │  │  │  ├─ m
    │     │  │  │  │  ├─ l/
    │     │  │  │  │  │  ├─ preview_markdown [1470]
    │     │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │     ╰─ {format} [1470]
    │     │  │  │  │  │  ├─ experiments [1482]
    │     │  │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  │  ╰─ {format} [1482]
    │     │  │  │  │  │  │  ╰─ /
    │     │  │  │  │  │  │     ╰─ {iid} [1481]
    │     │  │  │  │  │  │        ╰─ .
    │     │  │  │  │  │  │           ╰─ {format} [1481]
    │     │  │  │  │  │  ├─ agents [1472]
    │     │  │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  │  ╰─ {format} [1472]
    │     │  │  │  │  │  │  ╰─ /
    │     │  │  │  │  │  │     ├─ new [1473]
    │     │  │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │  │     │     ╰─ {format} [1473]
    │     │  │  │  │  │  │     ├─ {id} [1471]
    │     │  │  │  │  │  │     │  ├─ /edit [1475]
    │     │  │  │  │  │  │     │  │  ╰─ .
    │     │  │  │  │  │  │     │  │     ╰─ {format} [1475]
    │     │  │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │  │     │     ╰─ {format} [1471]
    │     │  │  │  │  │  │     ├─ {*vueroute}
    │     │  │  │  │  │  │     │  ├─ .
    │     │  │  │  │  │  │     │  │  ╰─ {format} [1472]
    │     │  │  │  │  │  │     │  ╰─ /
    │     │  │  │  │  │  │     │     ├─ new [1473]
    │     │  │  │  │  │  │     │     │  ╰─ .
    │     │  │  │  │  │  │     │     │     ╰─ {format} [1473]
    │     │  │  │  │  │  │     │     ╰─ {id} [1471]
    │     │  │  │  │  │  │     │        ├─ /edit [1475]
    │     │  │  │  │  │  │     │        │  ╰─ .
    │     │  │  │  │  │  │     │        │     ╰─ {format} [1475]
    │     │  │  │  │  │  │     │        ╰─ .
    │     │  │  │  │  │  │     │           ╰─ {format} [1471]
    │     │  │  │  │  │  │     ╰─ {*vueroute} [1472]
    │     │  │  │  │  │  ├─ candidates/
    │     │  │  │  │  │  │  ╰─ {iid} [1479]
    │     │  │  │  │  │  │     ╰─ .
    │     │  │  │  │  │  │        ╰─ {format} [1479]
    │     │  │  │  │  │  ╰─ models [1489]
    │     │  │  │  │  │     ├─ .
    │     │  │  │  │  │     │  ╰─ {format} [1489]
    │     │  │  │  │  │     ╰─ /
    │     │  │  │  │  │        ├─ new [1490]
    │     │  │  │  │  │        │  ╰─ .
    │     │  │  │  │  │        │     ╰─ {format} [1490]
    │     │  │  │  │  │        ├─ {model_id} [1487]
    │     │  │  │  │  │        │  ├─ /edit [1488]
    │     │  │  │  │  │        │  │  ╰─ .
    │     │  │  │  │  │        │  │     ╰─ {format} [1488]
    │     │  │  │  │  │        │  ╰─ .
    │     │  │  │  │  │        │     ╰─ {format} [1487]
    │     │  │  │  │  │        ╰─ {model_model_id}
    │     │  │  │  │  │           ╰─ /versions/
    │     │  │  │  │  │              ├─ new [1485]
    │     │  │  │  │  │              │  ╰─ .
    │     │  │  │  │  │              │     ╰─ {format} [1485]
    │     │  │  │  │  │              ╰─ {model_version_id} [1486]
    │     │  │  │  │  │                 ├─ /edit [1484]
    │     │  │  │  │  │                 │  ╰─ .
    │     │  │  │  │  │                 │     ╰─ {format} [1484]
    │     │  │  │  │  │                 ╰─ .
    │     │  │  │  │  │                    ╰─ {format} [1486]
    │     │  │  │  │  ├─ attermost [1370]
    │     │  │  │  │  │  ├─ /new [1371]
    │     │  │  │  │  │  │  ╰─ .
    │     │  │  │  │  │  │     ╰─ {format} [1371]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1370]
    │     │  │  │  │  ├─ e
    │     │  │  │  │  │  ├─ trics [1450]
    │     │  │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  │  ╰─ {format} [1450]
    │     │  │  │  │  │  │  ╰─ /
    │     │  │  │  │  │  │     ╰─ {id:0} [1451]
    │     │  │  │  │  │  │        ╰─ .
    │     │  │  │  │  │  │           ╰─ {format} [1451]
    │     │  │  │  │  │  ╰─ rge
    │     │  │  │  │  │     ├─ d_branches [1113]
    │     │  │  │  │  │     ╰─ _
    │     │  │  │  │  │        ├─ requests [1397]
    │     │  │  │  │  │        │  ├─ .
    │     │  │  │  │  │        │  │  ╰─ {format} [1397]
    │     │  │  │  │  │        │  ╰─ /
    │     │  │  │  │  │        │     ├─ new [1429]
    │     │  │  │  │  │        │     │  ├─ .
    │     │  │  │  │  │        │     │  │  ╰─ {format} [1429]
    │     │  │  │  │  │        │     │  ╰─ /
    │     │  │  │  │  │        │     │     ├─ target_projects [1433]
    │     │  │  │  │  │        │     │     │  ╰─ .
    │     │  │  │  │  │        │     │     │     ╰─ {format} [1433]
    │     │  │  │  │  │        │     │     ├─ pipelines [1431]
    │     │  │  │  │  │        │     │     │  ╰─ .
    │     │  │  │  │  │        │     │     │     ├─ json [1432]
    │     │  │  │  │  │        │     │     │     ╰─ {format} [1431]
    │     │  │  │  │  │        │     │     ├─ branch_
    │     │  │  │  │  │        │     │     │  ├─ from [1424]
    │     │  │  │  │  │        │     │     │  │  ╰─ .
    │     │  │  │  │  │        │     │     │  │     ╰─ {format} [1424]
    │     │  │  │  │  │        │     │     │  ╰─ to [1425]
    │     │  │  │  │  │        │     │     │     ╰─ .
    │     │  │  │  │  │        │     │     │        ╰─ {format} [1425]
    │     │  │  │  │  │        │     │     ╰─ diff
    │     │  │  │  │  │        │     │        ├─ _for_path [1427]
    │     │  │  │  │  │        │     │        │  ╰─ .
    │     │  │  │  │  │        │     │        │     ╰─ {format} [1427]
    │     │  │  │  │  │        │     │        ╰─ s [1430]
    │     │  │  │  │  │        │     │           ╰─ .
    │     │  │  │  │  │        │     │              ├─ json [1428]
    │     │  │  │  │  │        │     │              ╰─ {format} [1430]
    │     │  │  │  │  │        │     ├─ diff_for_path [1391]
    │     │  │  │  │  │        │     │  ╰─ .
    │     │  │  │  │  │        │     │     ╰─ {format} [1391]
    │     │  │  │  │  │        │     ├─ bulk_update [1375]
    │     │  │  │  │  │        │     │  ╰─ .
    │     │  │  │  │  │        │     │     ╰─ {format} [1375]
    │     │  │  │  │  │        │     ├─ export_csv [1395]
    │     │  │  │  │  │        │     │  ╰─ .
    │     │  │  │  │  │        │     │     ╰─ {format} [1395]
    │     │  │  │  │  │        │     ├─ {merge_request_id:3}
    │     │  │  │  │  │        │     │  ╰─ /
    │     │  │  │  │  │        │     │     ├─ drafts [1441]
    │     │  │  │  │  │        │     │     │  ├─ .
    │     │  │  │  │  │        │     │     │  │  ╰─ {format} [1441]
    │     │  │  │  │  │        │     │     │  ╰─ /
    │     │  │  │  │  │        │     │     │     ├─ discard [1443]
    │     │  │  │  │  │        │     │     │     │  ╰─ .
    │     │  │  │  │  │        │     │     │     │     ╰─ {format} [1443]
    │     │  │  │  │  │        │     │     │     ├─ publish [1445]
    │     │  │  │  │  │        │     │     │     │  ╰─ .
    │     │  │  │  │  │        │     │     │     │     ╰─ {format} [1445]
    │     │  │  │  │  │        │     │     │     ╰─ {id:3} [1442]
    │     │  │  │  │  │        │     │     │        ╰─ .
    │     │  │  │  │  │        │     │     │           ╰─ {format} [1442]
    │     │  │  │  │  │        │     │     ╰─ approver
    │     │  │  │  │  │        │     │        ├─ _groups/
    │     │  │  │  │  │        │     │        │  ╰─ {id:3} [1060]
    │     │  │  │  │  │        │     │        │     ╰─ .
    │     │  │  │  │  │        │     │        │        ╰─ {format} [1060]
    │     │  │  │  │  │        │     │        ╰─ s [1063]
    │     │  │  │  │  │        │     │           ├─ .
    │     │  │  │  │  │        │     │           │  ╰─ {format} [1063]
    │     │  │  │  │  │        │     │           ╰─ /
    │     │  │  │  │  │        │     │              ╰─ {id:3} [1062]
    │     │  │  │  │  │        │     │                 ╰─ .
    │     │  │  │  │  │        │     │                    ╰─ {format} [1062]
    │     │  │  │  │  │        │     ╰─ {id:3} [1390]
    │     │  │  │  │  │        │        ├─ .
    │     │  │  │  │  │        │        │  ╰─ {format} [1390]
    │     │  │  │  │  │        │        ╰─ /
    │     │  │  │  │  │        │           ├─ license_scanning_reports [1398]
    │     │  │  │  │  │        │           │  ├─ _collapsed [1399]
    │     │  │  │  │  │        │           │  │  ╰─ .
    │     │  │  │  │  │        │           │  │     ╰─ {format} [1399]
    │     │  │  │  │  │        │           │  ╰─ .
    │     │  │  │  │  │        │           │     ╰─ {format} [1398]
    │     │  │  │  │  │        │           ├─ widget [1423]
    │     │  │  │  │  │        │           │  ╰─ .
    │     │  │  │  │  │        │           │     ╰─ {format} [1423]
    │     │  │  │  │  │        │           ├─ pipeline
    │     │  │  │  │  │        │           │  ├─ _status [1402]
    │     │  │  │  │  │        │           │  │  ╰─ .
    │     │  │  │  │  │        │           │  │     ╰─ {format} [1402]
    │     │  │  │  │  │        │           │  ╰─ s [1412]
    │     │  │  │  │  │        │           │     ╰─ .
    │     │  │  │  │  │        │           │        ├─ json [1403]
    │     │  │  │  │  │        │           │        ╰─ {format} [1412]
    │     │  │  │  │  │        │           ├─ me
    │     │  │  │  │  │        │           │  ├─ trics_reports [1401]
    │     │  │  │  │  │        │           │  │  ╰─ .
    │     │  │  │  │  │        │           │  │     ╰─ {format} [1401]
    │     │  │  │  │  │        │           │  ╰─ rge [1400]
    │     │  │  │  │  │        │           │     ╰─ .
    │     │  │  │  │  │        │           │        ╰─ {format} [1400]
    │     │  │  │  │  │        │           ├─ re
    │     │  │  │  │  │        │           │  ├─ solve_conflicts [1420]
    │     │  │  │  │  │        │           │  │  ╰─ .
    │     │  │  │  │  │        │           │  │     ╰─ {format} [1420]
    │     │  │  │  │  │        │           │  ├─ move_wip [1405]
    │     │  │  │  │  │        │           │  │  ╰─ .
    │     │  │  │  │  │        │           │  │     ╰─ {format} [1405]
    │     │  │  │  │  │        │           │  ├─ ports [1406]
    │     │  │  │  │  │        │           │  │  ╰─ .
    │     │  │  │  │  │        │           │  │     ╰─ {format} [1406]
    │     │  │  │  │  │        │           │  ╰─ base [1404]
    │     │  │  │  │  │        │           │     ╰─ .
    │     │  │  │  │  │        │           │        ╰─ {format} [1404]
    │     │  │  │  │  │        │           ├─ a
    │     │  │  │  │  │        │           │  ├─ ccessibility_reports [1372]
    │     │  │  │  │  │        │           │  │  ╰─ .
    │     │  │  │  │  │        │           │  │     ╰─ {format} [1372]
    │     │  │  │  │  │        │           │  ├─ ssign_related_issues [1374]
    │     │  │  │  │  │        │           │  │  ╰─ .
    │     │  │  │  │  │        │           │  │     ╰─ {format} [1374]
    │     │  │  │  │  │        │           │  ╰─ pi_fuzzing_reports [1373]
    │     │  │  │  │  │        │           │     ╰─ .
    │     │  │  │  │  │        │           │        ╰─ {format} [1373]
    │     │  │  │  │  │        │           ├─ c
    │     │  │  │  │  │        │           │  ├─ o
    │     │  │  │  │  │        │           │  │  ├─ verage_
    │     │  │  │  │  │        │           │  │  │  ├─ fuzzing_reports [1384]
    │     │  │  │  │  │        │           │  │  │  │  ╰─ .
    │     │  │  │  │  │        │           │  │  │  │     ╰─ {format} [1384]
    │     │  │  │  │  │        │           │  │  │  ╰─ reports [1385]
    │     │  │  │  │  │        │           │  │  │     ╰─ .
    │     │  │  │  │  │        │           │  │  │        ╰─ {format} [1385]
    │     │  │  │  │  │        │           │  │  ├─ dequality_
    │     │  │  │  │  │        │           │  │  │  ├─ mr_diff_reports [1378]
    │     │  │  │  │  │        │           │  │  │  │  ╰─ .
    │     │  │  │  │  │        │           │  │  │  │     ╰─ {format} [1378]
    │     │  │  │  │  │        │           │  │  │  ╰─ reports [1379]
    │     │  │  │  │  │        │           │  │  │     ╰─ .
    │     │  │  │  │  │        │           │  │  │        ╰─ {format} [1379]
    │     │  │  │  │  │        │           │  │  ├─ mmit
    │     │  │  │  │  │        │           │  │  │  ├─ _change_content [1380]
    │     │  │  │  │  │        │           │  │  │  │  ╰─ .
    │     │  │  │  │  │        │           │  │  │  │     ╰─ {format} [1380]
    │     │  │  │  │  │        │           │  │  │  ╰─ s [1411]
    │     │  │  │  │  │        │           │  │  │     ╰─ .
    │     │  │  │  │  │        │           │  │  │        ├─ json [1381]
    │     │  │  │  │  │        │           │  │  │        ╰─ {format} [1411]
    │     │  │  │  │  │        │           │  │  ╰─ n
    │     │  │  │  │  │        │           │  │     ├─ flict
    │     │  │  │  │  │        │           │  │     │  ├─ _for_path [1419]
    │     │  │  │  │  │        │           │  │     │  │  ╰─ .
    │     │  │  │  │  │        │           │  │     │  │     ╰─ {format} [1419]
    │     │  │  │  │  │        │           │  │     │  ╰─ s [1421]
    │     │  │  │  │  │        │           │  │     │     ╰─ .
    │     │  │  │  │  │        │           │  │     │        ╰─ {format} [1421]
    │     │  │  │  │  │        │           │  │     ╰─ t
    │     │  │  │  │  │        │           │  │        ├─ ainer_scanning_reports [1382]
    │     │  │  │  │  │        │           │  │        │  ╰─ .
    │     │  │  │  │  │        │           │  │        │     ╰─ {format} [1382]
    │     │  │  │  │  │        │           │  │        ╰─ ext_commits [1383]
    │     │  │  │  │  │        │           │  │           ╰─ .
    │     │  │  │  │  │        │           │  │              ╰─ {format} [1383]
    │     │  │  │  │  │        │           │  ├─ i_environments_status [1377]
    │     │  │  │  │  │        │           │  │  ╰─ .
    │     │  │  │  │  │        │           │  │     ╰─ {format} [1377]
    │     │  │  │  │  │        │           │  ╰─ a
    │     │  │  │  │  │        │           │     ├─ ncel_auto_merge [1376]
    │     │  │  │  │  │        │           │     │  ╰─ .
    │     │  │  │  │  │        │           │     │     ╰─ {format} [1376]
    │     │  │  │  │  │        │           │     ╰─ ched_widget [1422]
    │     │  │  │  │  │        │           │        ╰─ .
    │     │  │  │  │  │        │           │           ╰─ {format} [1422]
    │     │  │  │  │  │        │           ├─ d
    │     │  │  │  │  │        │           │  ├─ ast_reports [1386]
    │     │  │  │  │  │        │           │  │  ╰─ .
    │     │  │  │  │  │        │           │  │     ╰─ {format} [1386]
    │     │  │  │  │  │        │           │  ├─ i
    │     │  │  │  │  │        │           │  │  ├─ scussions [1393]
    │     │  │  │  │  │        │           │  │  │  ╰─ .
    │     │  │  │  │  │        │           │  │  │     ╰─ {format} [1393]
    │     │  │  │  │  │        │           │  │  ╰─ ff
    │     │  │  │  │  │        │           │  │     ├─ s [1392]
    │     │  │  │  │  │        │           │  │     │  ├─ _
    │     │  │  │  │  │        │           │  │     │  │  ├─ metadata [1437]
    │     │  │  │  │  │        │           │  │     │  │  │  ╰─ .
    │     │  │  │  │  │        │           │  │     │  │  │     ╰─ {format} [1437]
    │     │  │  │  │  │        │           │  │     │  │  ├─ stream [1440]
    │     │  │  │  │  │        │           │  │     │  │  │  ╰─ .
    │     │  │  │  │  │        │           │  │     │  │  │     ╰─ {format} [1440]
    │     │  │  │  │  │        │           │  │     │  │  ╰─ batch [1436]
    │     │  │  │  │  │        │           │  │     │  │     ╰─ .
    │     │  │  │  │  │        │           │  │     │  │        ╰─ {format} [1436]
    │     │  │  │  │  │        │           │  │     │  ╰─ .
    │     │  │  │  │  │        │           │  │     │     ├─ json [1438]
    │     │  │  │  │  │        │           │  │     │     ╰─ {format} [1392]
    │     │  │  │  │  │        │           │  │     ╰─ _
    │     │  │  │  │  │        │           │  │        ├─ for_path [1439]
    │     │  │  │  │  │        │           │  │        │  ╰─ .
    │     │  │  │  │  │        │           │  │        │     ├─ json [1435]
    │     │  │  │  │  │        │           │  │        │     ╰─ {format} [1439]
    │     │  │  │  │  │        │           │  │        ╰─ by_file_hash/
    │     │  │  │  │  │        │           │  │           ╰─ {file_hash} [1434]
    │     │  │  │  │  │        │           │  │              ╰─ .
    │     │  │  │  │  │        │           │  │                 ╰─ {format} [1434]
    │     │  │  │  │  │        │           │  ╰─ e
    │     │  │  │  │  │        │           │     ├─ pendency_scanning_reports [1388]
    │     │  │  │  │  │        │           │     │  ╰─ .
    │     │  │  │  │  │        │           │     │     ╰─ {format} [1388]
    │     │  │  │  │  │        │           │     ╰─ scriptions/
    │     │  │  │  │  │        │           │        ╰─ {version_id} [1387]
    │     │  │  │  │  │        │           │           ├─ /diff [1389]
    │     │  │  │  │  │        │           │           │  ╰─ .
    │     │  │  │  │  │        │           │           │     ╰─ {format} [1389]
    │     │  │  │  │  │        │           │           ╰─ .
    │     │  │  │  │  │        │           │              ╰─ {format} [1387]
    │     │  │  │  │  │        │           ├─ e
    │     │  │  │  │  │        │           │  ├─ xposed_artifacts [1396]
    │     │  │  │  │  │        │           │  │  ╰─ .
    │     │  │  │  │  │        │           │  │     ╰─ {format} [1396]
    │     │  │  │  │  │        │           │  ╰─ dit [1394]
    │     │  │  │  │  │        │           │     ╰─ .
    │     │  │  │  │  │        │           │        ╰─ {format} [1394]
    │     │  │  │  │  │        │           ├─ s
    │     │  │  │  │  │        │           │  ├─ ec
    │     │  │  │  │  │        │           │  │  ├─ ret_detection_reports [1408]
    │     │  │  │  │  │        │           │  │  │  ╰─ .
    │     │  │  │  │  │        │           │  │  │     ╰─ {format} [1408]
    │     │  │  │  │  │        │           │  │  ╰─ urity_reports [1409]
    │     │  │  │  │  │        │           │  │     ╰─ .
    │     │  │  │  │  │        │           │  │        ╰─ {format} [1409]
    │     │  │  │  │  │        │           │  ╰─ a
    │     │  │  │  │  │        │           │     ├─ ml_approval [1448]
    │     │  │  │  │  │        │           │     │  ╰─ .
    │     │  │  │  │  │        │           │     │     ╰─ {format} [1448]
    │     │  │  │  │  │        │           │     ╰─ st_reports [1407]
    │     │  │  │  │  │        │           │        ╰─ .
    │     │  │  │  │  │        │           │           ╰─ {format} [1407]
    │     │  │  │  │  │        │           ╰─ t
    │     │  │  │  │  │        │              ├─ oggle_
    │     │  │  │  │  │        │              │  ├─ subscription [1416]
    │     │  │  │  │  │        │              │  │  ╰─ .
    │     │  │  │  │  │        │              │  │     ╰─ {format} [1416]
    │     │  │  │  │  │        │              │  ╰─ award_emoji [1415]
    │     │  │  │  │  │        │              │     ╰─ .
    │     │  │  │  │  │        │              │        ╰─ {format} [1415]
    │     │  │  │  │  │        │              ╰─ e
    │     │  │  │  │  │        │                 ├─ rraform_reports [1413]
    │     │  │  │  │  │        │                 │  ╰─ .
    │     │  │  │  │  │        │                 │     ╰─ {format} [1413]
    │     │  │  │  │  │        │                 ╰─ st_reports [1414]
    │     │  │  │  │  │        │                    ╰─ .
    │     │  │  │  │  │        │                       ╰─ {format} [1414]
    │     │  │  │  │  │        ╰─ trains [1449]
    │     │  │  │  │  │           ╰─ .
    │     │  │  │  │  │              ╰─ {format} [1449]
    │     │  │  │  │  ╰─ i
    │     │  │  │  │     ├─ lestones [1452]
    │     │  │  │  │     │  ├─ .
    │     │  │  │  │     │  │  ╰─ {format} [1452]
    │     │  │  │  │     │  ╰─ /
    │     │  │  │  │     │     ├─ new [1459]
    │     │  │  │  │     │     │  ╰─ .
    │     │  │  │  │     │     │     ╰─ {format} [1459]
    │     │  │  │  │     │     ╰─ {id:3} [1453]
    │     │  │  │  │     │        ├─ /
    │     │  │  │  │     │        │  ├─ merge_requests [1458]
    │     │  │  │  │     │        │  │  ╰─ .
    │     │  │  │  │     │        │  │     ╰─ {format} [1458]
    │     │  │  │  │     │        │  ├─ p
    │     │  │  │  │     │        │  │  ├─ articipants [1460]
    │     │  │  │  │     │        │  │  │  ╰─ .
    │     │  │  │  │     │        │  │  │     ╰─ {format} [1460]
    │     │  │  │  │     │        │  │  ╰─ romote [1461]
    │     │  │  │  │     │        │  │     ╰─ .
    │     │  │  │  │     │        │  │        ╰─ {format} [1461]
    │     │  │  │  │     │        │  ├─ issues [1456]
    │     │  │  │  │     │        │  │  ╰─ .
    │     │  │  │  │     │        │  │     ╰─ {format} [1456]
    │     │  │  │  │     │        │  ├─ labels [1457]
    │     │  │  │  │     │        │  │  ╰─ .
    │     │  │  │  │     │        │  │     ╰─ {format} [1457]
    │     │  │  │  │     │        │  ╰─ edit [1454]
    │     │  │  │  │     │        │     ╰─ .
    │     │  │  │  │     │        │        ╰─ {format} [1454]
    │     │  │  │  │     │        ╰─ .
    │     │  │  │  │     │           ╰─ {format} [1453]
    │     │  │  │  │     ╰─ rror [1465]
    │     │  │  │  │        ├─ /
    │     │  │  │  │        │  ├─ ssh_host_keys [1466]
    │     │  │  │  │        │  │  ╰─ .
    │     │  │  │  │        │  │     ╰─ {format:37} [1466]
    │     │  │  │  │        │  ╰─ update_now [1469]
    │     │  │  │  │        │     ╰─ .
    │     │  │  │  │        │        ╰─ {format} [1469]
    │     │  │  │  │        ╰─ .
    │     │  │  │  │           ╰─ {format} [1465]
    │     │  │  │  ├─ p
    │     │  │  │  │  ├─ ush_rules/
    │     │  │  │  │  │  ╰─ {id:3} [1600]
    │     │  │  │  │  │     ╰─ .
    │     │  │  │  │  │        ╰─ {format} [1600]
    │     │  │  │  │  ├─ ipeline
    │     │  │  │  │  │  ├─ _schedules [1530]
    │     │  │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  │  ╰─ {format} [1530]
    │     │  │  │  │  │  │  ╰─ /
    │     │  │  │  │  │  │     ├─ new [1534]
    │     │  │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │  │     │     ╰─ {format} [1534]
    │     │  │  │  │  │  │     ╰─ {id} [1531]
    │     │  │  │  │  │  │        ├─ /
    │     │  │  │  │  │  │        │  ├─ take_ownership [1536]
    │     │  │  │  │  │  │        │  │  ╰─ .
    │     │  │  │  │  │  │        │  │     ╰─ {format} [1536]
    │     │  │  │  │  │  │        │  ├─ edit [1532]
    │     │  │  │  │  │  │        │  │  ╰─ .
    │     │  │  │  │  │  │        │  │     ╰─ {format} [1532]
    │     │  │  │  │  │  │        │  ╰─ play [1535]
    │     │  │  │  │  │  │        │     ╰─ .
    │     │  │  │  │  │  │        │        ╰─ {format} [1535]
    │     │  │  │  │  │  │        ╰─ .
    │     │  │  │  │  │  │           ╰─ {format} [1531]
    │     │  │  │  │  │  ╰─ s [1543]
    │     │  │  │  │  │     ├─ .
    │     │  │  │  │  │     │  ╰─ {format} [1543]
    │     │  │  │  │  │     ╰─ /
    │     │  │  │  │  │        ├─ settings [1562]
    │     │  │  │  │  │        │  ╰─ .
    │     │  │  │  │  │        │     ╰─ {format} [1562]
    │     │  │  │  │  │        ├─ charts [1541]
    │     │  │  │  │  │        │  ╰─ .
    │     │  │  │  │  │        │     ╰─ {format} [1541]
    │     │  │  │  │  │        ├─ latest [1554]
    │     │  │  │  │  │        │  ╰─ .
    │     │  │  │  │  │        │     ╰─ {format} [1554]
    │     │  │  │  │  │        ├─ new [1551]
    │     │  │  │  │  │        │  ╰─ .
    │     │  │  │  │  │        │     ╰─ {format} [1551]
    │     │  │  │  │  │        ├─ {id} [1544]
    │     │  │  │  │  │        │  ├─ .
    │     │  │  │  │  │        │  │  ╰─ {format} [1544]
    │     │  │  │  │  │        │  ╰─ /
    │     │  │  │  │  │        │     ├─ downloadable_artifacts [1545]
    │     │  │  │  │  │        │     │  ╰─ .
    │     │  │  │  │  │        │     │     ╰─ {format} [1545]
    │     │  │  │  │  │        │     ├─ manual_variables [1550]
    │     │  │  │  │  │        │     │  ╰─ .
    │     │  │  │  │  │        │     │     ╰─ {format} [1550]
    │     │  │  │  │  │        │     ├─ test_report [1558]
    │     │  │  │  │  │        │     │  ╰─ .
    │     │  │  │  │  │        │     │     ╰─ {format} [1558]
    │     │  │  │  │  │        │     ├─ failures [1546]
    │     │  │  │  │  │        │     │  ╰─ .
    │     │  │  │  │  │        │     │     ╰─ {format} [1546]
    │     │  │  │  │  │        │     ├─ builds [1539]
    │     │  │  │  │  │        │     │  ╰─ .
    │     │  │  │  │  │        │     │     ╰─ {format} [1539]
    │     │  │  │  │  │        │     ├─ retry [1552]
    │     │  │  │  │  │        │     │  ╰─ .
    │     │  │  │  │  │        │     │     ╰─ {format} [1552]
    │     │  │  │  │  │        │     ├─ license
    │     │  │  │  │  │        │     │  ├─ _count [1548]
    │     │  │  │  │  │        │     │  │  ╰─ .
    │     │  │  │  │  │        │     │  │     ╰─ {format} [1548]
    │     │  │  │  │  │        │     │  ╰─ s [1549]
    │     │  │  │  │  │        │     │     ╰─ .
    │     │  │  │  │  │        │     │        ╰─ {format} [1549]
    │     │  │  │  │  │        │     ├─ c
    │     │  │  │  │  │        │     │  ├─ odequality_report [1542]
    │     │  │  │  │  │        │     │  │  ╰─ .
    │     │  │  │  │  │        │     │  │     ╰─ {format} [1542]
    │     │  │  │  │  │        │     │  ╰─ ancel [1540]
    │     │  │  │  │  │        │     │     ╰─ .
    │     │  │  │  │  │        │     │        ╰─ {format} [1540]
    │     │  │  │  │  │        │     ╰─ s
    │     │  │  │  │  │        │        ├─ ecurity [1553]
    │     │  │  │  │  │        │        │  ╰─ .
    │     │  │  │  │  │        │        │     ╰─ {format} [1553]
    │     │  │  │  │  │        │        ╰─ ta
    │     │  │  │  │  │        │           ├─ tus [1557]
    │     │  │  │  │  │        │           │  ╰─ .
    │     │  │  │  │  │        │           │     ╰─ {format} [1557]
    │     │  │  │  │  │        │           ╰─ ge [1556]
    │     │  │  │  │  │        │              ╰─ .
    │     │  │  │  │  │        │                 ╰─ {format} [1556]
    │     │  │  │  │  │        ├─ {pipeline_id}
    │     │  │  │  │  │        │  ╰─ /
    │     │  │  │  │  │        │     ├─ stages/
    │     │  │  │  │  │        │     │  ╰─ {stage_name}
    │     │  │  │  │  │        │     │     ╰─ /play_manual [1559]
    │     │  │  │  │  │        │     │        ╰─ .
    │     │  │  │  │  │        │     │           ╰─ {format} [1559]
    │     │  │  │  │  │        │     ╰─ tests/
    │     │  │  │  │  │        │        ├─ summary [1561]
    │     │  │  │  │  │        │        │  ╰─ .
    │     │  │  │  │  │        │        │     ╰─ {format} [1561]
    │     │  │  │  │  │        │        ╰─ {suite_name} [1560]
    │     │  │  │  │  │        │           ╰─ .
    │     │  │  │  │  │        │              ╰─ {format} [1560]
    │     │  │  │  │  │        ╰─ {*ref}
    │     │  │  │  │  │           ╰─ /latest [1554]
    │     │  │  │  │  │              ╰─ .
    │     │  │  │  │  │                 ╰─ {format} [1554]
    │     │  │  │  │  ├─ ackage
    │     │  │  │  │  │  ├─ _files/
    │     │  │  │  │  │  │  ╰─ {id}
    │     │  │  │  │  │  │     ╰─ /download [1508]
    │     │  │  │  │  │  │        ╰─ .
    │     │  │  │  │  │  │           ╰─ {format} [1508]
    │     │  │  │  │  │  ╰─ s [1510]
    │     │  │  │  │  │     ├─ .
    │     │  │  │  │  │     │  ╰─ {format} [1510]
    │     │  │  │  │  │     ╰─ /
    │     │  │  │  │  │        ╰─ {id} [1509]
    │     │  │  │  │  │           ╰─ .
    │     │  │  │  │  │              ╰─ {format} [1509]
    │     │  │  │  │  ╰─ r
    │     │  │  │  │     ├─ o
    │     │  │  │  │     │  ├─ tected_
    │     │  │  │  │     │  │  ├─ environments [1589]
    │     │  │  │  │     │  │  │  ├─ .
    │     │  │  │  │     │  │  │  │  ╰─ {format} [1589]
    │     │  │  │  │     │  │  │  ╰─ /
    │     │  │  │  │     │  │  │     ├─ search [1591]
    │     │  │  │  │     │  │  │     │  ╰─ .
    │     │  │  │  │     │  │  │     │     ╰─ {format} [1591]
    │     │  │  │  │     │  │  │     ╰─ {id:3} [1590]
    │     │  │  │  │     │  │  │        ╰─ .
    │     │  │  │  │     │  │  │           ╰─ {format} [1590]
    │     │  │  │  │     │  │  ├─ branches [1583]
    │     │  │  │  │     │  │  │  ╰─ /
    │     │  │  │  │     │  │  │     ╰─ {id:42} [1584]
    │     │  │  │  │     │  │  ╰─ tags [1594]
    │     │  │  │  │     │  │     ╰─ /
    │     │  │  │  │     │  │        ╰─ {id:42} [1595]
    │     │  │  │  │     │  ╰─ ject_members [1567]
    │     │  │  │  │     │     ├─ .
    │     │  │  │  │     │     │  ╰─ {format} [1567]
    │     │  │  │  │     │     ╰─ /
    │     │  │  │  │     │        ├─ request_access [1569]
    │     │  │  │  │     │        │  ╰─ .
    │     │  │  │  │     │        │     ╰─ {format} [1569]
    │     │  │  │  │     │        ├─ leave [1568]
    │     │  │  │  │     │        │  ╰─ .
    │     │  │  │  │     │        │     ╰─ {format} [1568]
    │     │  │  │  │     │        ╰─ {id:39} [1566]
    │     │  │  │  │     │           ├─ /
    │     │  │  │  │     │           │  ├─ approve_access_request [1565]
    │     │  │  │  │     │           │  │  ╰─ .
    │     │  │  │  │     │           │  │     ╰─ {format} [1565]
    │     │  │  │  │     │           │  ╰─ resend_invite [1571]
    │     │  │  │  │     │           │     ╰─ .
    │     │  │  │  │     │           │        ╰─ {format} [1571]
    │     │  │  │  │     │           ╰─ .
    │     │  │  │  │     │              ╰─ {format} [1566]
    │     │  │  │  │     ╰─ eview
    │     │  │  │  │        ├─ _markdown [1019]
    │     │  │  │  │        │  ╰─ .
    │     │  │  │  │        │     ╰─ {format} [1019]
    │     │  │  │  │        ╰─ /
    │     │  │  │  │           ╰─ {*id:46} [1104]
    │     │  │  │  ├─ r
    │     │  │  │  │  ├─ unners [1635]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1635]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ├─ toggle_
    │     │  │  │  │  │     │  ├─ shared_runners [1642]
    │     │  │  │  │  │     │  │  ╰─ .
    │     │  │  │  │  │     │  │     ╰─ {format} [1642]
    │     │  │  │  │  │     │  ╰─ group_runners [1641]
    │     │  │  │  │  │     │     ╰─ .
    │     │  │  │  │  │     │        ╰─ {format} [1641]
    │     │  │  │  │  │     ├─ new [1636]
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1636]
    │     │  │  │  │  │     ╰─ {id} [1633]
    │     │  │  │  │  │        ├─ /
    │     │  │  │  │  │        │  ├─ re
    │     │  │  │  │  │        │  │  ├─ gister [1638]
    │     │  │  │  │  │        │  │  │  ╰─ .
    │     │  │  │  │  │        │  │  │     ╰─ {format} [1638]
    │     │  │  │  │  │        │  │  ╰─ sume [1639]
    │     │  │  │  │  │        │  │     ╰─ .
    │     │  │  │  │  │        │  │        ╰─ {format} [1639]
    │     │  │  │  │  │        │  ├─ pause [1637]
    │     │  │  │  │  │        │  │  ╰─ .
    │     │  │  │  │  │        │  │     ╰─ {format} [1637]
    │     │  │  │  │  │        │  ╰─ edit [1634]
    │     │  │  │  │  │        │     ╰─ .
    │     │  │  │  │  │        │        ╰─ {format} [1634]
    │     │  │  │  │  │        ╰─ .
    │     │  │  │  │  │           ╰─ {format} [1633]
    │     │  │  │  │  ├─ aw/
    │     │  │  │  │  │  ╰─ {*id:46} [1605]
    │     │  │  │  │  ╰─ e
    │     │  │  │  │     ├─ quirements_management/requirements [1630]
    │     │  │  │  │     │  ├─ /import_csv [1629]
    │     │  │  │  │     │  │  ├─ /authorize [1628]
    │     │  │  │  │     │  │  │  ╰─ .
    │     │  │  │  │     │  │  │     ╰─ {format} [1628]
    │     │  │  │  │     │  │  ╰─ .
    │     │  │  │  │     │  │     ╰─ {format} [1629]
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1630]
    │     │  │  │  │     ├─ pository [1626]
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1626]
    │     │  │  │  │     ├─ leases [1620]
    │     │  │  │  │     │  ├─ /
    │     │  │  │  │     │  │  ├─ permalink/latest [1621]
    │     │  │  │  │     │  │  │  ├─ / [1621]
    │     │  │  │  │     │  │  │  │  ╰─ {*suffix_path} [1621]
    │     │  │  │  │     │  │  │  ╰─ {*suffix_path} [1621]
    │     │  │  │  │     │  │  ├─ outbox [18]
    │     │  │  │  │     │  │  │  ╰─ .
    │     │  │  │  │     │  │  │     ╰─ {format} [18]
    │     │  │  │  │     │  │  ├─ inbox [16]
    │     │  │  │  │     │  │  │  ╰─ .
    │     │  │  │  │     │  │  │     ╰─ {format} [16]
    │     │  │  │  │     │  │  ├─ new [1622]
    │     │  │  │  │     │  │  │  ╰─ .
    │     │  │  │  │     │  │  │     ╰─ {format} [1622]
    │     │  │  │  │     │  │  ╰─ {tag:40} [1623]
    │     │  │  │  │     │  │     ├─ .
    │     │  │  │  │     │  │     │  ╰─ {format} [1623]
    │     │  │  │  │     │  │     ╰─ /
    │     │  │  │  │     │  │        ├─ e
    │     │  │  │  │     │  │        │  ├─ dit [1619]
    │     │  │  │  │     │  │        │  │  ╰─ .
    │     │  │  │  │     │  │        │  │     ╰─ {format} [1619]
    │     │  │  │  │     │  │        │  ╰─ vidences/
    │     │  │  │  │     │  │        │     ╰─ {id} [1624]
    │     │  │  │  │     │  │        │        ╰─ .
    │     │  │  │  │     │  │        │           ╰─ {format} [1624]
    │     │  │  │  │     │  │        ╰─ downloads/
    │     │  │  │  │     │  │           ╰─ {*filepath} [1618]
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ├─ json [17]
    │     │  │  │  │     │     ╰─ {format} [1620]
    │     │  │  │  │     ╰─ fs/
    │     │  │  │  │        ├─ switch [1611]
    │     │  │  │  │        ├─ {id:42}
    │     │  │  │  │        │  ╰─ /logs_tree [1609]
    │     │  │  │  │        ╰─ {id:43}
    │     │  │  │  │           ╰─ /logs_tree/
    │     │  │  │  │              ╰─ {*path:44} [1610]
    │     │  │  │  ╰─ {noteable_type}
    │     │  │  │     ╰─ /
    │     │  │  │        ╰─ {noteable_id}
    │     │  │  │           ╰─ /discussions/
    │     │  │  │              ╰─ {id:49} [1199]
    │     │  │  │                 ├─ /resolve [1198]
    │     │  │  │                 │  ╰─ .
    │     │  │  │                 │     ╰─ {format} [1198]
    │     │  │  │                 ╰─ .
    │     │  │  │                    ╰─ {format} [1199]
    │     │  │  ├─ de
    │     │  │  │  ├─ pendencies [1824]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1824]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ {*rest}
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1824]
    │     │  │  │  │     ╰─ {*rest} [1824]
    │     │  │  │  ╰─ scription_templates/names/
    │     │  │  │     ╰─ {template_type:50} [1746]
    │     │  │  │        ╰─ .
    │     │  │  │           ╰─ {format:37} [1746]
    │     │  │  ├─ fi
    │     │  │  │  ├─ nd_file [1828]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1828]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ {*rest}
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1828]
    │     │  │  │  │     ╰─ {*rest} [1828]
    │     │  │  │  ╰─ les [1827]
    │     │  │  │     ├─ .
    │     │  │  │     │  ╰─ {format} [1827]
    │     │  │  │     ╰─ /
    │     │  │  │        ├─ {*rest}
    │     │  │  │        │  ╰─ .
    │     │  │  │        │     ╰─ {format} [1827]
    │     │  │  │        ╰─ {*rest} [1827]
    │     │  │  ├─ a
    │     │  │  │  ├─ udit_events [1818]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1818]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ {*rest}
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1818]
    │     │  │  │  │     ╰─ {*rest} [1818]
    │     │  │  │  ╰─ lert
    │     │  │  │     ├─ s/notify [1034]
    │     │  │  │     │  ├─ .
    │     │  │  │     │  │  ╰─ {format} [1034]
    │     │  │  │     │  ╰─ /
    │     │  │  │     │     ╰─ {name}
    │     │  │  │     │        ╰─ /
    │     │  │  │     │           ╰─ {endpoint_identifier:51} [1035]
    │     │  │  │     │              ╰─ .
    │     │  │  │     │                 ╰─ {format} [1035]
    │     │  │  │     ╰─ _management [1817]
    │     │  │  │        ├─ .
    │     │  │  │        │  ╰─ {format} [1817]
    │     │  │  │        ╰─ /
    │     │  │  │           ├─ {*rest}
    │     │  │  │           │  ╰─ .
    │     │  │  │           │     ╰─ {format} [1817]
    │     │  │  │           ╰─ {*rest} [1817]
    │     │  │  ├─ b
    │     │  │  │  ├─ adges [1091]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1091]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ╰─ {*ref}
    │     │  │  │  │        ╰─ /
    │     │  │  │  │           ├─ coverage [1090]
    │     │  │  │  │           │  ╰─ .
    │     │  │  │  │           │     ╰─ {format:48} [1090]
    │     │  │  │  │           ╰─ pipeline [1092]
    │     │  │  │  │              ╰─ .
    │     │  │  │  │                 ╰─ {format:48} [1092]
    │     │  │  │  ├─ uilds [1123]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1123]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ artifacts/
    │     │  │  │  │     │  ╰─ {*ref_name_and_path} [1121]
    │     │  │  │  │     ├─ {build_id:3}
    │     │  │  │  │     │  ╰─ /artifacts/
    │     │  │  │  │     │     ├─ download [1119]
    │     │  │  │  │     │     │  ╰─ .
    │     │  │  │  │     │     │     ╰─ {format} [1119]
    │     │  │  │  │     │     ├─ browse [1118]
    │     │  │  │  │     │     │  ╰─ /
    │     │  │  │  │     │     │     ╰─ {*path} [1118]
    │     │  │  │  │     │     ├─ file/
    │     │  │  │  │     │     │  ╰─ {*path} [1120]
    │     │  │  │  │     │     ╰─ raw/
    │     │  │  │  │     │        ╰─ {*path} [1122]
    │     │  │  │  │     ╰─ {id:3} [1125]
    │     │  │  │  │        ├─ /raw [1124]
    │     │  │  │  │        │  ╰─ .
    │     │  │  │  │        │     ╰─ {format} [1124]
    │     │  │  │  │        ╰─ .
    │     │  │  │  │           ╰─ {format} [1125]
    │     │  │  │  ╰─ l
    │     │  │  │     ├─ ame/
    │     │  │  │     │  ╰─ {*id:46} [1096]
    │     │  │  │     ╰─ ob/
    │     │  │  │        ╰─ {*id:46} [1106]
    │     │  │  ├─ c
    │     │  │  │  ├─ ycle_analytics [1823]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1823]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ {*rest}
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1823]
    │     │  │  │  │     ╰─ {*rest} [1823]
    │     │  │  │  ├─ lusters [1819]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1819]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ {*rest}
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1819]
    │     │  │  │  │     ╰─ {*rest} [1819]
    │     │  │  │  ╰─ o
    │     │  │  │     ├─ ntainer_registry [1613]
    │     │  │  │     │  ├─ .
    │     │  │  │     │  │  ╰─ {format} [1613]
    │     │  │  │     │  ╰─ /
    │     │  │  │     │     ╰─ {id} [1612]
    │     │  │  │     │        ╰─ .
    │     │  │  │     │           ╰─ {format} [1612]
    │     │  │  │     ╰─ m
    │     │  │  │        ├─ pare [1822]
    │     │  │  │        │  ├─ .
    │     │  │  │        │  │  ╰─ {format} [1822]
    │     │  │  │        │  ╰─ /
    │     │  │  │        │     ├─ {*rest}
    │     │  │  │        │     │  ╰─ .
    │     │  │  │        │     │     ╰─ {format} [1822]
    │     │  │  │        │     ╰─ {*rest} [1822]
    │     │  │  │        ╰─ mit [1820]
    │     │  │  │           ├─ s [1821]
    │     │  │  │           │  ├─ .
    │     │  │  │           │  │  ╰─ {format} [1821]
    │     │  │  │           │  ╰─ /
    │     │  │  │           │     ├─ {*rest}
    │     │  │  │           │     │  ╰─ .
    │     │  │  │           │     │     ╰─ {format} [1821]
    │     │  │  │           │     ╰─ {*rest} [1821]
    │     │  │  │           ├─ .
    │     │  │  │           │  ╰─ {format} [1820]
    │     │  │  │           ╰─ /
    │     │  │  │              ├─ {*rest}
    │     │  │  │              │  ╰─ .
    │     │  │  │              │     ╰─ {format} [1820]
    │     │  │  │              ╰─ {*rest} [1820]
    │     │  │  ├─ e
    │     │  │  │  ├─ rror_tracking [1826]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1826]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ {*rest}
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1826]
    │     │  │  │  │     ╰─ {*rest} [1826]
    │     │  │  │  ├─ nvironments [1825]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1825]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ {*rest}
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1825]
    │     │  │  │  │     ╰─ {*rest} [1825]
    │     │  │  │  ╰─ dit/
    │     │  │  │     ╰─ {*id:46} [1847]
    │     │  │  ├─ i
    │     │  │  │  ├─ de_terminals [1776]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format:37} [1776]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ check_config [1775]
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format:37} [1775]
    │     │  │  │  │     ╰─ {id:3} [1778]
    │     │  │  │  │        ├─ .
    │     │  │  │  │        │  ╰─ {format:37} [1778]
    │     │  │  │  │        ╰─ /
    │     │  │  │  │           ├─ cancel [1774]
    │     │  │  │  │           │  ╰─ .
    │     │  │  │  │           │     ╰─ {format:37} [1774]
    │     │  │  │  │           ╰─ retry [1777]
    │     │  │  │  │              ╰─ .
    │     │  │  │  │                 ╰─ {format:37} [1777]
    │     │  │  │  ├─ nsights [1288]
    │     │  │  │  │  ├─ /query [1287]
    │     │  │  │  │  │  ╰─ .
    │     │  │  │  │  │     ╰─ {format} [1287]
    │     │  │  │  │  ╰─ .
    │     │  │  │  │     ╰─ {format} [1288]
    │     │  │  │  ╰─ ssues [1830]
    │     │  │  │     ├─ .
    │     │  │  │     │  ╰─ {format} [1830]
    │     │  │  │     ╰─ /
    │     │  │  │        ├─ {*rest}
    │     │  │  │        │  ╰─ .
    │     │  │  │        │     ╰─ {format} [1830]
    │     │  │  │        ╰─ {*rest} [1830]
    │     │  │  ├─ m
    │     │  │  │  ├─ erge_requests [1832]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1832]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ {*rest}
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1832]
    │     │  │  │  │     ╰─ {*rest} [1832]
    │     │  │  │  ├─ attermost [1831]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1831]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ {*rest}
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1831]
    │     │  │  │  │     ╰─ {*rest} [1831]
    │     │  │  │  ╰─ irror [1833]
    │     │  │  │     ├─ .
    │     │  │  │     │  ╰─ {format} [1833]
    │     │  │  │     ╰─ /
    │     │  │  │        ├─ {*rest}
    │     │  │  │        │  ╰─ .
    │     │  │  │        │     ╰─ {format} [1833]
    │     │  │  │        ╰─ {*rest} [1833]
    │     │  │  ├─ p
    │     │  │  │  ├─ ipeline
    │     │  │  │  │  ├─ _schedules [1834]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1834]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ├─ {*rest}
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1834]
    │     │  │  │  │  │     ╰─ {*rest} [1834]
    │     │  │  │  │  ╰─ s [1835]
    │     │  │  │  │     ├─ .
    │     │  │  │  │     │  ╰─ {format} [1835]
    │     │  │  │  │     ╰─ /
    │     │  │  │  │        ├─ {*rest}
    │     │  │  │  │        │  ╰─ .
    │     │  │  │  │        │     ╰─ {format} [1835]
    │     │  │  │  │        ╰─ {*rest} [1835]
    │     │  │  │  ├─ ro
    │     │  │  │  │  ├─ tected_environments [1836]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1836]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ├─ {*rest}
    │     │  │  │  │  │     │  ╰─ .
    │     │  │  │  │  │     │     ╰─ {format} [1836]
    │     │  │  │  │  │     ╰─ {*rest} [1836]
    │     │  │  │  │  ╰─ metheus/
    │     │  │  │  │     ├─ metrics [1575]
    │     │  │  │  │     │  ├─ /
    │     │  │  │  │     │  │  ├─ validate_query [1582]
    │     │  │  │  │     │  │  │  ╰─ .
    │     │  │  │  │     │  │  │     ╰─ {format} [1582]
    │     │  │  │  │     │  │  ├─ active_common [1574]
    │     │  │  │  │     │  │  │  ╰─ .
    │     │  │  │  │     │  │  │     ╰─ {format} [1574]
    │     │  │  │  │     │  │  ├─ new [1579]
    │     │  │  │  │     │  │  │  ╰─ .
    │     │  │  │  │     │  │  │     ╰─ {format} [1579]
    │     │  │  │  │     │  │  ╰─ {id:0} [1576]
    │     │  │  │  │     │  │     ├─ /edit [1577]
    │     │  │  │  │     │  │     │  ╰─ .
    │     │  │  │  │     │  │     │     ╰─ {format} [1577]
    │     │  │  │  │     │  │     ╰─ .
    │     │  │  │  │     │  │        ╰─ {format} [1576]
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1575]
    │     │  │  │  │     ╰─ alerts/
    │     │  │  │  │        ├─ notify [1036]
    │     │  │  │  │        │  ╰─ .
    │     │  │  │  │        │     ╰─ {format} [1036]
    │     │  │  │  │        ╰─ {id:3}
    │     │  │  │  │           ╰─ /metrics_dashboard [1037]
    │     │  │  │  │              ╰─ .
    │     │  │  │  │                 ╰─ {format} [1037]
    │     │  │  │  ╰─ a
    │     │  │  │     ├─ ges [1512]
    │     │  │  │     │  ├─ /
    │     │  │  │     │  │  ├─ new [1513]
    │     │  │  │     │  │  │  ╰─ .
    │     │  │  │     │  │  │     ╰─ {format} [1513]
    │     │  │  │     │  │  ╰─ domains [1518]
    │     │  │  │     │  │     ├─ .
    │     │  │  │     │  │     │  ╰─ {format} [1518]
    │     │  │  │     │  │     ╰─ /
    │     │  │  │     │  │        ├─ new [1521]
    │     │  │  │     │  │        │  ╰─ .
    │     │  │  │     │  │        │     ╰─ {format} [1521]
    │     │  │  │     │  │        ╰─ {id:0} [1519]
    │     │  │  │     │  │           ├─ /
    │     │  │  │     │  │           │  ├─ clean_certificate [1517]
    │     │  │  │     │  │           │  │  ╰─ .
    │     │  │  │     │  │           │  │     ╰─ {format} [1517]
    │     │  │  │     │  │           │  ├─ retry_auto_ssl [1522]
    │     │  │  │     │  │           │  │  ╰─ .
    │     │  │  │     │  │           │  │     ╰─ {format} [1522]
    │     │  │  │     │  │           │  ├─ verify [1526]
    │     │  │  │     │  │           │  │  ╰─ .
    │     │  │  │     │  │           │  │     ╰─ {format} [1526]
    │     │  │  │     │  │           │  ╰─ edit [1520]
    │     │  │  │     │  │           │     ╰─ .
    │     │  │  │     │  │           │        ╰─ {format} [1520]
    │     │  │  │     │  │           ╰─ .
    │     │  │  │     │  │              ╰─ {format} [1519]
    │     │  │  │     │  ╰─ .
    │     │  │  │     │     ╰─ {format} [1512]
    │     │  │  │     ╰─ th_locks [1528]
    │     │  │  │        ├─ .
    │     │  │  │        │  ╰─ {format} [1528]
    │     │  │  │        ╰─ /
    │     │  │  │           ├─ toggle [1529]
    │     │  │  │           │  ╰─ .
    │     │  │  │           │     ╰─ {format} [1529]
    │     │  │  │           ╰─ {id} [1527]
    │     │  │  │              ╰─ .
    │     │  │  │                 ╰─ {format} [1527]
    │     │  │  ├─ r
    │     │  │  │  ├─ unner
    │     │  │  │  │  ├─ _projects [1631]
    │     │  │  │  │  │  ├─ .
    │     │  │  │  │  │  │  ╰─ {format} [1631]
    │     │  │  │  │  │  ╰─ /
    │     │  │  │  │  │     ╰─ {id} [1632]
    │     │  │  │  │  │        ╰─ .
    │     │  │  │  │  │           ╰─ {format} [1632]
    │     │  │  │  │  ╰─ s [1837]
    │     │  │  │  │     ├─ .
    │     │  │  │  │     │  ╰─ {format} [1837]
    │     │  │  │  │     ╰─ /
    │     │  │  │  │        ├─ {*rest}
    │     │  │  │  │        │  ╰─ .
    │     │  │  │  │        │     ╰─ {format} [1837]
    │     │  │  │  │        ╰─ {*rest} [1837]
    │     │  │  │  ├─ aw/
    │     │  │  │  │  ╰─ {*id:46} [1606]
    │     │  │  │  ╰─ e
    │     │  │  │     ├─ pository [1627]
    │     │  │  │     │  ╰─ .
    │     │  │  │     │     ╰─ {format} [1627]
    │     │  │  │     ├─ store [1023]
    │     │  │  │     │  ╰─ .
    │     │  │  │     │     ╰─ {format} [1023]
    │     │  │  │     ├─ gistry/repository/
    │     │  │  │     │  ╰─ {repository_id}
    │     │  │  │     │     ╰─ /tags [1617]
    │     │  │  │     │        ╰─ /
    │     │  │  │     │           ├─ bulk_destroy [1615]
    │     │  │  │     │           ╰─ {id:52} [1616]
    │     │  │  │     ╰─ fs/
    │     │  │  │        ├─ switch [1851]
    │     │  │  │        ├─ {id:42}
    │     │  │  │        │  ╰─ /logs_tree [1850]
    │     │  │  │        ╰─ {id:43}
    │     │  │  │           ╰─ /logs_tree/
    │     │  │  │              ╰─ {*path:44} [1813]
    │     │  │  ├─ s
    │     │  │  │  ├─ nippets [1840]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1840]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ {id:3}
    │     │  │  │  │     │  ╰─ /raw [1730]
    │     │  │  │  │     ├─ {*rest}
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1840]
    │     │  │  │  │     ╰─ {*rest} [1840]
    │     │  │  │  ╰─ e
    │     │  │  │     ├─ curity [1838]
    │     │  │  │     │  ├─ .
    │     │  │  │     │  │  ╰─ {format} [1838]
    │     │  │  │     │  ╰─ /
    │     │  │  │     │     ├─ {*rest}
    │     │  │  │     │     │  ╰─ .
    │     │  │  │     │     │     ╰─ {format} [1838]
    │     │  │  │     │     ╰─ {*rest} [1838]
    │     │  │  │     ╰─ rv
    │     │  │  │        ├─ erless [1839]
    │     │  │  │        │  ├─ .
    │     │  │  │        │  │  ╰─ {format} [1839]
    │     │  │  │        │  ╰─ /
    │     │  │  │        │     ├─ {*rest}
    │     │  │  │        │     │  ╰─ .
    │     │  │  │        │     │     ╰─ {format} [1839]
    │     │  │  │        │     ╰─ {*rest} [1839]
    │     │  │  │        ╰─ ice_
    │     │  │  │           ├─ ping/web_ide_pipelines_count [1682]
    │     │  │  │           │  ╰─ .
    │     │  │  │           │     ╰─ {format} [1682]
    │     │  │  │           ╰─ desk [1675]
    │     │  │  │              ╰─ .
    │     │  │  │                 ╰─ {format} [1675]
    │     │  │  ├─ t
    │     │  │  │  ├─ odos [1749]
    │     │  │  │  │  ╰─ .
    │     │  │  │  │     ╰─ {format} [1749]
    │     │  │  │  ├─ ags [1841]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1841]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ {*rest}
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1841]
    │     │  │  │  │     ╰─ {*rest} [1841]
    │     │  │  │  ├─ emplates/
    │     │  │  │  │  ╰─ {template_type:50} [1745]
    │     │  │  │  │     ├─ .
    │     │  │  │  │     │  ╰─ {format:37} [1745]
    │     │  │  │  │     ╰─ /
    │     │  │  │  │        ╰─ {key:0} [1747]
    │     │  │  │  │           ╰─ .
    │     │  │  │  │              ╰─ {format:37} [1747]
    │     │  │  │  ╰─ r
    │     │  │  │     ├─ iggers [1842]
    │     │  │  │     │  ├─ .
    │     │  │  │     │  │  ╰─ {format} [1842]
    │     │  │  │     │  ╰─ /
    │     │  │  │     │     ├─ {*rest}
    │     │  │  │     │     │  ╰─ .
    │     │  │  │     │     │     ╰─ {format} [1842]
    │     │  │  │     │     ╰─ {*rest} [1842]
    │     │  │  │     ╰─ ee/
    │     │  │  │        ╰─ {*id:46} [1754]
    │     │  │  ├─ v
    │     │  │  │  ├─ ulnerability_feedback [1844]
    │     │  │  │  │  ├─ .
    │     │  │  │  │  │  ╰─ {format} [1844]
    │     │  │  │  │  ╰─ /
    │     │  │  │  │     ├─ {*rest}
    │     │  │  │  │     │  ╰─ .
    │     │  │  │  │     │     ╰─ {format} [1844]
    │     │  │  │  │     ╰─ {*rest} [1844]
    │     │  │  │  ╰─ ariables [1843]
    │     │  │  │     ├─ .
    │     │  │  │     │  ╰─ {format} [1843]
    │     │  │  │     ╰─ /
    │     │  │  │        ├─ {*rest}
    │     │  │  │        │  ╰─ .
    │     │  │  │        │     ╰─ {format} [1843]
    │     │  │  │        ╰─ {*rest} [1843]
    │     │  │  ├─ {*all}
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [294]
    │     │  │  ╰─ {*all} [294]
    │     │  ╰─ .
    │     │     ╰─ {format} [293]
    │     ╰─ {id:4} [1010]
    │        ├─ /
    │        │  ├─ new_issuable_address [1018]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [1018]
    │        │  ├─ generate_new_export [1014]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [1014]
    │        │  ├─ download_export [1011]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [1011]
    │        │  ├─ housekeeping [1015]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [1015]
    │        │  ├─ un
    │        │  │  ├─ foldered_environment_names [1028]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [1028]
    │        │  │  ╰─ archive [1027]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [1027]
    │        │  ├─ re
    │        │  │  ├─ move_
    │        │  │  │  ├─ export [1021]
    │        │  │  │  │  ╰─ .
    │        │  │  │  │     ╰─ {format} [1021]
    │        │  │  │  ╰─ fork [1022]
    │        │  │  │     ╰─ .
    │        │  │  │        ╰─ {format} [1022]
    │        │  │  ╰─ fs [1020]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [1020]
    │        │  ├─ a
    │        │  │  ├─ ctivity [1007]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [1007]
    │        │  │  ╰─ rchive [1008]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [1008]
    │        │  ├─ e
    │        │  │  ├─ xport [1013]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [1013]
    │        │  │  ╰─ dit [1012]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [1012]
    │        │  ╰─ t
    │        │     ├─ oggle_star [1025]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [1025]
    │        │     ╰─ ransfer [1026]
    │        │        ╰─ .
    │        │           ╰─ {format} [1026]
    │        ╰─ .
    │           ╰─ {format} [1010]
    ├─ {*namespace_id:53}
    │  ╰─ /
    │     ╰─ {project_id:53} [1803]
    │        ├─ /
    │        │  ├─ commit/
    │        │  │  ╰─ {id:47} [1804]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [1804]
    │        │  ╰─ tree/
    │        │     ├─ {*id}
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [1805]
    │        │     ╰─ {*id} [1805]
    │        ╰─ .
    │           ╰─ {format} [1803]
    ├─ {*id}
    │  ╰─ .
    │     ╰─ {format:18} [402]
    ├─ {*repository_path:8} [1814]
    ├─ {*unmatched_route} [295]
    ╰─ {*id} [402]
    === Method
    [2]
    ╰─ GET [1]

    [3]
    ╰─ GET [2]

    [5]
    ├─ GET [884]
    ╰─ POST [3]

    [6]
    ╰─ GET [1927]

    [13]
    ╰─ POST [4]

    [14]
    ╰─ POST [5]

    [15]
    ╰─ GET [6]

    [16]
    ╰─ POST [7]

    [17]
    ╰─ GET [8]

    [18]
    ╰─ GET [9]

    [19]
    ├─ DELETE [10]
    ├─ GET [13]
    ├─ PATCH [14]
    ╰─ PUT [15]

    [20]
    ╰─ GET [11]

    [21]
    ╰─ PUT [12]

    [25]
    ╰─ GET [16]

    [26]
    ├─ GET [18]
    ╰─ POST [17]

    [28]
    ├─ GET [19]
    ╰─ PATCH [19]

    [29]
    ├─ GET [20]
    ╰─ PATCH [20]

    [30]
    ├─ GET [21]
    ╰─ PATCH [21]

    [31]
    ╰─ PUT [22]

    [32]
    ├─ GET [23]
    ╰─ PATCH [23]

    [33]
    ├─ GET [24]
    ╰─ PATCH [24]

    [34]
    ╰─ GET [25]

    [35]
    ├─ GET [26]
    ╰─ PATCH [26]

    [36]
    ├─ GET [27]
    ╰─ PATCH [27]

    [37]
    ├─ GET [28]
    ╰─ PATCH [28]

    [38]
    ├─ GET [29]
    ╰─ PATCH [29]

    [39]
    ├─ GET [30]
    ╰─ PATCH [30]

    [40]
    ├─ GET [31]
    ╰─ PATCH [31]

    [41]
    ╰─ PUT [32]

    [42]
    ╰─ PUT [33]

    [43]
    ╰─ PUT [34]

    [44]
    ╰─ GET [35]

    [45]
    ├─ GET [36]
    ╰─ PATCH [36]

    [46]
    ╰─ GET [37]

    [47]
    ╰─ GET [38]

    [48]
    ├─ GET [39]
    ╰─ PATCH [39]

    [49]
    ├─ PATCH [40]
    ╰─ PUT [41]

    [51]
    ╰─ PUT [42]

    [52]
    ╰─ GET [43]

    [53]
    ├─ GET [50]
    ├─ PATCH [51]
    ├─ POST [44]
    ╰─ PUT [52]

    [54]
    ╰─ DELETE [45]

    [55]
    ╰─ DELETE [46]

    [56]
    ╰─ DELETE [47]

    [57]
    ╰─ GET [48]

    [58]
    ╰─ DELETE [49]

    [62]
    ╰─ GET [53]

    [63]
    ╰─ GET [54]

    [64]
    ╰─ GET [55]

    [65]
    ╰─ GET [56]

    [66]
    ╰─ POST [57]

    [67]
    ├─ GET [61]
    ╰─ POST [58]

    [68]
    ├─ DELETE [59]
    ├─ GET [65]
    ├─ PATCH [66]
    ╰─ PUT [67]

    [69]
    ╰─ GET [60]

    [71]
    ╰─ GET [62]

    [72]
    ╰─ PUT [63]

    [73]
    ╰─ POST [64]

    [77]
    ╰─ GET [68]

    [78]
    ╰─ GET [69]

    [79]
    ╰─ GET [70]

    [80]
    ╰─ GET [71]

    [81]
    ╰─ POST [72]

    [82]
    ╰─ POST [73]

    [83]
    ╰─ POST [74]

    [84]
    ╰─ GET [75]

    [85]
    ╰─ GET [76]

    [86]
    ├─ GET [80]
    ╰─ POST [77]

    [87]
    ├─ DELETE [78]
    ├─ PATCH [82]
    ╰─ PUT [83]

    [88]
    ╰─ GET [79]

    [90]
    ╰─ POST [81]

    [93]
    ├─ GET [84]
    ├─ PATCH [85]
    ╰─ PUT [86]

    [96]
    ╰─ DELETE [87]

    [97]
    ╰─ GET [88]

    [98]
    ╰─ GET [89]

    [99]
    ╰─ POST [90]

    [100]
    ├─ DELETE [91]
    ├─ GET [97]
    ├─ PATCH [98]
    ╰─ PUT [99]

    [101]
    ╰─ GET [92]

    [102]
    ╰─ GET [93]

    [103]
    ╰─ GET [94]

    [104]
    ╰─ GET [95]

    [105]
    ╰─ GET [96]

    [109]
    ╰─ POST [100]

    [110]
    ╰─ GET [101]

    [111]
    ╰─ DELETE [102]

    [112]
    ╰─ GET [103]

    [113]
    ╰─ PUT [104]

    [114]
    ╰─ PUT [105]

    [115]
    ╰─ GET [106]

    [116]
    ╰─ GET [107]

    [117]
    ├─ GET [111]
    ╰─ POST [108]

    [118]
    ├─ DELETE [109]
    ├─ PATCH [113]
    ╰─ PUT [114]

    [119]
    ╰─ GET [110]

    [121]
    ╰─ GET [112]

    [124]
    ╰─ GET [115]

    [125]
    ╰─ POST [116]

    [126]
    ╰─ POST [117]

    [127]
    ╰─ POST [118]

    [128]
    ╰─ POST [119]

    [129]
    ├─ GET [121]
    ╰─ POST [120]

    [131]
    ├─ GET [125]
    ╰─ POST [122]

    [132]
    ╰─ GET [123]

    [133]
    ╰─ GET [124]

    [135]
    ╰─ GET [126]

    [136]
    ╰─ GET [127]

    [137]
    ├─ PATCH [128]
    ╰─ PUT [129]

    [139]
    ╰─ GET [130]

    [140]
    ╰─ GET [131]

    [141]
    ╰─ GET [132]

    [142]
    ├─ GET [133]
    ├─ PATCH [134]
    ╰─ PUT [135]

    [145]
    ╰─ GET [136]

    [146]
    ╰─ GET [137]

    [147]
    ╰─ GET [138]

    [148]
    ╰─ GET [139]

    [149]
    ├─ GET [143]
    ╰─ POST [140]

    [150]
    ├─ DELETE [141]
    ├─ GET [147]
    ├─ PATCH [148]
    ╰─ PUT [149]

    [151]
    ╰─ GET [142]

    [153]
    ╰─ PUT [144]

    [154]
    ╰─ GET [145]

    [155]
    ╰─ POST [146]

    [159]
    ╰─ GET [150]

    [160]
    ╰─ POST [151]

    [161]
    ╰─ GET [152]

    [162]
    ├─ GET [156]
    ╰─ POST [153]

    [163]
    ├─ DELETE [154]
    ├─ PATCH [158]
    ╰─ PUT [159]

    [164]
    ╰─ GET [155]

    [166]
    ╰─ POST [157]

    [169]
    ├─ GET [163]
    ╰─ POST [160]

    [170]
    ├─ DELETE [161]
    ├─ PATCH [165]
    ╰─ PUT [166]

    [171]
    ╰─ GET [162]

    [173]
    ╰─ GET [164]

    [176]
    ├─ GET [168]
    ╰─ POST [167]

    [178]
    ╰─ PUT [169]

    [179]
    ╰─ DELETE [170]

    [180]
    ╰─ GET [171]

    [181]
    ├─ PATCH [172]
    ╰─ PUT [173]

    [183]
    ╰─ GET [174]

    [184]
    ╰─ GET [175]

    [185]
    ╰─ GET [176]

    [186]
    ╰─ POST [177]

    [187]
    ╰─ PUT [178]

    [188]
    ├─ PATCH [179]
    ╰─ PUT [180]

    [190]
    ╰─ POST [181]

    [191]
    ╰─ GET [182]

    [192]
    ├─ DELETE [183]
    ╰─ GET [184]

    [194]
    ├─ GET [188]
    ╰─ POST [185]

    [195]
    ├─ DELETE [186]
    ├─ GET [190]
    ├─ PATCH [191]
    ╰─ PUT [192]

    [196]
    ╰─ GET [187]

    [198]
    ╰─ GET [189]

    [202]
    ├─ DELETE [194]
    ├─ GET [196]
    ╰─ POST [193]

    [204]
    ╰─ GET [195]

    [206]
    ╰─ POST [197]

    [207]
    ╰─ GET [198]

    [208]
    ╰─ GET [199]

    [209]
    ╰─ GET [200]

    [210]
    ╰─ GET [201]

    [211]
    ╰─ POST [202]

    [212]
    ├─ DELETE [203]
    ├─ GET [207]
    ├─ PATCH [209]
    ╰─ PUT [210]

    [213]
    ╰─ GET [204]

    [214]
    ╰─ GET [205]

    [215]
    ╰─ POST [206]

    [217]
    ╰─ PUT [208]

    [220]
    ├─ GET [211]
    ├─ PATCH [212]
    ╰─ PUT [213]

    [223]
    ╰─ GET [214]

    [224]
    ╰─ POST [215]

    [225]
    ╰─ DELETE [216]

    [226]
    ╰─ GET [217]

    [227]
    ├─ DELETE [218]
    ├─ GET [226]
    ├─ PATCH [228]
    ╰─ PUT [229]

    [228]
    ╰─ GET [219]

    [229]
    ╰─ GET [220]

    [230]
    ╰─ GET [221]

    [231]
    ╰─ POST [222]

    [232]
    ╰─ GET [223]

    [233]
    ╰─ POST [224]

    [234]
    ╰─ GET [225]

    [236]
    ╰─ GET [227]

    [239]
    ╰─ POST [230]

    [240]
    ╰─ POST [231]

    [241]
    ╰─ GET [232]

    [242]
    ╰─ DELETE [233]

    [243]
    ╰─ GET [234]

    [244]
    ╰─ DELETE [235]

    [245]
    ╰─ GET [236]

    [246]
    ╰─ POST [237]

    [247]
    ╰─ GET [238]

    [248]
    ╰─ GET [239]

    [249]
    ├─ GET [243]
    ╰─ POST [240]

    [250]
    ├─ DELETE [241]
    ├─ PATCH [247]
    ╰─ PUT [248]

    [251]
    ╰─ GET [242]

    [253]
    ╰─ POST [244]

    [254]
    ╰─ GET [245]

    [255]
    ╰─ POST [246]

    [258]
    ╰─ DELETE [249]

    [259]
    ╰─ GET [250]

    [260]
    ╰─ GET [251]

    [261]
    ╰─ PUT [252]

    [262]
    ╰─ PUT [253]

    [263]
    ╰─ PUT [254]

    [264]
    ╰─ PUT [255]

    [265]
    ╰─ GET [256]

    [266]
    ╰─ PUT [257]

    [267]
    ├─ GET [266]
    ╰─ POST [258]

    [268]
    ╰─ PUT [259]

    [269]
    ├─ DELETE [260]
    ├─ GET [274]
    ├─ PATCH [280]
    ╰─ PUT [281]

    [270]
    ╰─ DELETE [261]

    [271]
    ╰─ PATCH [262]

    [272]
    ╰─ GET [263]

    [273]
    ╰─ POST [264]

    [274]
    ╰─ POST [265]

    [276]
    ╰─ GET [267]

    [277]
    ╰─ GET [268]

    [278]
    ╰─ GET [269]

    [279]
    ╰─ GET [270]

    [280]
    ╰─ DELETE [271]

    [281]
    ╰─ DELETE [272]

    [282]
    ╰─ POST [273]

    [284]
    ╰─ PUT [275]

    [285]
    ╰─ PUT [276]

    [286]
    ╰─ PUT [277]

    [287]
    ╰─ PUT [278]

    [288]
    ╰─ PUT [279]

    [291]
    ╰─ GET [282]

    [292]
    ╰─ GET [283]

    [293]
    ├─ DELETE [284]
    ├─ PATCH [287]
    ├─ POST [289]
    ╰─ PUT [291]

    [294]
    ├─ DELETE [285]
    ├─ PATCH [288]
    ├─ POST [290]
    ╰─ PUT [292]

    [295]
    ╰─ GET [286]

    [302]
    ╰─ GET [293]

    [303]
    ╰─ GET [294]

    [304]
    ╰─ GET [295]

    [305]
    ╰─ GET [296]

    [306]
    ╰─ GET [297]

    [307]
    ╰─ GET [298]

    [308]
    ╰─ GET [299]

    [309]
    ╰─ GET [300]

    [310]
    ╰─ GET [301]

    [311]
    ╰─ GET [302]

    [312]
    ╰─ GET [303]

    [313]
    ╰─ GET [304]

    [314]
    ╰─ GET [305]

    [315]
    ╰─ GET [306]

    [316]
    ╰─ POST [307]

    [317]
    ╰─ GET [308]

    [318]
    ╰─ GET [309]

    [319]
    ╰─ GET [310]

    [320]
    ╰─ GET [311]

    [321]
    ╰─ GET [312]

    [322]
    ╰─ GET [313]

    [323]
    ╰─ GET [314]

    [324]
    ├─ GET [319]
    ╰─ POST [315]

    [325]
    ├─ GET [320]
    ╰─ POST [316]

    [326]
    ╰─ GET [317]

    [327]
    ╰─ GET [318]

    [330]
    ╰─ GET [321]

    [331]
    ╰─ GET [322]

    [332]
    ╰─ POST [323]

    [333]
    ╰─ GET [324]

    [334]
    ╰─ GET [325]

    [335]
    ╰─ GET [326]

    [336]
    ╰─ GET [327]

    [337]
    ╰─ GET [328]

    [338]
    ╰─ GET [329]

    [339]
    ╰─ GET [330]

    [340]
    ╰─ GET [331]

    [341]
    ╰─ GET [332]

    [342]
    ╰─ GET [333]

    [343]
    ╰─ GET [334]

    [344]
    ╰─ GET [335]

    [345]
    ╰─ GET [336]

    [346]
    ╰─ GET [337]

    [347]
    ╰─ GET [338]

    [348]
    ╰─ GET [339]

    [349]
    ╰─ GET [340]

    [350]
    ╰─ GET [341]

    [351]
    ╰─ PATCH [342]

    [352]
    ╰─ DELETE [343]

    [353]
    ╰─ DELETE [344]

    [354]
    ╰─ GET [345]

    [355]
    ╰─ PATCH [346]

    [356]
    ╰─ GET [347]

    [357]
    ├─ GET [350]
    ╰─ POST [348]

    [358]
    ╰─ GET [349]

    [360]
    ├─ GET [351]
    ├─ OPTIONS [352]
    ╰─ POST [353]

    [363]
    ╰─ GET [354]

    [364]
    ╰─ GET [355]

    [365]
    ╰─ GET [356]

    [366]
    ╰─ GET [357]

    [367]
    ╰─ GET [358]

    [368]
    ╰─ GET [359]

    [369]
    ╰─ GET [360]

    [370]
    ╰─ GET [361]

    [371]
    ╰─ GET [362]

    [372]
    ╰─ GET [363]

    [373]
    ╰─ GET [364]

    [374]
    ╰─ GET [365]

    [375]
    ╰─ GET [366]

    [376]
    ╰─ GET [367]

    [377]
    ╰─ GET [368]

    [378]
    ╰─ POST [369]

    [379]
    ╰─ GET [370]

    [380]
    ╰─ GET [371]

    [381]
    ├─ PATCH [372]
    ╰─ PUT [373]

    [383]
    ╰─ POST [374]

    [384]
    ╰─ GET [375]

    [385]
    ╰─ GET [376]

    [386]
    ╰─ POST [377]

    [387]
    ╰─ GET [378]

    [388]
    ╰─ GET [379]

    [389]
    ╰─ GET [380]

    [390]
    ╰─ POST [381]

    [391]
    ╰─ POST [382]

    [392]
    ╰─ GET [383]

    [393]
    ╰─ POST [384]

    [394]
    ╰─ GET [385]

    [395]
    ╰─ POST [386]

    [396]
    ╰─ GET [387]

    [397]
    ├─ GET [388]
    ╰─ POST [388]

    [398]
    ├─ GET [389]
    ╰─ POST [389]

    [399]
    ├─ GET [390]
    ╰─ POST [390]

    [400]
    ╰─ GET [391]

    [401]
    ├─ GET [398]
    ╰─ POST [392]

    [402]
    ├─ DELETE [393]
    ├─ GET [409]
    ├─ PATCH [412]
    ╰─ PUT [413]

    [403]
    ╰─ GET [394]

    [404]
    ╰─ GET [395]

    [405]
    ╰─ GET [396]

    [406]
    ╰─ POST [397]

    [408]
    ╰─ GET [399]

    [409]
    ╰─ GET [400]

    [410]
    ╰─ GET [401]

    [411]
    ╰─ GET [402]

    [412]
    ╰─ POST [403]

    [413]
    ╰─ GET [404]

    [414]
    ╰─ POST [405]

    [415]
    ╰─ GET [406]

    [416]
    ╰─ GET [407]

    [417]
    ╰─ GET [408]

    [419]
    ╰─ PUT [410]

    [420]
    ╰─ GET [411]

    [423]
    ╰─ GET [414]

    [424]
    ╰─ GET [415]

    [425]
    ╰─ GET [416]

    [426]
    ╰─ GET [417]

    [427]
    ╰─ GET [418]

    [428]
    ╰─ GET [419]

    [429]
    ╰─ GET [420]

    [430]
    ╰─ GET [421]

    [431]
    ╰─ GET [422]

    [432]
    ╰─ GET [423]

    [433]
    ╰─ GET [424]

    [434]
    ╰─ GET [425]

    [435]
    ╰─ GET [426]

    [436]
    ╰─ GET [427]

    [437]
    ╰─ GET [428]

    [438]
    ╰─ GET [429]

    [439]
    ╰─ GET [430]

    [440]
    ╰─ GET [431]

    [441]
    ├─ GET [435]
    ╰─ POST [432]

    [442]
    ├─ DELETE [433]
    ├─ GET [437]
    ├─ PATCH [438]
    ╰─ PUT [439]

    [443]
    ╰─ GET [434]

    [445]
    ╰─ GET [436]

    [449]
    ╰─ GET [440]

    [450]
    ╰─ GET [441]

    [451]
    ╰─ GET [442]

    [452]
    ╰─ GET [443]

    [453]
    ╰─ GET [444]

    [454]
    ╰─ GET [445]

    [455]
    ╰─ GET [446]

    [456]
    ╰─ GET [447]

    [457]
    ╰─ GET [448]

    [458]
    ╰─ GET [449]

    [459]
    ╰─ GET [450]

    [460]
    ╰─ GET [451]

    [461]
    ╰─ GET [452]

    [462]
    ╰─ GET [453]

    [463]
    ╰─ GET [454]

    [464]
    ╰─ GET [455]

    [465]
    ╰─ GET [456]

    [466]
    ╰─ GET [457]

    [467]
    ╰─ DELETE [458]

    [468]
    ╰─ GET [459]

    [469]
    ╰─ POST [460]

    [470]
    ╰─ GET [461]

    [471]
    ╰─ GET [462]

    [472]
    ╰─ GET [463]

    [473]
    ╰─ DELETE [464]

    [474]
    ╰─ GET [465]

    [475]
    ╰─ GET [466]

    [476]
    ╰─ POST [467]

    [477]
    ├─ DELETE [468]
    ├─ GET [474]
    ├─ PATCH [475]
    ╰─ PUT [476]

    [478]
    ╰─ GET [469]

    [479]
    ╰─ GET [470]

    [480]
    ╰─ GET [471]

    [481]
    ╰─ GET [472]

    [482]
    ╰─ GET [473]

    [486]
    ╰─ POST [477]

    [487]
    ╰─ GET [478]

    [488]
    ╰─ GET [479]

    [489]
    ╰─ GET [480]

    [490]
    ╰─ GET [481]

    [491]
    ╰─ GET [482]

    [492]
    ╰─ GET [483]

    [493]
    ╰─ GET [484]

    [494]
    ╰─ GET [485]

    [495]
    ╰─ GET [486]

    [496]
    ╰─ GET [487]

    [497]
    ╰─ GET [488]

    [498]
    ╰─ GET [489]

    [499]
    ╰─ GET [490]

    [500]
    ╰─ GET [491]

    [501]
    ╰─ GET [492]

    [502]
    ├─ GET [493]
    ├─ PATCH [494]
    ╰─ PUT [495]

    [505]
    ╰─ GET [496]

    [506]
    ╰─ POST [497]

    [507]
    ╰─ POST [498]

    [508]
    ╰─ GET [499]

    [509]
    ╰─ GET [500]

    [510]
    ╰─ POST [501]

    [511]
    ╰─ POST [502]

    [512]
    ╰─ PUT [503]

    [513]
    ╰─ GET [504]

    [514]
    ├─ GET [506]
    ╰─ POST [505]

    [516]
    ╰─ GET [507]

    [517]
    ╰─ GET [508]

    [518]
    ├─ GET [511]
    ╰─ POST [509]

    [519]
    ├─ DELETE [510]
    ├─ PATCH [512]
    ╰─ PUT [513]

    [523]
    ╰─ POST [514]

    [524]
    ├─ GET [521]
    ╰─ POST [515]

    [525]
    ╰─ DELETE [516]

    [526]
    ╰─ GET [517]

    [527]
    ├─ DELETE [518]
    ├─ GET [524]
    ├─ PATCH [527]
    ╰─ PUT [528]

    [528]
    ╰─ GET [519]

    [529]
    ╰─ GET [520]

    [531]
    ╰─ GET [522]

    [532]
    ╰─ GET [523]

    [534]
    ╰─ POST [525]

    [535]
    ╰─ POST [526]

    [538]
    ├─ GET [531]
    ╰─ POST [529]

    [539]
    ├─ DELETE [530]
    ├─ PATCH [532]
    ╰─ PUT [533]

    [543]
    ├─ GET [536]
    ╰─ POST [534]

    [544]
    ├─ DELETE [535]
    ├─ PATCH [538]
    ╰─ PUT [539]

    [546]
    ╰─ POST [537]

    [549]
    ├─ GET [542]
    ╰─ POST [540]

    [550]
    ╰─ DELETE [541]

    [552]
    ├─ DELETE [543]
    ├─ PATCH [544]
    ╰─ PUT [545]

    [555]
    ╰─ POST [546]

    [556]
    ╰─ PUT [547]

    [557]
    ╰─ GET [548]

    [558]
    ├─ DELETE [549]
    ├─ PATCH [558]
    ╰─ PUT [559]

    [559]
    ╰─ GET [550]

    [560]
    ╰─ GET [551]

    [561]
    ╰─ DELETE [552]

    [562]
    ╰─ PATCH [553]

    [563]
    ├─ GET [554]
    ╰─ POST [555]

    [565]
    ╰─ POST [556]

    [566]
    ╰─ PUT [557]

    [569]
    ╰─ GET [560]

    [570]
    ╰─ GET [561]

    [571]
    ╰─ GET [562]

    [572]
    ╰─ GET [563]

    [573]
    ╰─ POST [564]

    [574]
    ╰─ GET [565]

    [575]
    ├─ GET [569]
    ╰─ POST [566]

    [576]
    ├─ DELETE [567]
    ├─ PATCH [571]
    ╰─ PUT [572]

    [577]
    ╰─ GET [568]

    [579]
    ╰─ POST [570]

    [582]
    ╰─ GET [573]

    [583]
    ╰─ GET [574]

    [584]
    ╰─ POST [575]

    [585]
    ╰─ GET [576]

    [586]
    ╰─ POST [577]

    [587]
    ╰─ GET [578]

    [588]
    ├─ DELETE [579]
    ├─ GET [582]
    ├─ PATCH [588]
    ╰─ PUT [590]

    [589]
    ├─ GET [580]
    ╰─ POST [589]

    [590]
    ╰─ GET [581]

    [592]
    ╰─ GET [583]

    [593]
    ╰─ GET [584]

    [594]
    ╰─ GET [585]

    [595]
    ╰─ GET [586]

    [596]
    ╰─ GET [587]

    [600]
    ╰─ GET [591]

    [601]
    ╰─ GET [592]

    [602]
    ╰─ GET [593]

    [603]
    ╰─ GET [594]

    [604]
    ├─ GET [598]
    ╰─ POST [595]

    [605]
    ├─ DELETE [596]
    ├─ PATCH [601]
    ╰─ PUT [602]

    [606]
    ╰─ GET [597]

    [608]
    ╰─ GET [599]

    [609]
    ╰─ POST [600]

    [612]
    ├─ GET [605]
    ╰─ POST [603]

    [613]
    ╰─ DELETE [604]

    [615]
    ╰─ PUT [606]

    [616]
    ╰─ POST [607]

    [617]
    ├─ GET [611]
    ╰─ POST [608]

    [618]
    ├─ DELETE [609]
    ├─ GET [617]
    ├─ PATCH [618]
    ╰─ PUT [619]

    [619]
    ╰─ GET [610]

    [621]
    ╰─ GET [612]

    [622]
    ╰─ GET [613]

    [623]
    ╰─ GET [614]

    [624]
    ╰─ GET [615]

    [625]
    ╰─ GET [616]

    [629]
    ├─ PATCH [620]
    ╰─ PUT [621]

    [631]
    ╰─ POST [622]

    [632]
    ╰─ GET [623]

    [633]
    ╰─ GET [624]

    [634]
    ╰─ POST [625]

    [635]
    ├─ DELETE [626]
    ├─ PATCH [627]
    ╰─ PUT [628]

    [638]
    ╰─ POST [629]

    [639]
    ├─ DELETE [630]
    ├─ PATCH [631]
    ╰─ PUT [632]

    [642]
    ├─ PATCH [633]
    ╰─ PUT [634]

    [644]
    ╰─ GET [635]

    [645]
    ╰─ GET [636]

    [646]
    ╰─ GET [637]

    [647]
    ╰─ GET [638]

    [648]
    ╰─ GET [639]

    [649]
    ╰─ GET [640]

    [650]
    ├─ DELETE [641]
    ├─ GET [648]
    ├─ PATCH [649]
    ╰─ PUT [650]

    [651]
    ╰─ GET [642]

    [652]
    ╰─ GET [643]

    [653]
    ╰─ GET [644]

    [654]
    ╰─ POST [645]

    [655]
    ╰─ GET [646]

    [656]
    ╰─ POST [647]

    [660]
    ├─ GET [653]
    ╰─ POST [651]

    [661]
    ╰─ DELETE [652]

    [663]
    ├─ GET [655]
    ├─ PATCH [656]
    ├─ POST [654]
    ╰─ PUT [657]

    [667]
    ╰─ PUT [658]

    [668]
    ╰─ POST [659]

    [669]
    ╰─ GET [660]

    [670]
    ╰─ GET [661]

    [671]
    ╰─ GET [662]

    [672]
    ╰─ GET [663]

    [673]
    ╰─ GET [664]

    [674]
    ╰─ GET [665]

    [675]
    ╰─ DELETE [666]

    [676]
    ╰─ GET [667]

    [677]
    ╰─ PUT [668]

    [678]
    ╰─ GET [669]

    [679]
    ╰─ GET [670]

    [680]
    ╰─ GET [671]

    [681]
    ╰─ GET [672]

    [682]
    ╰─ GET [673]

    [683]
    ╰─ GET [674]

    [684]
    ╰─ GET [675]

    [685]
    ╰─ GET [676]

    [686]
    ├─ DELETE [677]
    ├─ GET [680]
    ├─ PATCH [682]
    ╰─ PUT [684]

    [687]
    ├─ GET [678]
    ╰─ POST [683]

    [688]
    ╰─ GET [679]

    [690]
    ╰─ GET [681]

    [694]
    ├─ GET [686]
    ╰─ POST [685]

    [696]
    ╰─ PUT [687]

    [697]
    ├─ GET [688]
    ├─ PATCH [689]
    ╰─ PUT [690]

    [700]
    ├─ GET [694]
    ╰─ POST [691]

    [701]
    ├─ DELETE [692]
    ├─ GET [697]
    ├─ PATCH [698]
    ╰─ PUT [699]

    [702]
    ╰─ GET [693]

    [704]
    ╰─ GET [695]

    [705]
    ╰─ PUT [696]

    [709]
    ╰─ PUT [700]

    [710]
    ╰─ GET [701]

    [711]
    ├─ GET [702]
    ├─ PATCH [703]
    ╰─ PUT [704]

    [714]
    ╰─ PATCH [705]

    [715]
    ╰─ DELETE [706]

    [716]
    ├─ GET [709]
    ╰─ POST [707]

    [717]
    ├─ DELETE [708]
    ├─ GET [712]
    ├─ PATCH [713]
    ╰─ PUT [714]

    [719]
    ╰─ GET [710]

    [720]
    ╰─ POST [711]

    [724]
    ╰─ POST [715]

    [725]
    ╰─ GET [716]

    [726]
    ╰─ GET [717]

    [727]
    ╰─ GET [718]

    [728]
    ╰─ GET [719]

    [729]
    ╰─ GET [720]

    [730]
    ╰─ POST [721]

    [731]
    ╰─ PUT [722]

    [732]
    ├─ PATCH [723]
    ╰─ PUT [724]

    [734]
    ├─ PATCH [725]
    ╰─ PUT [726]

    [736]
    ╰─ GET [727]

    [737]
    ╰─ GET [728]

    [738]
    ╰─ GET [729]

    [739]
    ╰─ POST [730]

    [740]
    ╰─ POST [731]

    [741]
    ╰─ GET [732]

    [742]
    ╰─ GET [733]

    [743]
    ╰─ GET [734]

    [744]
    ╰─ GET [735]

    [745]
    ╰─ GET [736]

    [746]
    ╰─ DELETE [737]

    [747]
    ╰─ GET [738]

    [748]
    ╰─ GET [739]

    [749]
    ╰─ GET [740]

    [750]
    ├─ GET [741]
    ╰─ POST [742]

    [752]
    ╰─ DELETE [743]

    [753]
    ╰─ POST [744]

    [754]
    ╰─ DELETE [745]

    [755]
    ╰─ POST [746]

    [756]
    ╰─ POST [747]

    [757]
    ╰─ GET [748]

    [758]
    ╰─ GET [749]

    [759]
    ╰─ GET [750]

    [760]
    ╰─ GET [751]

    [761]
    ├─ GET [752]
    ├─ PATCH [753]
    ╰─ PUT [754]

    [764]
    ├─ GET [1801]
    ╰─ POST [755]

    [765]
    ├─ DELETE [756]
    ├─ GET [765]
    ╰─ PUT [767]

    [766]
    ╰─ GET [757]

    [767]
    ╰─ GET [758]

    [768]
    ╰─ GET [759]

    [769]
    ╰─ GET [760]

    [770]
    ╰─ GET [761]

    [771]
    ╰─ GET [762]

    [772]
    ╰─ POST [763]

    [773]
    ╰─ GET [764]

    [775]
    ╰─ GET [766]

    [777]
    ╰─ DELETE [768]

    [778]
    ╰─ GET [769]

    [779]
    ╰─ GET [770]

    [780]
    ╰─ GET [771]

    [781]
    ╰─ GET [772]

    [782]
    ╰─ GET [773]

    [783]
    ╰─ GET [774]

    [784]
    ╰─ GET [775]

    [785]
    ╰─ GET [776]

    [786]
    ╰─ GET [777]

    [787]
    ╰─ GET [778]

    [788]
    ╰─ GET [779]

    [789]
    ╰─ GET [780]

    [790]
    ╰─ GET [781]

    [791]
    ╰─ GET [782]

    [792]
    ╰─ GET [783]

    [793]
    ╰─ GET [784]

    [794]
    ╰─ GET [785]

    [795]
    ╰─ GET [786]

    [796]
    ╰─ GET [787]

    [797]
    ╰─ GET [788]

    [798]
    ╰─ GET [789]

    [799]
    ╰─ GET [790]

    [800]
    ╰─ GET [791]

    [801]
    ╰─ GET [792]

    [802]
    ╰─ GET [793]

    [803]
    ╰─ GET [794]

    [804]
    ╰─ GET [795]

    [805]
    ╰─ GET [796]

    [806]
    ╰─ GET [797]

    [807]
    ╰─ GET [798]

    [808]
    ╰─ POST [799]

    [809]
    ╰─ GET [800]

    [810]
    ╰─ GET [801]

    [811]
    ╰─ GET [802]

    [812]
    ╰─ POST [803]

    [813]
    ╰─ POST [804]

    [814]
    ╰─ GET [805]

    [815]
    ╰─ GET [806]

    [816]
    ╰─ GET [807]

    [817]
    ╰─ POST [808]

    [818]
    ╰─ POST [809]

    [819]
    ╰─ GET [810]

    [820]
    ╰─ GET [811]

    [821]
    ╰─ GET [812]

    [822]
    ╰─ GET [813]

    [823]
    ╰─ GET [814]

    [824]
    ╰─ POST [815]

    [825]
    ╰─ POST [816]

    [826]
    ├─ GET [819]
    ╰─ POST [817]

    [827]
    ╰─ GET [818]

    [829]
    ╰─ GET [820]

    [830]
    ╰─ GET [821]

    [831]
    ╰─ POST [822]

    [832]
    ╰─ GET [823]

    [833]
    ╰─ POST [824]

    [834]
    ╰─ GET [825]

    [835]
    ╰─ GET [826]

    [836]
    ╰─ GET [827]

    [837]
    ╰─ POST [828]

    [838]
    ╰─ POST [829]

    [839]
    ╰─ GET [830]

    [840]
    ╰─ POST [831]

    [841]
    ╰─ GET [832]

    [842]
    ╰─ GET [833]

    [843]
    ╰─ GET [834]

    [844]
    ╰─ POST [835]

    [845]
    ╰─ GET [836]

    [846]
    ╰─ GET [837]

    [847]
    ╰─ GET [838]

    [848]
    ╰─ POST [839]

    [849]
    ╰─ POST [840]

    [850]
    ╰─ POST [841]

    [851]
    ╰─ POST [842]

    [852]
    ╰─ GET [843]

    [853]
    ╰─ GET [844]

    [854]
    ╰─ POST [845]

    [855]
    ╰─ GET [846]

    [856]
    ╰─ GET [847]

    [857]
    ╰─ GET [848]

    [858]
    ╰─ POST [849]

    [859]
    ╰─ POST [850]

    [860]
    ╰─ POST [851]

    [861]
    ╰─ GET [852]

    [862]
    ╰─ POST [853]

    [863]
    ╰─ POST [854]

    [864]
    ├─ GET [855]
    ╰─ POST [855]

    [865]
    ╰─ GET [856]

    [866]
    ╰─ GET [857]

    [867]
    ╰─ GET [858]

    [868]
    ╰─ GET [859]

    [869]
    ╰─ POST [860]

    [870]
    ╰─ POST [861]

    [871]
    ├─ GET [862]
    ╰─ PUT [863]

    [873]
    ├─ GET [864]
    ╰─ OPTIONS [865]

    [875]
    ╰─ GET [866]

    [876]
    ╰─ GET [867]

    [877]
    ╰─ POST [868]

    [878]
    ╰─ GET [869]

    [879]
    ├─ GET [873]
    ├─ OPTIONS [874]
    ╰─ POST [870]

    [880]
    ├─ DELETE [872]
    ╰─ OPTIONS [871]

    [884]
    ╰─ GET [875]

    [885]
    ╰─ GET [876]

    [886]
    ├─ GET [877]
    ╰─ OPTIONS [878]

    [888]
    ╰─ GET [879]

    [889]
    ├─ GET [880]
    ╰─ OPTIONS [881]

    [891]
    ├─ GET [882]
    ╰─ OPTIONS [883]

    [894]
    ╰─ GET [885]

    [895]
    ╰─ POST [886]

    [896]
    ╰─ POST [887]

    [897]
    ╰─ GET [888]

    [898]
    ╰─ GET [889]

    [899]
    ╰─ GET [890]

    [900]
    ╰─ GET [891]

    [901]
    ╰─ GET [892]

    [902]
    ╰─ GET [893]

    [903]
    ╰─ GET [894]

    [904]
    ╰─ GET [895]

    [905]
    ╰─ GET [896]

    [906]
    ╰─ GET [897]

    [907]
    ╰─ GET [898]

    [908]
    ╰─ POST [899]

    [909]
    ╰─ POST [900]

    [910]
    ╰─ GET [901]

    [911]
    ╰─ GET [902]

    [912]
    ├─ GET [907]
    ╰─ POST [903]

    [913]
    ├─ DELETE [904]
    ├─ GET [910]
    ├─ PATCH [911]
    ╰─ PUT [912]

    [914]
    ╰─ GET [905]

    [915]
    ╰─ GET [906]

    [917]
    ╰─ GET [908]

    [918]
    ╰─ PUT [909]

    [922]
    ├─ DELETE [914]
    ├─ GET [915]
    ╰─ POST [913]

    [925]
    ╰─ GET [916]

    [926]
    ╰─ DELETE [917]

    [927]
    ╰─ GET [918]

    [928]
    ├─ GET [921]
    ╰─ POST [919]

    [929]
    ╰─ POST [920]

    [931]
    ╰─ POST [922]

    [932]
    ╰─ GET [923]

    [933]
    ╰─ GET [924]

    [934]
    ╰─ GET [925]

    [935]
    ╰─ GET [926]

    [936]
    ├─ OPTIONS [927]
    ╰─ POST [928]

    [938]
    ╰─ POST [929]

    [939]
    ├─ OPTIONS [930]
    ╰─ POST [931]

    [941]
    ╰─ GET [932]

    [942]
    ├─ DELETE [935]
    ├─ GET [938]
    ╰─ POST [933]

    [943]
    ├─ DELETE [936]
    ├─ GET [937]
    ╰─ POST [934]

    [948]
    ├─ DELETE [940]
    ╰─ POST [939]

    [950]
    ╰─ GET [941]

    [951]
    ╰─ GET [942]

    [952]
    ╰─ GET [943]

    [953]
    ╰─ GET [944]

    [954]
    ╰─ GET [945]

    [955]
    ╰─ GET [946]

    [956]
    ╰─ POST [947]

    [957]
    ╰─ GET [948]

    [958]
    ╰─ GET [949]

    [959]
    ╰─ GET [950]

    [960]
    ╰─ GET [951]

    [961]
    ╰─ POST [952]

    [962]
    ├─ PATCH [956]
    ├─ POST [953]
    ╰─ PUT [957]

    [963]
    ╰─ GET [954]

    [964]
    ╰─ GET [955]

    [967]
    ╰─ GET [958]

    [968]
    ╰─ POST [959]

    [969]
    ╰─ PUT [960]

    [970]
    ╰─ PUT [961]

    [971]
    ╰─ PUT [962]

    [972]
    ╰─ PUT [963]

    [973]
    ╰─ GET [964]

    [974]
    ╰─ DELETE [965]

    [975]
    ╰─ DELETE [966]

    [976]
    ╰─ GET [967]

    [977]
    ├─ GET [971]
    ╰─ POST [968]

    [978]
    ╰─ DELETE [969]

    [979]
    ╰─ DELETE [970]

    [981]
    ╰─ GET [972]

    [982]
    ╰─ GET [973]

    [983]
    ╰─ GET [974]

    [984]
    ├─ GET [977]
    ╰─ POST [975]

    [985]
    ╰─ DELETE [976]

    [987]
    ╰─ PUT [978]

    [988]
    ├─ PATCH [979]
    ╰─ PUT [980]

    [990]
    ├─ GET [981]
    ├─ PATCH [982]
    ╰─ PUT [983]

    [993]
    ├─ GET [984]
    ├─ PATCH [985]
    ╰─ PUT [986]

    [996]
    ╰─ GET [987]

    [997]
    ╰─ GET [988]

    [998]
    ╰─ POST [989]

    [999]
    ├─ DELETE [992]
    ├─ GET [995]
    ╰─ POST [990]

    [1000]
    ╰─ POST [991]

    [1002]
    ╰─ DELETE [993]

    [1003]
    ╰─ DELETE [994]

    [1005]
    ╰─ PATCH [996]

    [1006]
    ╰─ GET [997]

    [1007]
    ╰─ GET [998]

    [1008]
    ╰─ POST [999]

    [1009]
    ├─ GET [1007]
    ╰─ POST [1000]

    [1010]
    ├─ DELETE [1001]
    ├─ GET [1015]
    ├─ PATCH [1020]
    ╰─ PUT [1021]

    [1011]
    ╰─ GET [1002]

    [1012]
    ╰─ GET [1003]

    [1013]
    ╰─ POST [1004]

    [1014]
    ╰─ POST [1005]

    [1015]
    ╰─ POST [1006]

    [1017]
    ╰─ GET [1008]

    [1018]
    ╰─ PUT [1009]

    [1019]
    ╰─ POST [1010]

    [1020]
    ╰─ GET [1011]

    [1021]
    ╰─ POST [1012]

    [1022]
    ╰─ DELETE [1013]

    [1023]
    ╰─ POST [1014]

    [1025]
    ╰─ POST [1016]

    [1026]
    ╰─ PUT [1017]

    [1027]
    ╰─ POST [1018]

    [1028]
    ╰─ GET [1019]

    [1031]
    ╰─ GET [1022]

    [1032]
    ╰─ GET [1023]

    [1033]
    ╰─ GET [1024]

    [1034]
    ╰─ POST [1025]

    [1035]
    ╰─ POST [1026]

    [1036]
    ╰─ POST [1027]

    [1037]
    ╰─ GET [1028]

    [1038]
    ╰─ GET [1029]

    [1039]
    ╰─ GET [1030]

    [1040]
    ╰─ GET [1031]

    [1041]
    ╰─ GET [1032]

    [1042]
    ╰─ GET [1033]

    [1043]
    ╰─ GET [1034]

    [1044]
    ╰─ GET [1035]

    [1045]
    ╰─ GET [1036]

    [1046]
    ╰─ GET [1037]

    [1047]
    ╰─ GET [1038]

    [1048]
    ├─ GET [1042]
    ╰─ POST [1039]

    [1049]
    ├─ DELETE [1040]
    ├─ GET [1044]
    ├─ PATCH [1045]
    ╰─ PUT [1046]

    [1050]
    ╰─ GET [1041]

    [1052]
    ╰─ GET [1043]

    [1056]
    ╰─ GET [1047]

    [1057]
    ╰─ GET [1048]

    [1058]
    ╰─ GET [1049]

    [1059]
    ╰─ DELETE [1050]

    [1060]
    ╰─ DELETE [1051]

    [1061]
    ╰─ DELETE [1052]

    [1062]
    ╰─ DELETE [1053]

    [1063]
    ╰─ DELETE [1054]

    [1064]
    ╰─ GET [1055]

    [1065]
    ╰─ DELETE [1056]

    [1066]
    ╰─ GET [1057]

    [1067]
    ╰─ GET [1058]

    [1068]
    ╰─ GET [1059]

    [1069]
    ╰─ GET [1060]

    [1070]
    ╰─ POST [1061]

    [1071]
    ╰─ GET [1062]

    [1072]
    ╰─ GET [1063]

    [1073]
    ╰─ GET [1064]

    [1074]
    ╰─ GET [1065]

    [1075]
    ╰─ GET [1066]

    [1076]
    ╰─ GET [1067]

    [1077]
    ╰─ GET [1068]

    [1078]
    ╰─ GET [1069]

    [1079]
    ╰─ GET [1070]

    [1080]
    ╰─ GET [1071]

    [1081]
    ╰─ GET [1072]

    [1082]
    ╰─ GET [1073]

    [1083]
    ╰─ GET [1074]

    [1084]
    ╰─ GET [1075]

    [1085]
    ╰─ GET [1076]

    [1086]
    ╰─ GET [1077]

    [1087]
    ├─ DELETE [1078]
    ╰─ GET [1079]

    [1089]
    ╰─ GET [1080]

    [1090]
    ╰─ GET [1081]

    [1091]
    ╰─ GET [1082]

    [1092]
    ╰─ GET [1083]

    [1093]
    ╰─ GET [1084]

    [1094]
    ╰─ GET [1085]

    [1095]
    ╰─ GET [1086]

    [1096]
    ╰─ GET [1087]

    [1097]
    ╰─ GET [1088]

    [1098]
    ├─ DELETE [1091]
    ├─ GET [1096]
    ├─ POST [1089]
    ╰─ PUT [1098]

    [1099]
    ╰─ POST [1090]

    [1101]
    ╰─ GET [1092]

    [1102]
    ╰─ GET [1093]

    [1103]
    ╰─ GET [1094]

    [1104]
    ╰─ POST [1095]

    [1106]
    ╰─ GET [1097]

    [1108]
    ╰─ PUT [1099]

    [1109]
    ╰─ GET [1100]

    [1110]
    ╰─ GET [1101]

    [1111]
    ├─ GET [1106]
    ╰─ POST [1102]

    [1112]
    ╰─ DELETE [1103]

    [1113]
    ╰─ DELETE [1104]

    [1114]
    ╰─ GET [1105]

    [1116]
    ╰─ GET [1107]

    [1117]
    ╰─ GET [1108]

    [1118]
    ╰─ GET [1109]

    [1119]
    ╰─ GET [1110]

    [1120]
    ╰─ GET [1111]

    [1121]
    ╰─ GET [1112]

    [1122]
    ╰─ GET [1113]

    [1123]
    ╰─ GET [1114]

    [1124]
    ╰─ GET [1115]

    [1125]
    ╰─ GET [1116]

    [1126]
    ╰─ GET [1117]

    [1127]
    ├─ GET [1119]
    ╰─ POST [1118]

    [1129]
    ╰─ GET [1120]

    [1130]
    ╰─ POST [1121]

    [1131]
    ╰─ GET [1122]

    [1132]
    ╰─ DELETE [1123]

    [1133]
    ╰─ GET [1124]

    [1134]
    ╰─ GET [1125]

    [1135]
    ╰─ POST [1126]

    [1136]
    ├─ DELETE [1127]
    ├─ GET [1133]
    ├─ PATCH [1134]
    ╰─ PUT [1135]

    [1137]
    ╰─ GET [1128]

    [1138]
    ╰─ GET [1129]

    [1139]
    ╰─ GET [1130]

    [1140]
    ╰─ GET [1131]

    [1141]
    ╰─ GET [1132]

    [1145]
    ╰─ POST [1136]

    [1146]
    ╰─ GET [1137]

    [1147]
    ╰─ GET [1138]

    [1148]
    ╰─ GET [1139]

    [1149]
    ╰─ POST [1140]

    [1150]
    ╰─ GET [1141]

    [1151]
    ╰─ GET [1142]

    [1152]
    ╰─ GET [1143]

    [1153]
    ╰─ GET [1144]

    [1154]
    ╰─ POST [1145]

    [1155]
    ╰─ GET [1146]

    [1156]
    ╰─ GET [1147]

    [1157]
    ╰─ GET [1148]

    [1158]
    ╰─ GET [1149]

    [1159]
    ╰─ GET [1150]

    [1160]
    ├─ GET [1153]
    ╰─ POST [1151]

    [1161]
    ╰─ GET [1152]

    [1163]
    ╰─ GET [1154]

    [1164]
    ╰─ GET [1155]

    [1165]
    ╰─ GET [1156]

    [1166]
    ╰─ GET [1157]

    [1167]
    ╰─ GET [1158]

    [1168]
    ╰─ GET [1159]

    [1169]
    ╰─ GET [1160]

    [1170]
    ╰─ GET [1161]

    [1171]
    ╰─ GET [1162]

    [1172]
    ╰─ GET [1163]

    [1173]
    ╰─ GET [1164]

    [1174]
    ╰─ GET [1165]

    [1175]
    ╰─ GET [1166]

    [1176]
    ╰─ GET [1167]

    [1177]
    ╰─ GET [1168]

    [1178]
    ╰─ GET [1169]

    [1179]
    ╰─ GET [1170]

    [1180]
    ╰─ GET [1171]

    [1181]
    ╰─ GET [1172]

    [1182]
    ├─ GET [1178]
    ╰─ POST [1173]

    [1183]
    ╰─ PUT [1174]

    [1184]
    ╰─ GET [1175]

    [1185]
    ╰─ PUT [1176]

    [1186]
    ╰─ GET [1177]

    [1188]
    ╰─ GET [1179]

    [1189]
    ├─ PATCH [1180]
    ╰─ PUT [1181]

    [1191]
    ╰─ PUT [1182]

    [1192]
    ╰─ GET [1183]

    [1193]
    ╰─ GET [1184]

    [1194]
    ╰─ GET [1185]

    [1195]
    ╰─ GET [1186]

    [1196]
    ╰─ GET [1187]

    [1197]
    ╰─ GET [1188]

    [1198]
    ├─ DELETE [1191]
    ╰─ POST [1189]

    [1199]
    ╰─ GET [1190]

    [1201]
    ╰─ POST [1192]

    [1202]
    ├─ GET [1196]
    ╰─ POST [1193]

    [1203]
    ╰─ GET [1194]

    [1204]
    ╰─ GET [1195]

    [1206]
    ╰─ GET [1197]

    [1207]
    ╰─ GET [1198]

    [1208]
    ╰─ GET [1199]

    [1209]
    ├─ GET [1200]
    ├─ PATCH [1204]
    ╰─ PUT [1205]

    [1210]
    ╰─ POST [1201]

    [1211]
    ╰─ GET [1202]

    [1212]
    ╰─ GET [1203]

    [1215]
    ╰─ GET [1206]

    [1216]
    ╰─ GET [1207]

    [1217]
    ╰─ GET [1208]

    [1218]
    ╰─ PUT [1209]

    [1219]
    ╰─ GET [1210]

    [1220]
    ╰─ GET [1211]

    [1221]
    ├─ GET [1214]
    ╰─ POST [1212]

    [1222]
    ╰─ DELETE [1213]

    [1224]
    ├─ GET [1218]
    ╰─ POST [1215]

    [1225]
    ├─ DELETE [1216]
    ├─ GET [1220]
    ├─ PATCH [1221]
    ╰─ PUT [1222]

    [1226]
    ╰─ GET [1217]

    [1228]
    ╰─ GET [1219]

    [1232]
    ╰─ POST [1223]

    [1233]
    ╰─ GET [1224]

    [1234]
    ╰─ GET [1225]

    [1235]
    ╰─ GET [1226]

    [1236]
    ╰─ GET [1227]

    [1237]
    ╰─ GET [1228]

    [1238]
    ╰─ GET [1229]

    [1239]
    ├─ GET [1231]
    ╰─ POST [1230]

    [1241]
    ╰─ GET [1232]

    [1242]
    ╰─ GET [1233]

    [1243]
    ╰─ GET [1234]

    [1244]
    ╰─ GET [1235]

    [1245]
    ├─ GET [1237]
    ╰─ POST [1236]

    [1247]
    ╰─ GET [1238]

    [1248]
    ╰─ GET [1239]

    [1249]
    ╰─ GET [1240]

    [1250]
    ╰─ GET [1241]

    [1251]
    ├─ GET [1243]
    ╰─ POST [1242]

    [1253]
    ╰─ POST [1244]

    [1254]
    ├─ GET [1246]
    ╰─ POST [1245]

    [1256]
    ╰─ GET [1247]

    [1257]
    ╰─ GET [1248]

    [1258]
    ╰─ GET [1249]

    [1259]
    ╰─ GET [1250]

    [1260]
    ╰─ GET [1251]

    [1261]
    ├─ DELETE [1252]
    ├─ PATCH [1253]
    ╰─ PUT [1254]

    [1264]
    ╰─ GET [1255]

    [1265]
    ╰─ GET [1256]

    [1266]
    ╰─ GET [1257]

    [1267]
    ╰─ GET [1258]

    [1268]
    ╰─ POST [1259]

    [1269]
    ╰─ GET [1260]

    [1270]
    ├─ GET [1264]
    ╰─ POST [1261]

    [1271]
    ├─ DELETE [1262]
    ├─ PATCH [1266]
    ╰─ PUT [1267]

    [1272]
    ╰─ GET [1263]

    [1274]
    ╰─ POST [1265]

    [1277]
    ╰─ GET [1268]

    [1278]
    ├─ GET [1271]
    ╰─ POST [1269]

    [1279]
    ╰─ GET [1270]

    [1281]
    ╰─ GET [1272]

    [1282]
    ╰─ GET [1273]

    [1283]
    ╰─ POST [1274]

    [1284]
    ╰─ POST [1275]

    [1285]
    ╰─ GET [1276]

    [1286]
    ╰─ GET [1277]

    [1287]
    ╰─ POST [1278]

    [1288]
    ╰─ GET [1279]

    [1289]
    ╰─ GET [1280]

    [1290]
    ╰─ GET [1281]

    [1291]
    ╰─ POST [1282]

    [1292]
    ╰─ GET [1283]

    [1293]
    ╰─ GET [1284]

    [1294]
    ╰─ GET [1285]

    [1295]
    ╰─ GET [1286]

    [1296]
    ╰─ GET [1287]

    [1297]
    ├─ GET [1290]
    ╰─ POST [1288]

    [1298]
    ╰─ DELETE [1289]

    [1300]
    ╰─ POST [1291]

    [1301]
    ╰─ GET [1292]

    [1302]
    ╰─ GET [1293]

    [1303]
    ├─ GET [1304]
    ╰─ POST [1294]

    [1304]
    ╰─ POST [1295]

    [1305]
    ╰─ DELETE [1296]

    [1306]
    ╰─ GET [1297]

    [1307]
    ╰─ GET [1298]

    [1308]
    ├─ DELETE [1299]
    ├─ GET [1312]
    ├─ PATCH [1316]
    ╰─ PUT [1317]

    [1309]
    ╰─ GET [1300]

    [1310]
    ╰─ GET [1301]

    [1311]
    ╰─ POST [1302]

    [1312]
    ╰─ POST [1303]

    [1314]
    ╰─ POST [1305]

    [1315]
    ╰─ POST [1306]

    [1316]
    ╰─ GET [1307]

    [1317]
    ╰─ GET [1308]

    [1318]
    ╰─ GET [1309]

    [1319]
    ╰─ PUT [1310]

    [1320]
    ╰─ GET [1311]

    [1322]
    ╰─ GET [1313]

    [1323]
    ╰─ POST [1314]

    [1324]
    ╰─ POST [1315]

    [1327]
    ├─ DELETE [1318]
    ├─ GET [1321]
    ├─ PATCH [1325]
    ╰─ PUT [1327]

    [1328]
    ├─ GET [1319]
    ╰─ POST [1326]

    [1329]
    ╰─ GET [1320]

    [1331]
    ╰─ GET [1322]

    [1332]
    ╰─ GET [1323]

    [1333]
    ╰─ GET [1324]

    [1337]
    ╰─ GET [1328]

    [1338]
    ╰─ GET [1329]

    [1339]
    ╰─ POST [1330]

    [1340]
    ╰─ POST [1331]

    [1341]
    ╰─ GET [1332]

    [1342]
    ╰─ POST [1333]

    [1343]
    ╰─ GET [1334]

    [1344]
    ╰─ GET [1335]

    [1345]
    ╰─ GET [1336]

    [1346]
    ╰─ POST [1337]

    [1347]
    ╰─ GET [1338]

    [1348]
    ╰─ GET [1339]

    [1349]
    ╰─ GET [1340]

    [1350]
    ╰─ GET [1341]

    [1351]
    ╰─ GET [1342]

    [1352]
    ╰─ GET [1343]

    [1353]
    ╰─ POST [1344]

    [1354]
    ╰─ GET [1345]

    [1355]
    ├─ GET [1350]
    ╰─ POST [1346]

    [1356]
    ├─ DELETE [1347]
    ├─ PATCH [1356]
    ╰─ PUT [1357]

    [1357]
    ╰─ GET [1348]

    [1358]
    ╰─ POST [1349]

    [1360]
    ╰─ GET [1351]

    [1361]
    ╰─ POST [1352]

    [1362]
    ╰─ DELETE [1353]

    [1363]
    ╰─ POST [1354]

    [1364]
    ╰─ POST [1355]

    [1367]
    ╰─ GET [1358]

    [1368]
    ╰─ GET [1359]

    [1369]
    ╰─ GET [1360]

    [1370]
    ╰─ POST [1361]

    [1371]
    ╰─ GET [1362]

    [1372]
    ╰─ GET [1363]

    [1373]
    ╰─ GET [1364]

    [1374]
    ╰─ POST [1365]

    [1375]
    ╰─ POST [1366]

    [1376]
    ╰─ POST [1367]

    [1377]
    ╰─ GET [1368]

    [1378]
    ╰─ GET [1369]

    [1379]
    ╰─ GET [1370]

    [1380]
    ╰─ GET [1371]

    [1381]
    ╰─ GET [1372]

    [1382]
    ╰─ GET [1373]

    [1383]
    ╰─ GET [1374]

    [1384]
    ╰─ GET [1375]

    [1385]
    ╰─ GET [1376]

    [1386]
    ╰─ GET [1377]

    [1387]
    ╰─ DELETE [1378]

    [1388]
    ╰─ GET [1379]

    [1389]
    ╰─ GET [1380]

    [1390]
    ├─ DELETE [1381]
    ├─ GET [1401]
    ├─ PATCH [1408]
    ╰─ PUT [1409]

    [1391]
    ╰─ GET [1382]

    [1392]
    ╰─ GET [1383]

    [1393]
    ╰─ GET [1384]

    [1394]
    ╰─ GET [1385]

    [1395]
    ╰─ POST [1386]

    [1396]
    ╰─ GET [1387]

    [1397]
    ├─ GET [1388]
    ╰─ POST [1417]

    [1398]
    ╰─ GET [1389]

    [1399]
    ╰─ GET [1390]

    [1400]
    ╰─ POST [1391]

    [1401]
    ╰─ GET [1392]

    [1402]
    ╰─ GET [1393]

    [1403]
    ╰─ GET [1394]

    [1404]
    ╰─ POST [1395]

    [1405]
    ╰─ POST [1396]

    [1406]
    ╰─ GET [1397]

    [1407]
    ╰─ GET [1398]

    [1408]
    ╰─ GET [1399]

    [1409]
    ╰─ GET [1400]

    [1411]
    ╰─ GET [1402]

    [1412]
    ╰─ GET [1403]

    [1413]
    ╰─ GET [1404]

    [1414]
    ╰─ GET [1405]

    [1415]
    ╰─ POST [1406]

    [1416]
    ╰─ POST [1407]

    [1419]
    ╰─ GET [1410]

    [1420]
    ╰─ POST [1411]

    [1421]
    ╰─ GET [1412]

    [1422]
    ╰─ GET [1413]

    [1423]
    ╰─ GET [1414]

    [1424]
    ╰─ GET [1415]

    [1425]
    ╰─ GET [1416]

    [1427]
    ╰─ GET [1418]

    [1428]
    ╰─ GET [1419]

    [1429]
    ╰─ GET [1420]

    [1430]
    ╰─ GET [1421]

    [1431]
    ╰─ GET [1422]

    [1432]
    ╰─ GET [1423]

    [1433]
    ╰─ GET [1424]

    [1434]
    ╰─ GET [1425]

    [1435]
    ╰─ GET [1426]

    [1436]
    ╰─ GET [1427]

    [1437]
    ╰─ GET [1428]

    [1438]
    ╰─ GET [1429]

    [1439]
    ╰─ GET [1430]

    [1440]
    ╰─ GET [1431]

    [1441]
    ├─ GET [1435]
    ╰─ POST [1432]

    [1442]
    ├─ DELETE [1433]
    ├─ PATCH [1437]
    ╰─ PUT [1438]

    [1443]
    ╰─ DELETE [1434]

    [1445]
    ╰─ POST [1436]

    [1448]
    ╰─ GET [1439]

    [1449]
    ╰─ GET [1440]

    [1450]
    ╰─ GET [1441]

    [1451]
    ╰─ GET [1442]

    [1452]
    ├─ GET [1446]
    ╰─ POST [1443]

    [1453]
    ├─ DELETE [1444]
    ├─ GET [1453]
    ├─ PATCH [1454]
    ╰─ PUT [1455]

    [1454]
    ╰─ GET [1445]

    [1456]
    ╰─ GET [1447]

    [1457]
    ╰─ GET [1448]

    [1458]
    ╰─ GET [1449]

    [1459]
    ╰─ GET [1450]

    [1460]
    ╰─ GET [1451]

    [1461]
    ╰─ POST [1452]

    [1465]
    ├─ GET [1456]
    ├─ PATCH [1458]
    ╰─ PUT [1459]

    [1466]
    ╰─ GET [1457]

    [1469]
    ╰─ POST [1460]

    [1470]
    ╰─ POST [1461]

    [1471]
    ├─ DELETE [1462]
    ├─ GET [1465]
    ├─ PATCH [1467]
    ╰─ PUT [1469]

    [1472]
    ├─ GET [1463]
    ╰─ POST [1468]

    [1473]
    ╰─ GET [1464]

    [1475]
    ╰─ GET [1466]

    [1479]
    ├─ DELETE [1470]
    ╰─ GET [1471]

    [1481]
    ├─ DELETE [1472]
    ╰─ GET [1474]

    [1482]
    ╰─ GET [1473]

    [1484]
    ╰─ GET [1475]

    [1485]
    ╰─ GET [1476]

    [1486]
    ╰─ GET [1477]

    [1487]
    ├─ DELETE [1478]
    ╰─ GET [1482]

    [1488]
    ╰─ GET [1479]

    [1489]
    ╰─ GET [1480]

    [1490]
    ╰─ GET [1481]

    [1492]
    ╰─ GET [1483]

    [1493]
    ╰─ POST [1484]

    [1494]
    ╰─ DELETE [1485]

    [1495]
    ├─ DELETE [1486]
    ├─ PATCH [1492]
    ╰─ PUT [1493]

    [1496]
    ╰─ GET [1487]

    [1497]
    ╰─ GET [1488]

    [1498]
    ├─ DELETE [1491]
    ╰─ POST [1489]

    [1499]
    ╰─ POST [1490]

    [1503]
    ╰─ GET [1494]

    [1504]
    ╰─ GET [1495]

    [1505]
    ╰─ GET [1496]

    [1506]
    ╰─ GET [1497]

    [1507]
    ╰─ GET [1498]

    [1508]
    ╰─ GET [1499]

    [1509]
    ├─ DELETE [1500]
    ╰─ GET [1502]

    [1510]
    ╰─ GET [1501]

    [1512]
    ├─ DELETE [1503]
    ├─ GET [1505]
    ├─ PATCH [1506]
    ╰─ PUT [1507]

    [1513]
    ╰─ GET [1504]

    [1517]
    ╰─ DELETE [1508]

    [1518]
    ╰─ POST [1509]

    [1519]
    ├─ DELETE [1510]
    ├─ GET [1514]
    ├─ PATCH [1515]
    ╰─ PUT [1516]

    [1520]
    ╰─ GET [1511]

    [1521]
    ╰─ GET [1512]

    [1522]
    ╰─ POST [1513]

    [1526]
    ╰─ POST [1517]

    [1527]
    ╰─ DELETE [1518]

    [1528]
    ╰─ GET [1519]

    [1529]
    ╰─ POST [1520]

    [1530]
    ├─ GET [1524]
    ╰─ POST [1521]

    [1531]
    ├─ DELETE [1522]
    ├─ PATCH [1528]
    ╰─ PUT [1529]

    [1532]
    ╰─ GET [1523]

    [1534]
    ╰─ GET [1525]

    [1535]
    ╰─ POST [1526]

    [1536]
    ╰─ POST [1527]

    [1539]
    ╰─ GET [1530]

    [1540]
    ╰─ POST [1531]

    [1541]
    ╰─ GET [1532]

    [1542]
    ╰─ GET [1533]

    [1543]
    ├─ GET [1538]
    ╰─ POST [1534]

    [1544]
    ├─ DELETE [1535]
    ╰─ GET [1546]

    [1545]
    ╰─ GET [1536]

    [1546]
    ╰─ GET [1537]

    [1548]
    ╰─ GET [1539]

    [1549]
    ╰─ GET [1540]

    [1550]
    ╰─ GET [1541]

    [1551]
    ╰─ GET [1542]

    [1552]
    ╰─ POST [1543]

    [1553]
    ╰─ GET [1544]

    [1554]
    ╰─ GET [1545]

    [1556]
    ╰─ GET [1547]

    [1557]
    ╰─ GET [1548]

    [1558]
    ╰─ GET [1549]

    [1559]
    ╰─ POST [1550]

    [1560]
    ╰─ GET [1551]

    [1561]
    ╰─ GET [1552]

    [1562]
    ├─ GET [1553]
    ├─ PATCH [1554]
    ╰─ PUT [1555]

    [1565]
    ╰─ POST [1556]

    [1566]
    ├─ DELETE [1557]
    ├─ PATCH [1563]
    ╰─ PUT [1564]

    [1567]
    ╰─ GET [1558]

    [1568]
    ╰─ DELETE [1559]

    [1569]
    ├─ GET [1560]
    ╰─ POST [1561]

    [1571]
    ╰─ POST [1562]

    [1574]
    ╰─ GET [1565]

    [1575]
    ├─ GET [1569]
    ╰─ POST [1566]

    [1576]
    ├─ DELETE [1567]
    ├─ PATCH [1571]
    ╰─ PUT [1572]

    [1577]
    ╰─ GET [1568]

    [1579]
    ╰─ GET [1570]

    [1582]
    ╰─ POST [1573]

    [1583]
    ├─ GET [1576]
    ╰─ POST [1574]

    [1584]
    ├─ DELETE [1575]
    ├─ GET [1577]
    ├─ PATCH [1578]
    ╰─ PUT [1579]

    [1589]
    ╰─ POST [1580]

    [1590]
    ├─ DELETE [1581]
    ├─ PATCH [1583]
    ╰─ PUT [1584]

    [1591]
    ╰─ GET [1582]

    [1594]
    ├─ GET [1587]
    ╰─ POST [1585]

    [1595]
    ├─ DELETE [1586]
    ├─ GET [1588]
    ├─ PATCH [1589]
    ╰─ PUT [1590]

    [1600]
    ├─ PATCH [1591]
    ╰─ PUT [1592]

    [1602]
    ╰─ GET [1593]

    [1603]
    ╰─ GET [1594]

    [1604]
    ╰─ GET [1595]

    [1605]
    ╰─ GET [1596]

    [1606]
    ╰─ GET [1597]

    [1607]
    ╰─ GET [1598]

    [1608]
    ╰─ GET [1599]

    [1609]
    ╰─ GET [1600]

    [1610]
    ╰─ GET [1601]

    [1611]
    ╰─ GET [1602]

    [1612]
    ├─ DELETE [1603]
    ╰─ GET [1605]

    [1613]
    ╰─ GET [1604]

    [1615]
    ╰─ DELETE [1606]

    [1616]
    ╰─ DELETE [1607]

    [1617]
    ╰─ GET [1608]

    [1618]
    ╰─ GET [1609]

    [1619]
    ╰─ GET [1610]

    [1620]
    ╰─ GET [1611]

    [1621]
    ╰─ GET [1612]

    [1622]
    ╰─ GET [1613]

    [1623]
    ╰─ GET [1614]

    [1624]
    ╰─ GET [1615]

    [1625]
    ╰─ GET [1616]

    [1626]
    ╰─ POST [1617]

    [1627]
    ╰─ POST [1618]

    [1628]
    ╰─ POST [1619]

    [1629]
    ╰─ POST [1620]

    [1630]
    ╰─ GET [1621]

    [1631]
    ╰─ POST [1622]

    [1632]
    ╰─ DELETE [1623]

    [1633]
    ├─ DELETE [1624]
    ├─ GET [1631]
    ├─ PATCH [1634]
    ╰─ PUT [1635]

    [1634]
    ╰─ GET [1625]

    [1635]
    ╰─ GET [1626]

    [1636]
    ╰─ GET [1627]

    [1637]
    ╰─ POST [1628]

    [1638]
    ╰─ GET [1629]

    [1639]
    ╰─ POST [1630]

    [1641]
    ╰─ POST [1632]

    [1642]
    ╰─ POST [1633]

    [1645]
    ╰─ GET [1636]

    [1646]
    ╰─ GET [1637]

    [1647]
    ╰─ GET [1638]

    [1648]
    ╰─ GET [1639]

    [1649]
    ╰─ GET [1640]

    [1650]
    ╰─ GET [1641]

    [1651]
    ╰─ GET [1642]

    [1652]
    ╰─ GET [1643]

    [1653]
    ╰─ GET [1644]

    [1654]
    ╰─ GET [1645]

    [1655]
    ╰─ GET [1646]

    [1656]
    ╰─ GET [1647]

    [1657]
    ╰─ GET [1648]

    [1658]
    ╰─ GET [1649]

    [1659]
    ╰─ GET [1650]

    [1660]
    ╰─ GET [1651]

    [1661]
    ╰─ GET [1652]

    [1662]
    ╰─ GET [1653]

    [1663]
    ╰─ GET [1654]

    [1664]
    ╰─ GET [1655]

    [1665]
    ╰─ GET [1656]

    [1666]
    ╰─ GET [1657]

    [1667]
    ╰─ GET [1658]

    [1668]
    ├─ GET [1661]
    ╰─ POST [1659]

    [1669]
    ├─ DELETE [1660]
    ├─ PATCH [1663]
    ╰─ PUT [1664]

    [1671]
    ╰─ POST [1662]

    [1674]
    ╰─ GET [1665]

    [1675]
    ├─ GET [1666]
    ╰─ PUT [1667]

    [1677]
    ├─ DELETE [1669]
    ├─ GET [1670]
    ├─ PATCH [1671]
    ├─ POST [1668]
    ╰─ PUT [1672]

    [1682]
    ╰─ POST [1673]

    [1683]
    ├─ GET [1675]
    ╰─ POST [1674]

    [1685]
    ╰─ PUT [1676]

    [1686]
    ├─ GET [1677]
    ├─ PATCH [1678]
    ╰─ PUT [1679]

    [1689]
    ╰─ GET [1680]

    [1690]
    ╰─ GET [1681]

    [1691]
    ╰─ POST [1682]

    [1692]
    ╰─ PUT [1683]

    [1693]
    ╰─ GET [1684]

    [1694]
    ├─ GET [1685]
    ├─ PATCH [1686]
    ╰─ PUT [1687]

    [1697]
    ╰─ POST [1688]

    [1698]
    ╰─ GET [1689]

    [1699]
    ╰─ GET [1690]

    [1700]
    ╰─ GET [1691]

    [1701]
    ╰─ PUT [1692]

    [1702]
    ├─ PATCH [1693]
    ╰─ PUT [1694]

    [1704]
    ├─ GET [1695]
    ├─ PATCH [1696]
    ╰─ PUT [1697]

    [1707]
    ╰─ POST [1698]

    [1708]
    ╰─ POST [1699]

    [1709]
    ├─ GET [1700]
    ├─ PATCH [1701]
    ╰─ PUT [1702]

    [1712]
    ╰─ GET [1703]

    [1713]
    ╰─ GET [1704]

    [1714]
    ╰─ POST [1705]

    [1715]
    ╰─ POST [1706]

    [1716]
    ╰─ POST [1707]

    [1717]
    ├─ GET [1708]
    ├─ PATCH [1709]
    ╰─ PUT [1710]

    [1720]
    ├─ DELETE [1711]
    ├─ PATCH [1714]
    ╰─ PUT [1715]

    [1721]
    ╰─ GET [1712]

    [1722]
    ╰─ GET [1713]

    [1725]
    ╰─ GET [1716]

    [1726]
    ╰─ GET [1717]

    [1727]
    ╰─ POST [1718]

    [1728]
    ╰─ GET [1719]

    [1729]
    ╰─ GET [1720]

    [1730]
    ╰─ GET [1721]

    [1731]
    ╰─ GET [1722]

    [1732]
    ╰─ POST [1723]

    [1733]
    ╰─ GET [1724]

    [1734]
    ╰─ GET [1725]

    [1735]
    ╰─ POST [1726]

    [1736]
    ╰─ DELETE [1727]

    [1737]
    ├─ GET [1730]
    ╰─ POST [1728]

    [1738]
    ├─ DELETE [1729]
    ╰─ GET [1732]

    [1740]
    ╰─ GET [1731]

    [1742]
    ├─ GET [1735]
    ╰─ POST [1733]

    [1743]
    ╰─ DELETE [1734]

    [1745]
    ╰─ GET [1736]

    [1746]
    ╰─ GET [1737]

    [1747]
    ╰─ GET [1738]

    [1748]
    ╰─ GET [1739]

    [1749]
    ╰─ POST [1740]

    [1750]
    ╰─ GET [1741]

    [1751]
    ╰─ GET [1742]

    [1752]
    ╰─ POST [1743]

    [1753]
    ╰─ GET [1744]

    [1754]
    ╰─ GET [1745]

    [1755]
    ├─ GET [1748]
    ╰─ POST [1746]

    [1756]
    ├─ DELETE [1747]
    ├─ PATCH [1749]
    ╰─ PUT [1750]

    [1760]
    ╰─ POST [1751]

    [1761]
    ╰─ POST [1752]

    [1762]
    ╰─ GET [1753]

    [1763]
    ╰─ GET [1754]

    [1764]
    ├─ GET [1755]
    ├─ PATCH [1756]
    ╰─ PUT [1757]

    [1767]
    ╰─ GET [1758]

    [1768]
    ├─ GET [1761]
    ╰─ POST [1759]

    [1769]
    ├─ DELETE [1760]
    ├─ PATCH [1762]
    ╰─ PUT [1763]

    [1773]
    ╰─ GET [1764]

    [1774]
    ╰─ POST [1765]

    [1775]
    ╰─ POST [1766]

    [1776]
    ╰─ POST [1767]

    [1777]
    ╰─ POST [1768]

    [1778]
    ╰─ GET [1769]

    [1779]
    ├─ GET [1803]
    ╰─ POST [1770]

    [1780]
    ├─ DELETE [1771]
    ├─ GET [1780]
    ╰─ PUT [1782]

    [1781]
    ╰─ GET [1772]

    [1782]
    ╰─ GET [1773]

    [1783]
    ╰─ GET [1774]

    [1784]
    ╰─ GET [1775]

    [1785]
    ╰─ GET [1776]

    [1786]
    ╰─ GET [1777]

    [1787]
    ╰─ POST [1778]

    [1788]
    ╰─ GET [1779]

    [1790]
    ╰─ GET [1781]

    [1792]
    ╰─ POST [1783]

    [1793]
    ╰─ POST [1784]

    [1794]
    ╰─ GET [1785]

    [1795]
    ╰─ GET [1786]

    [1796]
    ╰─ GET [1787]

    [1797]
    ╰─ GET [1788]

    [1798]
    ╰─ GET [1789]

    [1799]
    ╰─ GET [1790]

    [1800]
    ╰─ GET [1791]

    [1801]
    ╰─ GET [1792]

    [1802]
    ╰─ GET [1793]

    [1803]
    ╰─ GET [1794]

    [1804]
    ╰─ GET [1795]

    [1805]
    ╰─ GET [1796]

    [1806]
    ╰─ GET [1797]

    [1807]
    ╰─ GET [1798]

    [1808]
    ╰─ GET [1799]

    [1809]
    ╰─ GET [1800]

    [1811]
    ╰─ GET [1802]

    [1813]
    ╰─ GET [1804]

    [1814]
    ╰─ GET [1805]

    [1815]
    ╰─ GET [1806]

    [1816]
    ├─ DELETE [1807]
    ├─ GET [1807]
    ├─ PATCH [1807]
    ╰─ POST [1807]

    [1817]
    ├─ DELETE [1808]
    ├─ GET [1808]
    ├─ PATCH [1808]
    ╰─ POST [1808]

    [1818]
    ├─ DELETE [1809]
    ├─ GET [1809]
    ├─ PATCH [1809]
    ╰─ POST [1809]

    [1819]
    ├─ DELETE [1810]
    ├─ GET [1810]
    ├─ PATCH [1810]
    ╰─ POST [1810]

    [1820]
    ├─ DELETE [1811]
    ├─ GET [1811]
    ├─ PATCH [1811]
    ╰─ POST [1811]

    [1821]
    ├─ DELETE [1812]
    ├─ GET [1812]
    ├─ PATCH [1812]
    ╰─ POST [1812]

    [1822]
    ├─ DELETE [1813]
    ├─ GET [1813]
    ├─ PATCH [1813]
    ╰─ POST [1813]

    [1823]
    ├─ DELETE [1814]
    ├─ GET [1814]
    ├─ PATCH [1814]
    ╰─ POST [1814]

    [1824]
    ├─ DELETE [1815]
    ├─ GET [1815]
    ├─ PATCH [1815]
    ╰─ POST [1815]

    [1825]
    ├─ DELETE [1816]
    ├─ GET [1816]
    ├─ PATCH [1816]
    ╰─ POST [1816]

    [1826]
    ├─ DELETE [1817]
    ├─ GET [1817]
    ├─ PATCH [1817]
    ╰─ POST [1817]

    [1827]
    ├─ DELETE [1818]
    ├─ GET [1818]
    ├─ PATCH [1818]
    ╰─ POST [1818]

    [1828]
    ├─ DELETE [1819]
    ├─ GET [1819]
    ├─ PATCH [1819]
    ╰─ POST [1819]

    [1829]
    ├─ DELETE [1820]
    ├─ GET [1820]
    ├─ PATCH [1820]
    ╰─ POST [1820]

    [1830]
    ├─ DELETE [1821]
    ├─ GET [1821]
    ├─ PATCH [1821]
    ╰─ POST [1821]

    [1831]
    ├─ DELETE [1822]
    ├─ GET [1822]
    ├─ PATCH [1822]
    ╰─ POST [1822]

    [1832]
    ├─ DELETE [1823]
    ├─ GET [1823]
    ├─ PATCH [1823]
    ╰─ POST [1823]

    [1833]
    ├─ DELETE [1824]
    ├─ GET [1824]
    ├─ PATCH [1824]
    ╰─ POST [1824]

    [1834]
    ├─ DELETE [1825]
    ├─ GET [1825]
    ├─ PATCH [1825]
    ╰─ POST [1825]

    [1835]
    ├─ DELETE [1826]
    ├─ GET [1826]
    ├─ PATCH [1826]
    ╰─ POST [1826]

    [1836]
    ├─ DELETE [1827]
    ├─ GET [1827]
    ├─ PATCH [1827]
    ╰─ POST [1827]

    [1837]
    ├─ DELETE [1828]
    ├─ GET [1828]
    ├─ PATCH [1828]
    ╰─ POST [1828]

    [1838]
    ├─ DELETE [1829]
    ├─ GET [1829]
    ├─ PATCH [1829]
    ╰─ POST [1829]

    [1839]
    ├─ DELETE [1830]
    ├─ GET [1830]
    ├─ PATCH [1830]
    ╰─ POST [1830]

    [1840]
    ├─ DELETE [1831]
    ├─ GET [1831]
    ├─ PATCH [1831]
    ╰─ POST [1831]

    [1841]
    ├─ DELETE [1832]
    ├─ GET [1832]
    ├─ PATCH [1832]
    ╰─ POST [1832]

    [1842]
    ├─ DELETE [1833]
    ├─ GET [1833]
    ├─ PATCH [1833]
    ╰─ POST [1833]

    [1843]
    ├─ DELETE [1834]
    ├─ GET [1834]
    ├─ PATCH [1834]
    ╰─ POST [1834]

    [1844]
    ├─ DELETE [1835]
    ├─ GET [1835]
    ├─ PATCH [1835]
    ╰─ POST [1835]

    [1845]
    ├─ DELETE [1836]
    ├─ GET [1836]
    ├─ PATCH [1836]
    ╰─ POST [1836]

    [1846]
    ╰─ GET [1837]

    [1847]
    ╰─ GET [1838]

    [1848]
    ╰─ GET [1839]

    [1849]
    ╰─ GET [1840]

    [1850]
    ╰─ GET [1841]

    [1851]
    ╰─ GET [1842]

    [1852]
    ╰─ GET [1843]

    [1853]
    ╰─ GET [1844]

    [1854]
    ╰─ GET [1845]

    [1855]
    ╰─ GET [1846]

    [1856]
    ╰─ GET [1847]

    [1857]
    ╰─ GET [1848]

    [1858]
    ╰─ GET [1849]

    [1859]
    ╰─ GET [1850]

    [1860]
    ╰─ GET [1851]

    [1861]
    ╰─ GET [1852]

    [1862]
    ╰─ GET [1853]

    [1863]
    ╰─ GET [1854]

    [1864]
    ╰─ GET [1855]

    [1865]
    ╰─ GET [1856]

    [1866]
    ╰─ GET [1857]

    [1867]
    ╰─ GET [1858]

    [1868]
    ╰─ GET [1859]

    [1869]
    ╰─ GET [1860]

    [1870]
    ├─ DELETE [1862]
    ├─ PATCH [1865]
    ├─ POST [1861]
    ╰─ PUT [1866]

    [1872]
    ╰─ GET [1863]

    [1873]
    ╰─ GET [1864]

    [1876]
    ╰─ POST [1867]

    [1877]
    ╰─ GET [1868]

    [1878]
    ╰─ POST [1869]

    [1879]
    ╰─ GET [1870]

    [1880]
    ├─ GET [1871]
    ├─ PATCH [1872]
    ╰─ PUT [1873]

    [1883]
    ├─ GET [1877]
    ╰─ POST [1874]

    [1884]
    ├─ DELETE [1875]
    ├─ GET [1881]
    ├─ PATCH [1882]
    ╰─ PUT [1883]

    [1885]
    ╰─ GET [1876]

    [1887]
    ╰─ GET [1878]

    [1888]
    ╰─ GET [1879]

    [1889]
    ╰─ GET [1880]

    [1893]
    ╰─ GET [1884]

    [1894]
    ╰─ POST [1885]

    [1895]
    ╰─ POST [1886]

    [1896]
    ╰─ POST [1887]

    [1897]
    ╰─ POST [1888]

    [1898]
    ╰─ GET [1889]

    [1899]
    ╰─ GET [1890]

    [1900]
    ╰─ POST [1891]

    [1901]
    ╰─ POST [1892]

    [1902]
    ╰─ POST [1893]

    [1903]
    ╰─ POST [1894]

    [1904]
    ╰─ POST [1895]

    [1905]
    ╰─ POST [1896]

    [1906]
    ╰─ GET [1897]

    [1907]
    ╰─ GET [1898]

    [1908]
    ╰─ POST [1899]

    [1909]
    ╰─ POST [1900]

    [1910]
    ├─ GET [1907]
    ╰─ POST [1901]

    [1911]
    ├─ GET [1908]
    ╰─ POST [1902]

    [1912]
    ├─ DELETE [1903]
    ├─ GET [1911]
    ├─ PATCH [1915]
    ╰─ PUT [1917]

    [1913]
    ├─ DELETE [1904]
    ├─ GET [1912]
    ├─ PATCH [1916]
    ╰─ PUT [1918]

    [1914]
    ╰─ GET [1905]

    [1915]
    ╰─ GET [1906]

    [1918]
    ╰─ GET [1909]

    [1919]
    ╰─ GET [1910]

    [1922]
    ╰─ POST [1913]

    [1923]
    ╰─ POST [1914]

    [1928]
    ╰─ POST [1919]

    [1929]
    ╰─ POST [1920]

    [1930]
    ╰─ GET [1921]

    [1931]
    ╰─ GET [1922]

    [1932]
    ╰─ PUT [1923]

    [1933]
    ╰─ PUT [1924]

    [1934]
    ╰─ PUT [1925]

    [1935]
    ╰─ PUT [1926]

    [1937]
    ╰─ GET [1928]

    [1938]
    ╰─ GET [1929]

    [1939]
    ╰─ GET [1930]

    [1940]
    ╰─ GET [1931]

    [1941]
    ╰─ GET [1932]

    [1942]
    ╰─ GET [1933]

    [1943]
    ╰─ GET [1934]

    [1944]
    ╰─ GET [1935]

    [1945]
    ╰─ GET [1936]

    [1946]
    ╰─ GET [1937]

    [1947]
    ╰─ GET [1938]

    [1948]
    ├─ GET [1941]
    ╰─ POST [1939]

    [1949]
    ╰─ DELETE [1940]

    [1951]
    ╰─ GET [1942]

    [1952]
    ├─ GET [1943]
    ╰─ POST [1943]

    [1953]
    ├─ GET [1948]
    ╰─ POST [1944]

    [1954]
    ├─ GET [1949]
    ╰─ POST [1945]

    [1955]
    ╰─ POST [1946]

    [1956]
    ╰─ POST [1947]

    [1959]
    ╰─ POST [1950]

    [1960]
    ╰─ GET [1951]

    [1961]
    ╰─ PATCH [1952]

    [1962]
    ╰─ GET [1953]

    [1963]
    ╰─ POST [1954]

    [1964]
    ╰─ GET [1955]

    [1965]
    ╰─ GET [1956]

    [1966]
    ╰─ GET [1957]

    [1967]
    ╰─ GET [1958]

    [1968]
    ╰─ POST [1959]

    [1969]
    ╰─ GET [1960]

    [1970]
    ╰─ POST [1961]

    [1971]
    ╰─ GET [1962]

    [1972]
    ╰─ GET [1963]

    [1973]
    ╰─ GET [1964]

    [1974]
    ╰─ POST [1965]

    [1975]
    ╰─ GET [1966]

    [1976]
    ├─ GET [1970]
    ╰─ POST [1967]

    [1977]
    ╰─ DELETE [1968]

    [1978]
    ├─ DELETE [1969]
    ├─ PATCH [1972]
    ╰─ PUT [1973]

    [1980]
    ╰─ POST [1971]

    [1983]
    ╰─ GET [1974]

    [1984]
    ╰─ GET [1975]

    [1985]
    ╰─ GET [1976]

    [1986]
    ├─ DELETE [1977]
    ├─ GET [1979]
    ├─ PATCH [1980]
    ╰─ PUT [1981]

    [1987]
    ╰─ GET [1978]

    [1991]
    ╰─ POST [1982]

    [1992]
    ╰─ GET [1983]

    [1993]
    ╰─ POST [1984]

    [1994]
    ╰─ POST [1985]

    [1995]
    ╰─ GET [1986]

    [1996]
    ╰─ GET [1987]

    [1997]
    ╰─ GET [1988]

    [1998]
    ╰─ GET [1989]

    [1999]
    ╰─ GET [1990]

    [2000]
    ╰─ GET [1991]

    [2001]
    ╰─ GET [1992]

    [2002]
    ╰─ DELETE [1993]

    [2003]
    ╰─ GET [1994]

    [2004]
    ╰─ GET [1995]

    [2005]
    ├─ GET [1998]
    ╰─ POST [1996]

    [2006]
    ╰─ DELETE [1997]

    [2008]
    ╰─ PUT [1999]

    [2009]
    ╰─ POST [2000]

    [2010]
    ╰─ GET [2001]

    [2011]
    ├─ PATCH [2006]
    ├─ POST [2002]
    ╰─ PUT [2007]

    [2012]
    ╰─ GET [2003]

    [2013]
    ╰─ GET [2004]

    [2014]
    ╰─ PUT [2005]

    [2017]
    ├─ GET [2009]
    ╰─ POST [2008]

    [2019]
    ╰─ PUT [2010]

    [2020]
    ╰─ PUT [2011]

    [2021]
    ├─ GET [2012]
    ├─ PATCH [2013]
    ╰─ PUT [2014]

    [2024]
    ├─ GET [2017]
    ╰─ POST [2015]

    [2025]
    ├─ DELETE [2016]
    ╰─ GET [2019]

    [2027]
    ╰─ DELETE [2018]

    [2029]
    ╰─ GET [2020]

    [2030]
    ╰─ GET [2021]

    [2031]
    ╰─ GET [2022]

    [2032]
    ╰─ GET [2023]

    [2033]
    ╰─ GET [2024]

    [2034]
    ╰─ GET [2025]

    [2035]
    ╰─ GET [2026]

    [2036]
    ╰─ GET [2027]

    [2037]
    ╰─ POST [2028]

    [2038]
    ╰─ GET [2029]

    [2039]
    ╰─ GET [2030]

    [2040]
    ╰─ GET [2031]

    [2041]
    ╰─ GET [2032]

    [2042]
    ╰─ GET [2033]

    [2043]
    ╰─ GET [2034]

    [2044]
    ╰─ GET [2035]

    [2045]
    ╰─ GET [2036]

    [2046]
    ╰─ GET [2037]

    [2047]
    ╰─ POST [2038]

    [2048]
    ╰─ POST [2039]

    [2049]
    ╰─ POST [2040]

    [2050]
    ╰─ POST [2041]

    [2051]
    ╰─ POST [2042]

    [2052]
    ╰─ GET [2043]

    [2053]
    ╰─ GET [2044]

    [2054]
    ╰─ PATCH [2045]

    [2055]
    ╰─ GET [2046]

    [2056]
    ╰─ GET [2047]

    [2057]
    ╰─ POST [2048]

    [2058]
    ╰─ POST [2049]

    [2059]
    ╰─ POST [2050]

    [2060]
    ├─ PATCH [2051]
    ╰─ PUT [2052]

    [2062]
    ╰─ POST [2053]

    [2063]
    ╰─ GET [2054]

    [2064]
    ╰─ POST [2055]

    [2065]
    ╰─ GET [2056]

    [2066]
    ╰─ POST [2057]

    [2067]
    ╰─ GET [2058]

    [2068]
    ╰─ GET [2059]

    [2069]
    ╰─ PATCH [2060]

    [2070]
    ╰─ GET [2061]

    [2071]
    ╰─ POST [2062]

    [2072]
    ╰─ GET [2063]

    [2073]
    ╰─ POST [2064]

    [2074]
    ╰─ POST [2065]

    [2075]
    ╰─ POST [2066]

    [2076]
    ╰─ POST [2067]

    [2077]
    ╰─ POST [2068]

    [2078]
    ╰─ GET [2069]

    [2079]
    ├─ GET [2071]
    ╰─ POST [2070]

    [2081]
    ╰─ GET [2072]

    [2082]
    ╰─ GET [2073]
    === Chains
    1-*
    2-1
    3-2
    4-*
    5-3
    5-884
    6-*
    6-1927
    7-*
    8-*
    9-*
    10-*
    11-*
    12-*
    13-4
    14-5
    15-6
    16-7
    17-8
    18-9
    19-10
    19-13
    19-14
    19-15
    20-11
    21-12
    25-16
    26-17
    26-18
    28-19
    29-20
    30-21
    31-22
    32-23
    33-24
    34-25
    35-26
    36-27
    37-28
    38-29
    39-30
    40-31
    41-32
    42-33
    43-34
    44-35
    45-36
    46-37
    47-38
    48-39
    49-40
    49-41
    51-42
    52-43
    53-44
    53-50
    53-51
    53-52
    54-45
    55-46
    56-47
    57-48
    58-49
    62-53
    63-54
    64-55
    65-56
    66-57
    67-58
    67-61
    68-59
    68-65
    68-66
    68-67
    69-60
    71-62
    72-63
    73-64
    77-68
    78-69
    79-70
    80-71
    81-72
    82-73
    83-74
    84-75
    85-76
    86-77
    86-80
    87-78
    87-82
    87-83
    88-79
    90-81
    93-84
    93-85
    93-86
    96-87
    97-88
    98-89
    99-90
    100-91
    100-97
    100-98
    100-99
    101-92
    102-93
    103-94
    104-95
    105-96
    109-100
    110-101
    111-102
    112-103
    113-104
    114-105
    115-106
    116-107
    117-108
    117-111
    118-109
    118-113
    118-114
    119-110
    121-112
    124-115
    125-116
    126-117
    127-118
    128-119
    129-120
    129-121
    131-122
    131-125
    132-123
    133-124
    135-126
    136-127
    137-128
    137-129
    139-130
    140-131
    141-132
    142-133
    142-134
    142-135
    145-136
    146-137
    147-138
    148-139
    149-140
    149-143
    150-141
    150-147
    150-148
    150-149
    151-142
    153-144
    154-145
    155-146
    159-150
    160-151
    161-152
    162-153
    162-156
    163-154
    163-158
    163-159
    164-155
    166-157
    169-160
    169-163
    170-161
    170-165
    170-166
    171-162
    173-164
    176-167
    176-168
    178-169
    179-170
    180-171
    181-172
    181-173
    183-174
    184-175
    185-176
    186-177
    187-178
    188-179
    188-180
    190-181
    191-182
    192-183
    192-184
    194-185
    194-188
    195-186
    195-190
    195-191
    195-192
    196-187
    198-189
    202-193
    202-194
    202-196
    204-195
    206-197
    207-198
    208-199
    209-200
    210-201
    211-202
    212-203
    212-207
    212-209
    212-210
    213-204
    214-205
    215-206
    217-208
    220-211
    220-212
    220-213
    223-214
    224-215
    225-216
    226-217
    227-218
    227-226
    227-228
    227-229
    228-219
    229-220
    230-221
    231-222
    232-223
    233-224
    234-225
    236-227
    239-230
    240-231
    241-232
    242-233
    243-234
    244-235
    245-236
    246-237
    247-238
    248-239
    249-240
    249-243
    250-241
    250-247
    250-248
    251-242
    253-244
    254-245
    255-246
    258-249
    259-250
    260-251
    261-252
    262-253
    263-254
    264-255
    265-256
    266-257
    267-258
    267-266
    268-259
    269-260
    269-274
    269-280
    269-281
    270-261
    271-262
    272-263
    273-264
    274-265
    276-267
    277-268
    278-269
    279-270
    280-271
    281-272
    282-273
    284-275
    285-276
    286-277
    287-278
    288-279
    291-282
    292-283
    293-284
    293-287
    293-289
    293-291
    294-285
    294-288
    294-290
    294-292
    295-286
    302-293
    303-294
    304-295
    305-296
    306-297
    307-298
    308-299
    309-300
    310-301
    311-302
    312-303
    313-304
    314-305
    315-306
    316-307
    317-308
    318-309
    319-310
    320-311
    321-312
    322-313
    323-314
    324-315
    324-319
    325-316
    325-320
    326-317
    327-318
    330-321
    331-322
    332-323
    333-324
    334-325
    335-326
    336-327
    337-328
    338-329
    339-330
    340-331
    341-332
    342-333
    343-334
    344-335
    345-336
    346-337
    347-338
    348-339
    349-340
    350-341
    351-342
    352-343
    353-344
    354-345
    355-346
    356-347
    357-348
    357-350
    358-349
    360-351
    360-352
    360-353
    363-354
    364-355
    365-356
    366-357
    367-358
    368-359
    369-360
    370-361
    371-362
    372-363
    373-364
    374-365
    375-366
    376-367
    377-368
    378-369
    379-370
    380-371
    381-372
    381-373
    383-374
    384-375
    385-376
    386-377
    387-378
    388-379
    389-380
    390-381
    391-382
    392-383
    393-384
    394-385
    395-386
    396-387
    397-388
    398-389
    399-390
    400-391
    401-392
    401-398
    402-393
    402-409
    402-412
    402-413
    403-394
    404-395
    405-396
    406-397
    408-399
    409-400
    410-401
    411-402
    412-403
    413-404
    414-405
    415-406
    416-407
    417-408
    419-410
    420-411
    423-414
    424-415
    425-416
    426-417
    427-418
    428-419
    429-420
    430-421
    431-422
    432-423
    433-424
    434-425
    435-426
    436-427
    437-428
    438-429
    439-430
    440-431
    441-432
    441-435
    442-433
    442-437
    442-438
    442-439
    443-434
    445-436
    449-440
    450-441
    451-442
    452-443
    453-444
    454-445
    455-446
    456-447
    457-448
    458-449
    459-450
    460-451
    461-452
    462-453
    463-454
    464-455
    465-456
    466-457
    467-458
    468-459
    469-460
    470-461
    471-462
    472-463
    473-464
    474-465
    475-466
    476-467
    477-468
    477-474
    477-475
    477-476
    478-469
    479-470
    480-471
    481-472
    482-473
    486-477
    487-478
    488-479
    489-480
    490-481
    491-482
    492-483
    493-484
    494-485
    495-486
    496-487
    497-488
    498-489
    499-490
    500-491
    501-492
    502-493
    502-494
    502-495
    505-496
    506-497
    507-498
    508-499
    509-500
    510-501
    511-502
    512-503
    513-504
    514-505
    514-506
    516-507
    517-508
    518-509
    518-511
    519-510
    519-512
    519-513
    523-514
    524-515
    524-521
    525-516
    526-517
    527-518
    527-524
    527-527
    527-528
    528-519
    529-520
    531-522
    532-523
    534-525
    535-526
    538-529
    538-531
    539-530
    539-532
    539-533
    543-534
    543-536
    544-535
    544-538
    544-539
    546-537
    549-540
    549-542
    550-541
    552-543
    552-544
    552-545
    555-546
    556-547
    557-548
    558-549
    558-558
    558-559
    559-550
    560-551
    561-552
    562-553
    563-554
    563-555
    565-556
    566-557
    569-560
    570-561
    571-562
    572-563
    573-564
    574-565
    575-566
    575-569
    576-567
    576-571
    576-572
    577-568
    579-570
    582-573
    583-574
    584-575
    585-576
    586-577
    587-578
    588-579
    588-582
    588-588
    588-590
    589-580
    589-589
    590-581
    592-583
    593-584
    594-585
    595-586
    596-587
    600-591
    601-592
    602-593
    603-594
    604-595
    604-598
    605-596
    605-601
    605-602
    606-597
    608-599
    609-600
    612-603
    612-605
    613-604
    615-606
    616-607
    617-608
    617-611
    618-609
    618-617
    618-618
    618-619
    619-610
    621-612
    622-613
    623-614
    624-615
    625-616
    629-620
    629-621
    631-622
    632-623
    633-624
    634-625
    635-626
    635-627
    635-628
    638-629
    639-630
    639-631
    639-632
    642-633
    642-634
    644-635
    645-636
    646-637
    647-638
    648-639
    649-640
    650-641
    650-648
    650-649
    650-650
    651-642
    652-643
    653-644
    654-645
    655-646
    656-647
    660-651
    660-653
    661-652
    663-654
    663-655
    663-656
    663-657
    667-658
    668-659
    669-660
    670-661
    671-662
    672-663
    673-664
    674-665
    675-666
    676-667
    677-668
    678-669
    679-670
    680-671
    681-672
    682-673
    683-674
    684-675
    685-676
    686-677
    686-680
    686-682
    686-684
    687-678
    687-683
    688-679
    690-681
    694-685
    694-686
    696-687
    697-688
    697-689
    697-690
    700-691
    700-694
    701-692
    701-697
    701-698
    701-699
    702-693
    704-695
    705-696
    709-700
    710-701
    711-702
    711-703
    711-704
    714-705
    715-706
    716-707
    716-709
    717-708
    717-712
    717-713
    717-714
    719-710
    720-711
    724-715
    725-716
    726-717
    727-718
    728-719
    729-720
    730-721
    731-722
    732-723
    732-724
    734-725
    734-726
    736-727
    737-728
    738-729
    739-730
    740-731
    741-732
    742-733
    743-734
    744-735
    745-736
    746-737
    747-738
    748-739
    749-740
    750-741
    750-742
    752-743
    753-744
    754-745
    755-746
    756-747
    757-748
    758-749
    759-750
    760-751
    761-752
    761-753
    761-754
    764-755
    764-1801
    765-756
    765-765
    765-767
    766-757
    767-758
    768-759
    769-760
    770-761
    771-762
    772-763
    773-764
    775-766
    777-768
    778-769
    779-770
    780-771
    781-772
    782-773
    783-774
    784-775
    785-776
    786-777
    787-778
    788-779
    789-780
    790-781
    791-782
    792-783
    793-784
    794-785
    795-786
    796-787
    797-788
    798-789
    799-790
    800-791
    801-792
    802-793
    803-794
    804-795
    805-796
    806-797
    807-798
    808-799
    809-800
    810-801
    811-802
    812-803
    813-804
    814-805
    815-806
    816-807
    817-808
    818-809
    819-810
    820-811
    821-812
    822-813
    823-814
    824-815
    825-816
    826-817
    826-819
    827-818
    829-820
    830-821
    831-822
    832-823
    833-824
    834-825
    835-826
    836-827
    837-828
    838-829
    839-830
    840-831
    841-832
    842-833
    843-834
    844-835
    845-836
    846-837
    847-838
    848-839
    849-840
    850-841
    851-842
    852-843
    853-844
    854-845
    855-846
    856-847
    857-848
    858-849
    859-850
    860-851
    861-852
    862-853
    863-854
    864-855
    865-856
    866-857
    867-858
    868-859
    869-860
    870-861
    871-862
    871-863
    873-864
    873-865
    875-866
    876-867
    877-868
    878-869
    879-870
    879-873
    879-874
    880-871
    880-872
    884-875
    885-876
    886-877
    886-878
    888-879
    889-880
    889-881
    891-882
    891-883
    894-885
    895-886
    896-887
    897-888
    898-889
    899-890
    900-891
    901-892
    902-893
    903-894
    904-895
    905-896
    906-897
    907-898
    908-899
    909-900
    910-901
    911-902
    912-903
    912-907
    913-904
    913-910
    913-911
    913-912
    914-905
    915-906
    917-908
    918-909
    922-913
    922-914
    922-915
    925-916
    926-917
    927-918
    928-919
    928-921
    929-920
    931-922
    932-923
    933-924
    934-925
    935-926
    936-927
    936-928
    938-929
    939-930
    939-931
    941-932
    942-933
    942-935
    942-938
    943-934
    943-936
    943-937
    948-939
    948-940
    950-941
    951-942
    952-943
    953-944
    954-945
    955-946
    956-947
    957-948
    958-949
    959-950
    960-951
    961-952
    962-953
    962-956
    962-957
    963-954
    964-955
    967-958
    968-959
    969-960
    970-961
    971-962
    972-963
    973-964
    974-965
    975-966
    976-967
    977-968
    977-971
    978-969
    979-970
    981-972
    982-973
    983-974
    984-975
    984-977
    985-976
    987-978
    988-979
    988-980
    990-981
    990-982
    990-983
    993-984
    993-985
    993-986
    996-987
    997-988
    998-989
    999-990
    999-992
    999-995
    1000-991
    1002-993
    1003-994
    1005-996
    1006-997
    1007-998
    1008-999
    1009-1000
    1009-1007
    1010-1001
    1010-1015
    1010-1020
    1010-1021
    1011-1002
    1012-1003
    1013-1004
    1014-1005
    1015-1006
    1017-1008
    1018-1009
    1019-1010
    1020-1011
    1021-1012
    1022-1013
    1023-1014
    1025-1016
    1026-1017
    1027-1018
    1028-1019
    1031-1022
    1032-1023
    1033-1024
    1034-1025
    1035-1026
    1036-1027
    1037-1028
    1038-1029
    1039-1030
    1040-1031
    1041-1032
    1042-1033
    1043-1034
    1044-1035
    1045-1036
    1046-1037
    1047-1038
    1048-1039
    1048-1042
    1049-1040
    1049-1044
    1049-1045
    1049-1046
    1050-1041
    1052-1043
    1056-1047
    1057-1048
    1058-1049
    1059-1050
    1060-1051
    1061-1052
    1062-1053
    1063-1054
    1064-1055
    1065-1056
    1066-1057
    1067-1058
    1068-1059
    1069-1060
    1070-1061
    1071-1062
    1072-1063
    1073-1064
    1074-1065
    1075-1066
    1076-1067
    1077-1068
    1078-1069
    1079-1070
    1080-1071
    1081-1072
    1082-1073
    1083-1074
    1084-1075
    1085-1076
    1086-1077
    1087-1078
    1087-1079
    1089-1080
    1090-1081
    1091-1082
    1092-1083
    1093-1084
    1094-1085
    1095-1086
    1096-1087
    1097-1088
    1098-1089
    1098-1091
    1098-1096
    1098-1098
    1099-1090
    1101-1092
    1102-1093
    1103-1094
    1104-1095
    1106-1097
    1108-1099
    1109-1100
    1110-1101
    1111-1102
    1111-1106
    1112-1103
    1113-1104
    1114-1105
    1116-1107
    1117-1108
    1118-1109
    1119-1110
    1120-1111
    1121-1112
    1122-1113
    1123-1114
    1124-1115
    1125-1116
    1126-1117
    1127-1118
    1127-1119
    1129-1120
    1130-1121
    1131-1122
    1132-1123
    1133-1124
    1134-1125
    1135-1126
    1136-1127
    1136-1133
    1136-1134
    1136-1135
    1137-1128
    1138-1129
    1139-1130
    1140-1131
    1141-1132
    1145-1136
    1146-1137
    1147-1138
    1148-1139
    1149-1140
    1150-1141
    1151-1142
    1152-1143
    1153-1144
    1154-1145
    1155-1146
    1156-1147
    1157-1148
    1158-1149
    1159-1150
    1160-1151
    1160-1153
    1161-1152
    1163-1154
    1164-1155
    1165-1156
    1166-1157
    1167-1158
    1168-1159
    1169-1160
    1170-1161
    1171-1162
    1172-1163
    1173-1164
    1174-1165
    1175-1166
    1176-1167
    1177-1168
    1178-1169
    1179-1170
    1180-1171
    1181-1172
    1182-1173
    1182-1178
    1183-1174
    1184-1175
    1185-1176
    1186-1177
    1188-1179
    1189-1180
    1189-1181
    1191-1182
    1192-1183
    1193-1184
    1194-1185
    1195-1186
    1196-1187
    1197-1188
    1198-1189
    1198-1191
    1199-1190
    1201-1192
    1202-1193
    1202-1196
    1203-1194
    1204-1195
    1206-1197
    1207-1198
    1208-1199
    1209-1200
    1209-1204
    1209-1205
    1210-1201
    1211-1202
    1212-1203
    1215-1206
    1216-1207
    1217-1208
    1218-1209
    1219-1210
    1220-1211
    1221-1212
    1221-1214
    1222-1213
    1224-1215
    1224-1218
    1225-1216
    1225-1220
    1225-1221
    1225-1222
    1226-1217
    1228-1219
    1232-1223
    1233-1224
    1234-1225
    1235-1226
    1236-1227
    1237-1228
    1238-1229
    1239-1230
    1239-1231
    1241-1232
    1242-1233
    1243-1234
    1244-1235
    1245-1236
    1245-1237
    1247-1238
    1248-1239
    1249-1240
    1250-1241
    1251-1242
    1251-1243
    1253-1244
    1254-1245
    1254-1246
    1256-1247
    1257-1248
    1258-1249
    1259-1250
    1260-1251
    1261-1252
    1261-1253
    1261-1254
    1264-1255
    1265-1256
    1266-1257
    1267-1258
    1268-1259
    1269-1260
    1270-1261
    1270-1264
    1271-1262
    1271-1266
    1271-1267
    1272-1263
    1274-1265
    1277-1268
    1278-1269
    1278-1271
    1279-1270
    1281-1272
    1282-1273
    1283-1274
    1284-1275
    1285-1276
    1286-1277
    1287-1278
    1288-1279
    1289-1280
    1290-1281
    1291-1282
    1292-1283
    1293-1284
    1294-1285
    1295-1286
    1296-1287
    1297-1288
    1297-1290
    1298-1289
    1300-1291
    1301-1292
    1302-1293
    1303-1294
    1303-1304
    1304-1295
    1305-1296
    1306-1297
    1307-1298
    1308-1299
    1308-1312
    1308-1316
    1308-1317
    1309-1300
    1310-1301
    1311-1302
    1312-1303
    1314-1305
    1315-1306
    1316-1307
    1317-1308
    1318-1309
    1319-1310
    1320-1311
    1322-1313
    1323-1314
    1324-1315
    1327-1318
    1327-1321
    1327-1325
    1327-1327
    1328-1319
    1328-1326
    1329-1320
    1331-1322
    1332-1323
    1333-1324
    1337-1328
    1338-1329
    1339-1330
    1340-1331
    1341-1332
    1342-1333
    1343-1334
    1344-1335
    1345-1336
    1346-1337
    1347-1338
    1348-1339
    1349-1340
    1350-1341
    1351-1342
    1352-1343
    1353-1344
    1354-1345
    1355-1346
    1355-1350
    1356-1347
    1356-1356
    1356-1357
    1357-1348
    1358-1349
    1360-1351
    1361-1352
    1362-1353
    1363-1354
    1364-1355
    1367-1358
    1368-1359
    1369-1360
    1370-1361
    1371-1362
    1372-1363
    1373-1364
    1374-1365
    1375-1366
    1376-1367
    1377-1368
    1378-1369
    1379-1370
    1380-1371
    1381-1372
    1382-1373
    1383-1374
    1384-1375
    1385-1376
    1386-1377
    1387-1378
    1388-1379
    1389-1380
    1390-1381
    1390-1401
    1390-1408
    1390-1409
    1391-1382
    1392-1383
    1393-1384
    1394-1385
    1395-1386
    1396-1387
    1397-1388
    1397-1417
    1398-1389
    1399-1390
    1400-1391
    1401-1392
    1402-1393
    1403-1394
    1404-1395
    1405-1396
    1406-1397
    1407-1398
    1408-1399
    1409-1400
    1411-1402
    1412-1403
    1413-1404
    1414-1405
    1415-1406
    1416-1407
    1419-1410
    1420-1411
    1421-1412
    1422-1413
    1423-1414
    1424-1415
    1425-1416
    1427-1418
    1428-1419
    1429-1420
    1430-1421
    1431-1422
    1432-1423
    1433-1424
    1434-1425
    1435-1426
    1436-1427
    1437-1428
    1438-1429
    1439-1430
    1440-1431
    1441-1432
    1441-1435
    1442-1433
    1442-1437
    1442-1438
    1443-1434
    1445-1436
    1448-1439
    1449-1440
    1450-1441
    1451-1442
    1452-1443
    1452-1446
    1453-1444
    1453-1453
    1453-1454
    1453-1455
    1454-1445
    1456-1447
    1457-1448
    1458-1449
    1459-1450
    1460-1451
    1461-1452
    1465-1456
    1465-1458
    1465-1459
    1466-1457
    1469-1460
    1470-1461
    1471-1462
    1471-1465
    1471-1467
    1471-1469
    1472-1463
    1472-1468
    1473-1464
    1475-1466
    1479-1470
    1479-1471
    1481-1472
    1481-1474
    1482-1473
    1484-1475
    1485-1476
    1486-1477
    1487-1478
    1487-1482
    1488-1479
    1489-1480
    1490-1481
    1492-1483
    1493-1484
    1494-1485
    1495-1486
    1495-1492
    1495-1493
    1496-1487
    1497-1488
    1498-1489
    1498-1491
    1499-1490
    1503-1494
    1504-1495
    1505-1496
    1506-1497
    1507-1498
    1508-1499
    1509-1500
    1509-1502
    1510-1501
    1512-1503
    1512-1505
    1512-1506
    1512-1507
    1513-1504
    1517-1508
    1518-1509
    1519-1510
    1519-1514
    1519-1515
    1519-1516
    1520-1511
    1521-1512
    1522-1513
    1526-1517
    1527-1518
    1528-1519
    1529-1520
    1530-1521
    1530-1524
    1531-1522
    1531-1528
    1531-1529
    1532-1523
    1534-1525
    1535-1526
    1536-1527
    1539-1530
    1540-1531
    1541-1532
    1542-1533
    1543-1534
    1543-1538
    1544-1535
    1544-1546
    1545-1536
    1546-1537
    1548-1539
    1549-1540
    1550-1541
    1551-1542
    1552-1543
    1553-1544
    1554-1545
    1556-1547
    1557-1548
    1558-1549
    1559-1550
    1560-1551
    1561-1552
    1562-1553
    1562-1554
    1562-1555
    1565-1556
    1566-1557
    1566-1563
    1566-1564
    1567-1558
    1568-1559
    1569-1560
    1569-1561
    1571-1562
    1574-1565
    1575-1566
    1575-1569
    1576-1567
    1576-1571
    1576-1572
    1577-1568
    1579-1570
    1582-1573
    1583-1574
    1583-1576
    1584-1575
    1584-1577
    1584-1578
    1584-1579
    1589-1580
    1590-1581
    1590-1583
    1590-1584
    1591-1582
    1594-1585
    1594-1587
    1595-1586
    1595-1588
    1595-1589
    1595-1590
    1600-1591
    1600-1592
    1602-1593
    1603-1594
    1604-1595
    1605-1596
    1606-1597
    1607-1598
    1608-1599
    1609-1600
    1610-1601
    1611-1602
    1612-1603
    1612-1605
    1613-1604
    1615-1606
    1616-1607
    1617-1608
    1618-1609
    1619-1610
    1620-1611
    1621-1612
    1622-1613
    1623-1614
    1624-1615
    1625-1616
    1626-1617
    1627-1618
    1628-1619
    1629-1620
    1630-1621
    1631-1622
    1632-1623
    1633-1624
    1633-1631
    1633-1634
    1633-1635
    1634-1625
    1635-1626
    1636-1627
    1637-1628
    1638-1629
    1639-1630
    1641-1632
    1642-1633
    1645-1636
    1646-1637
    1647-1638
    1648-1639
    1649-1640
    1650-1641
    1651-1642
    1652-1643
    1653-1644
    1654-1645
    1655-1646
    1656-1647
    1657-1648
    1658-1649
    1659-1650
    1660-1651
    1661-1652
    1662-1653
    1663-1654
    1664-1655
    1665-1656
    1666-1657
    1667-1658
    1668-1659
    1668-1661
    1669-1660
    1669-1663
    1669-1664
    1671-1662
    1674-1665
    1675-1666
    1675-1667
    1677-1668
    1677-1669
    1677-1670
    1677-1671
    1677-1672
    1682-1673
    1683-1674
    1683-1675
    1685-1676
    1686-1677
    1686-1678
    1686-1679
    1689-1680
    1690-1681
    1691-1682
    1692-1683
    1693-1684
    1694-1685
    1694-1686
    1694-1687
    1697-1688
    1698-1689
    1699-1690
    1700-1691
    1701-1692
    1702-1693
    1702-1694
    1704-1695
    1704-1696
    1704-1697
    1707-1698
    1708-1699
    1709-1700
    1709-1701
    1709-1702
    1712-1703
    1713-1704
    1714-1705
    1715-1706
    1716-1707
    1717-1708
    1717-1709
    1717-1710
    1720-1711
    1720-1714
    1720-1715
    1721-1712
    1722-1713
    1725-1716
    1726-1717
    1727-1718
    1728-1719
    1729-1720
    1730-1721
    1731-1722
    1732-1723
    1733-1724
    1734-1725
    1735-1726
    1736-1727
    1737-1728
    1737-1730
    1738-1729
    1738-1732
    1740-1731
    1742-1733
    1742-1735
    1743-1734
    1745-1736
    1746-1737
    1747-1738
    1748-1739
    1749-1740
    1750-1741
    1751-1742
    1752-1743
    1753-1744
    1754-1745
    1755-1746
    1755-1748
    1756-1747
    1756-1749
    1756-1750
    1760-1751
    1761-1752
    1762-1753
    1763-1754
    1764-1755
    1764-1756
    1764-1757
    1767-1758
    1768-1759
    1768-1761
    1769-1760
    1769-1762
    1769-1763
    1773-1764
    1774-1765
    1775-1766
    1776-1767
    1777-1768
    1778-1769
    1779-1770
    1779-1803
    1780-1771
    1780-1780
    1780-1782
    1781-1772
    1782-1773
    1783-1774
    1784-1775
    1785-1776
    1786-1777
    1787-1778
    1788-1779
    1790-1781
    1792-1783
    1793-1784
    1794-1785
    1795-1786
    1796-1787
    1797-1788
    1798-1789
    1799-1790
    1800-1791
    1801-1792
    1802-1793
    1803-1794
    1804-1795
    1805-1796
    1806-1797
    1807-1798
    1808-1799
    1809-1800
    1811-1802
    1813-1804
    1814-1805
    1815-1806
    1816-1807
    1817-1808
    1818-1809
    1819-1810
    1820-1811
    1821-1812
    1822-1813
    1823-1814
    1824-1815
    1825-1816
    1826-1817
    1827-1818
    1828-1819
    1829-1820
    1830-1821
    1831-1822
    1832-1823
    1833-1824
    1834-1825
    1835-1826
    1836-1827
    1837-1828
    1838-1829
    1839-1830
    1840-1831
    1841-1832
    1842-1833
    1843-1834
    1844-1835
    1845-1836
    1846-1837
    1847-1838
    1848-1839
    1849-1840
    1850-1841
    1851-1842
    1852-1843
    1853-1844
    1854-1845
    1855-1846
    1856-1847
    1857-1848
    1858-1849
    1859-1850
    1860-1851
    1861-1852
    1862-1853
    1863-1854
    1864-1855
    1865-1856
    1866-1857
    1867-1858
    1868-1859
    1869-1860
    1870-1861
    1870-1862
    1870-1865
    1870-1866
    1872-1863
    1873-1864
    1876-1867
    1877-1868
    1878-1869
    1879-1870
    1880-1871
    1880-1872
    1880-1873
    1883-1874
    1883-1877
    1884-1875
    1884-1881
    1884-1882
    1884-1883
    1885-1876
    1887-1878
    1888-1879
    1889-1880
    1893-1884
    1894-1885
    1895-1886
    1896-1887
    1897-1888
    1898-1889
    1899-1890
    1900-1891
    1901-1892
    1902-1893
    1903-1894
    1904-1895
    1905-1896
    1906-1897
    1907-1898
    1908-1899
    1909-1900
    1910-1901
    1910-1907
    1911-1902
    1911-1908
    1912-1903
    1912-1911
    1912-1915
    1912-1917
    1913-1904
    1913-1912
    1913-1916
    1913-1918
    1914-1905
    1915-1906
    1918-1909
    1919-1910
    1922-1913
    1923-1914
    1928-1919
    1929-1920
    1930-1921
    1931-1922
    1932-1923
    1933-1924
    1934-1925
    1935-1926
    1937-1928
    1938-1929
    1939-1930
    1940-1931
    1941-1932
    1942-1933
    1943-1934
    1944-1935
    1945-1936
    1946-1937
    1947-1938
    1948-1939
    1948-1941
    1949-1940
    1951-1942
    1952-1943
    1953-1944
    1953-1948
    1954-1945
    1954-1949
    1955-1946
    1956-1947
    1959-1950
    1960-1951
    1961-1952
    1962-1953
    1963-1954
    1964-1955
    1965-1956
    1966-1957
    1967-1958
    1968-1959
    1969-1960
    1970-1961
    1971-1962
    1972-1963
    1973-1964
    1974-1965
    1975-1966
    1976-1967
    1976-1970
    1977-1968
    1978-1969
    1978-1972
    1978-1973
    1980-1971
    1983-1974
    1984-1975
    1985-1976
    1986-1977
    1986-1979
    1986-1980
    1986-1981
    1987-1978
    1991-1982
    1992-1983
    1993-1984
    1994-1985
    1995-1986
    1996-1987
    1997-1988
    1998-1989
    1999-1990
    2000-1991
    2001-1992
    2002-1993
    2003-1994
    2004-1995
    2005-1996
    2005-1998
    2006-1997
    2008-1999
    2009-2000
    2010-2001
    2011-2002
    2011-2006
    2011-2007
    2012-2003
    2013-2004
    2014-2005
    2017-2008
    2017-2009
    2019-2010
    2020-2011
    2021-2012
    2021-2013
    2021-2014
    2024-2015
    2024-2017
    2025-2016
    2025-2019
    2027-2018
    2029-2020
    2030-2021
    2031-2022
    2032-2023
    2033-2024
    2034-2025
    2035-2026
    2036-2027
    2037-2028
    2038-2029
    2039-2030
    2040-2031
    2041-2032
    2042-2033
    2043-2034
    2044-2035
    2045-2036
    2046-2037
    2047-2038
    2048-2039
    2049-2040
    2050-2041
    2051-2042
    2052-2043
    2053-2044
    2054-2045
    2055-2046
    2056-2047
    2057-2048
    2058-2049
    2059-2050
    2060-2051
    2060-2052
    2062-2053
    2063-2054
    2064-2055
    2065-2056
    2066-2057
    2067-2058
    2068-2059
    2069-2060
    2070-2061
    2071-2062
    2072-2063
    2073-2064
    2074-2065
    2075-2066
    2076-2067
    2077-2068
    2078-2069
    2079-2070
    2079-2071
    2081-2072
    2082-2073
    ");

    Ok(())
}
