use gitlab_routes::{constraints, routes};
use std::error::Error;
use wayfind::Router;

#[path = "../benches/gitlab_routes.rs"]
pub mod gitlab_routes;

#[test]
fn test_gitlab_insert() -> Result<(), Box<dyn Error>> {
    let mut router = Router::new();
    constraints(&mut router);

    for route in routes() {
        let route = route.build()?;
        router.insert(&route, true)?;
    }

    Ok(())
}

#[test]
fn test_gitlab_delete() -> Result<(), Box<dyn Error>> {
    let mut router = Router::new();
    constraints(&mut router);

    for route in routes() {
        let route = route.build()?;
        router.insert(&route, true)?;
    }

    for route in routes() {
        let route = route.build()?;
        router.delete(&route)?;
    }

    insta::assert_snapshot!(router, @"");

    Ok(())
}

#[test]
fn test_gitlab_display() -> Result<(), Box<dyn Error>> {
    let mut router = Router::new();
    constraints(&mut router);

    for route in routes() {
        let route = route.build()?;
        router.insert(&route, true)?;
    }

    insta::assert_snapshot!(router, @r"
    === Path
    / [5]
    ├─ toogle_engine [1986]
    │  ╰─ /definitions [1984]
    │     ╰─ .
    │        ╰─ {format} [1984]
    ├─ dashboard [341]
    │  ├─ .
    │  │  ╰─ {format} [341]
    │  ╰─ /
    │     ├─ todos [353]
    │     │  ├─ .
    │     │  │  ╰─ {format} [353]
    │     │  ╰─ /
    │     │     ├─ bulk_restore [350]
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [350]
    │     │     ├─ destroy_all [352]
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [352]
    │     │     ├─ vue [355]
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [355]
    │     │     ╰─ {id} [351]
    │     │        ├─ /restore [354]
    │     │        │  ╰─ .
    │     │        │     ╰─ {format} [354]
    │     │        ╰─ .
    │     │           ╰─ {format} [351]
    │     ├─ activity [332]
    │     │  ╰─ .
    │     │     ╰─ {format} [332]
    │     ├─ projects [342]
    │     │  ├─ /
    │     │  │  ├─ contributed [343]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [343]
    │     │  │  ├─ inactive [344]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [344]
    │     │  │  ├─ personal [346]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [346]
    │     │  │  ├─ removed [347]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [347]
    │     │  │  ├─ starred [348]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [348]
    │     │  │  ╰─ member [345]
    │     │  │     ╰─ .
    │     │  │        ╰─ {format} [345]
    │     │  ╰─ .
    │     │     ╰─ {format} [342]
    │     ├─ snippets [349]
    │     │  ╰─ .
    │     │     ╰─ {format} [349]
    │     ├─ groups [338]
    │     │  ╰─ .
    │     │     ╰─ {format} [338]
    │     ├─ issues [333]
    │     │  ╰─ .
    │     │     ├─ ics [334]
    │     │     ╰─ {format} [333]
    │     ├─ labels [339]
    │     │  ╰─ .
    │     │     ╰─ {format} [339]
    │     ╰─ m
    │        ├─ erge_requests [335]
    │        │  ├─ /
    │        │  │  ├─ following [336]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [336]
    │        │  │  ╰─ search [337]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [337]
    │        │  ╰─ .
    │        │     ╰─ {format} [335]
    │        ╰─ ilestones [340]
    │           ╰─ .
    │              ╰─ {format} [340]
    ├─ explore [366]
    │  ├─ .
    │  │  ╰─ {format} [366]
    │  ╰─ /
    │     ├─ dependencies [364]
    │     │  ╰─ .
    │     │     ╰─ {format} [364]
    │     ├─ projects [367]
    │     │  ├─ /
    │     │  │  ├─ starred [370]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [370]
    │     │  │  ╰─ t
    │     │  │     ├─ rending [373]
    │     │  │     │  ╰─ .
    │     │  │     │     ╰─ {format} [373]
    │     │  │     ╰─ opics [372]
    │     │  │        ├─ .
    │     │  │        │  ╰─ {format} [372]
    │     │  │        ╰─ /
    │     │  │           ╰─ {topic_name:33} [371]
    │     │  │              ╰─ .
    │     │  │                 ╰─ {format:32} [371]
    │     │  ╰─ .
    │     │     ╰─ {format} [367]
    │     ├─ snippets [374]
    │     │  ╰─ .
    │     │     ╰─ {format} [374]
    │     ├─ catalog [362]
    │     │  ├─ .
    │     │  │  ╰─ {format} [362]
    │     │  ╰─ /
    │     │     ├─ {*full_path}
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [363]
    │     │     ╰─ {*full_path} [363]
    │     ╰─ groups [365]
    │        ╰─ .
    │           ╰─ {format} [365]
    ├─ v2 [504]
    │  ╰─ /
    │     ╰─ {*group_id}
    │        ╰─ /dependency_proxy/containers/
    │           ╰─ {*image:19}
    │              ╰─ /
    │                 ├─ manifests/
    │                 │  ├─ {*tag}
    │                 │  │  ╰─ /upload [510]
    │                 │  │     ╰─ /authorize [506]
    │                 │  ╰─ {*tag} [508]
    │                 ╰─ blobs/
    │                    ╰─ {sha:20} [507]
    │                       ╰─ /upload [509]
    │                          ╰─ /authorize [505]
    ├─ .well-known/
    │  ├─ oauth-authorization-server [887]
    │  │  ╰─ .
    │  │     ╰─ {format} [887]
    │  ├─ change-password [1858]
    │  │  ╰─ .
    │  │     ╰─ {format} [1858]
    │  ├─ terraform.json [1982]
    │  │  ╰─ .
    │  │     ╰─ {format} [1982]
    │  ╰─ security.txt [2080]
    │     ╰─ .
    │        ╰─ {format} [2080]
    ├─ import/
    │  ├─ url/validate [861]
    │  │  ╰─ .
    │  │     ╰─ {format} [861]
    │  ├─ manifest [853]
    │  │  ├─ /
    │  │  │  ├─ realtime_changes [855]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [855]
    │  │  │  ├─ status [856]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [856]
    │  │  │  ├─ upload [857]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [857]
    │  │  │  ╰─ new [854]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [854]
    │  │  ╰─ .
    │  │     ╰─ {format} [853]
    │  ├─ fogbugz [824]
    │  │  ├─ /
    │  │  │  ├─ realtime_changes [828]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [828]
    │  │  │  ├─ callback [823]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [823]
    │  │  │  ├─ status [829]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [829]
    │  │  │  ╰─ new [826]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [826]
    │  │  ╰─ .
    │  │     ╰─ {format} [824]
    │  ├─ history [852]
    │  │  ╰─ .
    │  │     ╰─ {format} [852]
    │  ├─ source_users/
    │  │  ╰─ {reassignment_token} [860]
    │  │     ├─ .
    │  │     │  ╰─ {format} [860]
    │  │     ╰─ /
    │  │        ├─ decline [859]
    │  │        │  ╰─ .
    │  │        │     ╰─ {format} [859]
    │  │        ╰─ accept [858]
    │  │           ╰─ .
    │  │              ╰─ {format} [858]
    │  ├─ git
    │  │  ├─ lab_
    │  │  │  ├─ project [850]
    │  │  │  │  ├─ /
    │  │  │  │  │  ├─ authorize [849]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [849]
    │  │  │  │  │  ╰─ new [851]
    │  │  │  │  │     ╰─ .
    │  │  │  │  │        ╰─ {format} [851]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [850]
    │  │  │  ╰─ group [848]
    │  │  │     ├─ /authorize [847]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [847]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [848]
    │  │  ├─ hub [839]
    │  │  │  ├─ _group/status [846]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [846]
    │  │  │  ├─ .
    │  │  │  │  ╰─ {format} [839]
    │  │  │  ╰─ /
    │  │  │     ├─ personal_access_token [843]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [843]
    │  │  │     ├─ realtime_changes [844]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [844]
    │  │  │     ├─ failures [841]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [841]
    │  │  │     ├─ details [840]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [840]
    │  │  │     ├─ status [845]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [845]
    │  │  │     ├─ new [842]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [842]
    │  │  │     ╰─ c
    │  │  │        ├─ ounts [838]
    │  │  │        │  ╰─ .
    │  │  │        │     ╰─ {format} [838]
    │  │  │        ╰─ a
    │  │  │           ├─ llback [835]
    │  │  │           │  ╰─ .
    │  │  │           │     ╰─ {format} [835]
    │  │  │           ╰─ ncel [836]
    │  │  │              ├─ _all [837]
    │  │  │              │  ╰─ .
    │  │  │              │     ╰─ {format} [837]
    │  │  │              ╰─ .
    │  │  │                 ╰─ {format} [836]
    │  │  ╰─ ea [830]
    │  │     ├─ /
    │  │     │  ├─ personal_access_token [832]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [832]
    │  │     │  ├─ realtime_changes [833]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [833]
    │  │     │  ├─ status [834]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [834]
    │  │     │  ╰─ new [831]
    │  │     │     ╰─ .
    │  │     │        ╰─ {format} [831]
    │  │     ╰─ .
    │  │        ╰─ {format} [830]
    │  ╰─ b
    │     ├─ ulk_imports [817]
    │     │  ├─ /
    │     │  │  ├─ realtime_changes [821]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [821]
    │     │  │  ├─ configure [816]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [816]
    │     │  │  ├─ history [819]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [819]
    │     │  │  ├─ status [822]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [822]
    │     │  │  ╰─ {id}
    │     │  │     ╰─ /history [820]
    │     │  │        ├─ .
    │     │  │        │  ╰─ {format} [820]
    │     │  │        ╰─ /
    │     │  │           ╰─ {entity_id}
    │     │  │              ╰─ /failures [818]
    │     │  │                 ╰─ .
    │     │  │                    ╰─ {format} [818]
    │     │  ╰─ .
    │     │     ╰─ {format} [817]
    │     ╰─ itbucket [807]
    │        ├─ _server [812]
    │        │  ├─ /
    │        │  │  ├─ realtime_changes [814]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [814]
    │        │  │  ├─ status [815]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [815]
    │        │  │  ├─ new [813]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [813]
    │        │  │  ╰─ c
    │        │  │     ├─ onfigure [811]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [811]
    │        │  │     ╰─ allback [810]
    │        │  │        ╰─ .
    │        │  │           ╰─ {format} [810]
    │        │  ╰─ .
    │        │     ╰─ {format} [812]
    │        ├─ .
    │        │  ╰─ {format} [807]
    │        ╰─ /
    │           ├─ realtime_changes [808]
    │           │  ╰─ .
    │           │     ╰─ {format} [808]
    │           ├─ callback [806]
    │           │  ╰─ .
    │           │     ╰─ {format} [806]
    │           ╰─ status [809]
    │              ╰─ .
    │                 ╰─ {format} [809]
    ├─ oauth/
    │  ├─ device/confirm [928]
    │  │  ╰─ .
    │  │     ╰─ {format} [928]
    │  ├─ token/info [934]
    │  │  ╰─ .
    │  │     ╰─ {format} [934]
    │  ├─ introspect [937]
    │  │  ╰─ .
    │  │     ╰─ {format} [937]
    │  ├─ userinfo [361]
    │  │  ╰─ .
    │  │     ╰─ {format} [361]
    │  ├─ geo/
    │  │  ├─ callback [932]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [932]
    │  │  ├─ logout [933]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [933]
    │  │  ╰─ auth [931]
    │  │     ╰─ .
    │  │        ╰─ {format} [931]
    │  ╰─ a
    │     ├─ uthorize [923]
    │     │  ├─ /native [924]
    │     │  │  ╰─ .
    │     │  │     ╰─ {format} [924]
    │     │  ├─ d_applications [926]
    │     │  │  ├─ .
    │     │  │  │  ╰─ {format} [926]
    │     │  │  ╰─ /
    │     │  │     ╰─ {id} [925]
    │     │  │        ╰─ .
    │     │  │           ╰─ {format} [925]
    │     │  ├─ _device [930]
    │     │  │  ╰─ .
    │     │  │     ╰─ {format} [930]
    │     │  ╰─ .
    │     │     ╰─ {format} [923]
    │     ╰─ pplications/
    │        ├─ new [916]
    │        │  ╰─ .
    │        │     ╰─ {format} [916]
    │        ╰─ {id}
    │           ╰─ /
    │              ├─ renew [917]
    │              │  ╰─ .
    │              │     ╰─ {format} [917]
    │              ╰─ edit [913]
    │                 ╰─ .
    │                    ╰─ {format} [913]
    ├─ rails/
    │  ├─ features [11]
    │  ├─ mailers [1800]
    │  │  ├─ .
    │  │  │  ╰─ {format} [1800]
    │  │  ╰─ /
    │  │     ╰─ {path} [1801]
    │  │        ╰─ .
    │  │           ╰─ {format} [1801]
    │  ├─ info [1797]
    │  │  ├─ /
    │  │  │  ├─ properties [1798]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [1798]
    │  │  │  ╰─ routes [1799]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [1799]
    │  │  ╰─ .
    │  │     ╰─ {format} [1797]
    │  ╰─ l
    │     ├─ etter_opener [7]
    │     ╰─ ookbook [8]
    ├─ u
    │  ├─ ploads/
    │  │  ├─ -/system/
    │  │  │  ├─ temp/
    │  │  │  │  ╰─ {secret}
    │  │  │  │     ╰─ /
    │  │  │  │        ╰─ {filename:0} [1994]
    │  │  │  │           ╰─ .
    │  │  │  │              ╰─ {format} [1994]
    │  │  │  ├─ {model:21}
    │  │  │  │  ╰─ /
    │  │  │  │     ╰─ {mounted_as:22}
    │  │  │  │        ╰─ /
    │  │  │  │           ╰─ {id}
    │  │  │  │              ╰─ /
    │  │  │  │                 ╰─ {filename:0} [1995]
    │  │  │  │                    ╰─ .
    │  │  │  │                       ╰─ {format} [1995]
    │  │  │  ├─ {model:23}
    │  │  │  │  ╰─ /
    │  │  │  │     ╰─ {mounted_as:24}
    │  │  │  │        ╰─ /
    │  │  │  │           ╰─ {id}
    │  │  │  │              ╰─ /
    │  │  │  │                 ╰─ {filename:0} [1996]
    │  │  │  │                    ╰─ .
    │  │  │  │                       ╰─ {format} [1996]
    │  │  │  ├─ {model:25}
    │  │  │  │  ╰─ /
    │  │  │  │     ╰─ {id:3}
    │  │  │  │        ╰─ /
    │  │  │  │           ╰─ {secret}
    │  │  │  │              ╰─ /
    │  │  │  │                 ╰─ {filename:0} [1997]
    │  │  │  │                    ╰─ .
    │  │  │  │                       ╰─ {format} [1997]
    │  │  │  ├─ {model:27}
    │  │  │  │  ╰─ /
    │  │  │  │     ╰─ {mounted_as:28}
    │  │  │  │        ╰─ /
    │  │  │  │           ╰─ {id}
    │  │  │  │              ╰─ /
    │  │  │  │                 ╰─ {filename:26} [1998]
    │  │  │  │                    ╰─ .
    │  │  │  │                       ╰─ {format} [1998]
    │  │  │  ├─ {model:29}
    │  │  │  │  ╰─ /
    │  │  │  │     ╰─ {mounted_as:22}
    │  │  │  │        ╰─ /
    │  │  │  │           ╰─ {id}
    │  │  │  │              ╰─ /
    │  │  │  │                 ╰─ {filename:0} [1999]
    │  │  │  │                    ╰─ .
    │  │  │  │                       ╰─ {format} [1999]
    │  │  │  ╰─ {model:30}
    │  │  │     ╰─ /
    │  │  │        ╰─ {mounted_as:31}
    │  │  │           ╰─ /
    │  │  │              ╰─ {id}
    │  │  │                 ╰─ /
    │  │  │                    ╰─ {filename:0} [2000]
    │  │  │                       ╰─ .
    │  │  │                          ╰─ {format} [2000]
    │  │  ╰─ {model:25} [1993]
    │  │     ├─ /authorize [1992]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [1992]
    │  │     ╰─ .
    │  │        ╰─ {format} [1993]
    │  ╰─ sers/
    │     ├─ identity_verification [2066]
    │     │  ├─ .
    │     │  │  ╰─ {format} [2066]
    │     │  ╰─ /
    │     │     ├─ toggle_phone_exemption [2068]
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [2068]
    │     │     ├─ arkose_labs_challenge [2062]
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [2062]
    │     │     ├─ verif
    │     │     │  ├─ y_
    │     │     │  │  ├─ phone_verification_code [2074]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [2074]
    │     │     │  │  ├─ arkose_labs_session [2070]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [2070]
    │     │     │  │  ├─ credit_card [2071]
    │     │     │  │  │  ├─ _captcha [2072]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [2072]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [2071]
    │     │     │  │  ╰─ email_code [2073]
    │     │     │  │     ╰─ .
    │     │     │  │        ╰─ {format} [2073]
    │     │     │  ╰─ ication_state [2069]
    │     │     │     ╰─ .
    │     │     │        ╰─ {format} [2069]
    │     │     ├─ res
    │     │     │  ├─ end_email_code [2063]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [2063]
    │     │     │  ╰─ tricted [2064]
    │     │     │     ╰─ .
    │     │     │        ╰─ {format} [2064]
    │     │     ╰─ s
    │     │        ├─ end_phone_verification_code [2065]
    │     │        │  ╰─ .
    │     │        │     ╰─ {format} [2065]
    │     │        ╰─ uccess [2067]
    │     │           ╰─ .
    │     │              ╰─ {format} [2067]
    │     ├─ resend_verification_code [1958]
    │     │  ╰─ .
    │     │     ╰─ {format} [1958]
    │     ├─ password [965]
    │     │  ├─ .
    │     │  │  ╰─ {format} [965]
    │     │  ╰─ /
    │     │     ├─ complexity [960]
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [960]
    │     │     ├─ edit [962]
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [962]
    │     │     ╰─ new [963]
    │     │        ╰─ .
    │     │           ╰─ {format} [963]
    │     ├─ edit [1871]
    │     │  ╰─ .
    │     │     ╰─ {format} [1871]
    │     ├─ a
    │     │  ├─ uth [1810]
    │     │  │  ├─ /
    │     │  │  │  ├─ kerberos/negotiate [940]
    │     │  │  │  │  ╰─ .
    │     │  │  │  │     ╰─ {format} [940]
    │     │  │  │  ╰─ geo/sign_out [1954]
    │     │  │  │     ╰─ .
    │     │  │  │        ╰─ {format} [1954]
    │     │  │  ╰─ .
    │     │  │     ╰─ {format} [1810]
    │     │  ╰─ lmost_there [322]
    │     │     ╰─ .
    │     │        ╰─ {format} [322]
    │     ├─ c
    │     │  ├─ onfirmation/new [326]
    │     │  │  ╰─ .
    │     │  │     ╰─ {format} [326]
    │     │  ╰─ ancel [1868]
    │     │     ╰─ .
    │     │        ╰─ {format} [1868]
    │     ├─ s
    │     │  ├─ uccessful_verification [1959]
    │     │  │  ╰─ .
    │     │  │     ╰─ {format} [1959]
    │     │  ╰─ ign_
    │     │     ├─ out [1955]
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [1955]
    │     │     ╰─ up [1872]
    │     │        ├─ /
    │     │        │  ├─ company [1875]
    │     │        │  │  ├─ /new [1876]
    │     │        │  │  │  ╰─ .
    │     │        │  │  │     ╰─ {format} [1876]
    │     │        │  │  ╰─ .
    │     │        │  │     ╰─ {format} [1875]
    │     │        │  ├─ welcome [1881]
    │     │        │  │  ╰─ .
    │     │        │  │     ╰─ {format} [1881]
    │     │        │  ╰─ groups [1877]
    │     │        │     ├─ /new [1878]
    │     │        │     │  ╰─ .
    │     │        │     │     ╰─ {format} [1878]
    │     │        │     ╰─ .
    │     │        │        ╰─ {format} [1877]
    │     │        ╰─ .
    │     │           ╰─ {format} [1872]
    │     ├─ u
    │     │  ├─ nlock/new [357]
    │     │  │  ╰─ .
    │     │  │     ╰─ {format} [357]
    │     │  ╰─ pdate_email [1960]
    │     │     ╰─ .
    │     │        ╰─ {format} [1960]
    │     ╰─ {username:35} [1853]
    │        ├─ /
    │        │  ├─ projects [2041]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [2041]
    │        │  ├─ unfollow [2046]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [2046]
    │        │  ├─ exists [2035]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [2035]
    │        │  ├─ follow [2036]
    │        │  │  ├─ ers [2037]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [2037]
    │        │  │  ├─ ing [2038]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [2038]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [2036]
    │        │  ├─ groups [2040]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [2040]
    │        │  ├─ a
    │        │  │  ├─ vailable_
    │        │  │  │  ├─ project_templates [2031]
    │        │  │  │  │  ╰─ .
    │        │  │  │  │     ╰─ {format} [2031]
    │        │  │  │  ╰─ group_templates [2030]
    │        │  │  │     ╰─ .
    │        │  │  │        ╰─ {format} [2030]
    │        │  │  ╰─ ctivity [2029]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [2029]
    │        │  ├─ c
    │        │  │  ├─ ontributed [2034]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [2034]
    │        │  │  ╰─ alendar [2032]
    │        │  │     ├─ _activities [2033]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [2033]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [2032]
    │        │  ╰─ s
    │        │     ├─ nippets [2043]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [2043]
    │        │     ╰─ tarred [2045]
    │        │        ╰─ .
    │        │           ╰─ {format} [2045]
    │        ╰─ .
    │           ╰─ {format} [1853]
    ├─ -/
    │  ├─ http_router/version [3]
    │  │  ╰─ .
    │  │     ╰─ {format} [3]
    │  ├─ kubernetes [320]
    │  │  ├─ .
    │  │  │  ╰─ {format} [320]
    │  │  ╰─ /
    │  │     ╰─ {agent_id} [321]
    │  │        ├─ .
    │  │        │  ╰─ {format} [321]
    │  │        ╰─ /
    │  │           ├─ {*vueroute}
    │  │           │  ╰─ .
    │  │           │     ╰─ {format} [321]
    │  │           ╰─ {*vueroute} [321]
    │  ├─ whats_new [2081]
    │  │  ╰─ .
    │  │     ╰─ {format} [2081]
    │  ├─ liveness [780]
    │  │  ╰─ .
    │  │     ╰─ {format} [780]
    │  ├─ user
    │  │  ├─ s/
    │  │  │  ├─ broadcast_message_dismissals [2047]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [2047]
    │  │  │  ├─ project_callouts [2061]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [2061]
    │  │  │  ├─ group_callouts [2049]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [2049]
    │  │  │  ├─ callouts [2048]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [2048]
    │  │  │  ╰─ terms [2077]
    │  │  │     ├─ .
    │  │  │     │  ╰─ {format} [2077]
    │  │  │     ╰─ /
    │  │  │        ╰─ {id}
    │  │  │           ╰─ /
    │  │  │              ├─ decline [2076]
    │  │  │              │  ╰─ .
    │  │  │              │     ╰─ {format} [2076]
    │  │  │              ╰─ accept [2075]
    │  │  │                 ╰─ .
    │  │  │                    ╰─ {format} [2075]
    │  │  ╰─ _settings/
    │  │     ├─ identities [2008]
    │  │     │  ├─ /new [2009]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [2009]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [2008]
    │  │     ├─ ssh_keys/
    │  │     │  ╰─ {id}
    │  │     │     ╰─ /revoke [2026]
    │  │     │        ╰─ .
    │  │     │           ╰─ {format} [2026]
    │  │     ├─ gpg_keys/
    │  │     │  ╰─ {id} [2005]
    │  │     │     ├─ /revoke [2007]
    │  │     │     │  ╰─ .
    │  │     │     │     ╰─ {format} [2007]
    │  │     │     ╰─ .
    │  │     │        ╰─ {format} [2005]
    │  │     ├─ a
    │  │     │  ├─ uthentication_log [2028]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [2028]
    │  │     │  ├─ ctive_sessions [2002]
    │  │     │  │  ├─ .
    │  │     │  │  │  ╰─ {format} [2002]
    │  │     │  │  ╰─ /
    │  │     │  │     ├─ saml [2003]
    │  │     │  │     │  ╰─ .
    │  │     │  │     │     ╰─ {format} [2003]
    │  │     │  │     ╰─ {id} [2001]
    │  │     │  │        ╰─ .
    │  │     │  │           ╰─ {format} [2001]
    │  │     │  ╰─ pplications [914]
    │  │     │     ╰─ .
    │  │     │        ╰─ {format} [914]
    │  │     ╰─ p
    │  │        ├─ assword [2015]
    │  │        │  ├─ .
    │  │        │  │  ╰─ {format} [2015]
    │  │        │  ╰─ /
    │  │        │     ├─ reset [2013]
    │  │        │     │  ╰─ .
    │  │        │     │     ╰─ {format} [2013]
    │  │        │     ├─ edit [2011]
    │  │        │     │  ╰─ .
    │  │        │     │     ╰─ {format} [2011]
    │  │        │     ╰─ new [2012]
    │  │        │        ╰─ .
    │  │        │           ╰─ {format} [2012]
    │  │        ├─ rofile [2022]
    │  │        │  ╰─ .
    │  │        │     ╰─ {format} [2022]
    │  │        ╰─ ersonal_access_tokens/
    │  │           ╰─ {id}
    │  │              ╰─ /r
    │  │                 ├─ evoke [2018]
    │  │                 │  ╰─ .
    │  │                 │     ╰─ {format} [2018]
    │  │                 ╰─ otate [2019]
    │  │                    ╰─ .
    │  │                       ╰─ {format} [2019]
    │  ├─ ex
    │  │  ├─ ternal_redirect [375]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [375]
    │  │  ╰─ periment [6]
    │  ├─ a
    │  │  ├─ rkose/data_exchange_payload [291]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [291]
    │  │  ├─ utocomplete/
    │  │  │  ├─ deploy_keys_with_owners [302]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [302]
    │  │  │  ├─ namespace_routes [306]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [306]
    │  │  │  ├─ group_subgroups [303]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [303]
    │  │  │  ├─ award_emojis [301]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [301]
    │  │  │  ├─ merge_request_
    │  │  │  │  ├─ source_branches [304]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [304]
    │  │  │  │  ╰─ target_branches [305]
    │  │  │  │     ╰─ .
    │  │  │  │        ╰─ {format} [305]
    │  │  │  ├─ project
    │  │  │  │  ├─ s [309]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [309]
    │  │  │  │  ╰─ _
    │  │  │  │     ├─ groups [307]
    │  │  │  │     │  ╰─ .
    │  │  │  │     │     ╰─ {format} [307]
    │  │  │  │     ╰─ routes [308]
    │  │  │  │        ╰─ .
    │  │  │  │           ╰─ {format} [308]
    │  │  │  ╰─ users [311]
    │  │  │     ├─ .
    │  │  │     │  ╰─ {format} [311]
    │  │  │     ╰─ /
    │  │  │        ╰─ {id} [310]
    │  │  │           ╰─ .
    │  │  │              ╰─ {format} [310]
    │  │  ├─ cme-challenge [14]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [14]
    │  │  ╰─ buse_reports [13]
    │  │     ├─ /add_category [12]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [12]
    │  │     ╰─ .
    │  │        ╰─ {format} [13]
    │  ├─ c
    │  │  ├─ ustomers_dot/proxy/graphql [331]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [331]
    │  │  ├─ haos/
    │  │  │  ├─ cpu_spin [313]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [313]
    │  │  │  ├─ db_spin [314]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [314]
    │  │  │  ├─ leakmem [317]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [317]
    │  │  │  ├─ sleep [319]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [319]
    │  │  │  ├─ kill [316]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [316]
    │  │  │  ├─ quit [318]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [318]
    │  │  │  ╰─ gc [315]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [315]
    │  │  ╰─ ountr
    │  │     ├─ y_states [330]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [330]
    │  │     ╰─ ies [329]
    │  │        ╰─ .
    │  │           ╰─ {format} [329]
    │  ├─ g
    │  │  ├─ oogle_api/auth/callback [396]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [396]
    │  │  ├─ itlab_subscriptions/hand_raise_leads [382]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [382]
    │  │  ├─ raphql-explorer [1]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [1]
    │  │  ╰─ /
    │  │     ╰─ {id} [643]
    │  │        ╰─ .
    │  │           ╰─ {format} [643]
    │  ├─ i
    │  │  ├─ de [789]
    │  │  │  ├─ ntity_verification [2051]
    │  │  │  │  ├─ /
    │  │  │  │  │  ├─ toggle_phone_exemption [2053]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [2053]
    │  │  │  │  │  ├─ verif
    │  │  │  │  │  │  ├─ ication_state [2054]
    │  │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │  │     ╰─ {format} [2054]
    │  │  │  │  │  │  ╰─ y_
    │  │  │  │  │  │     ├─ phone_verification_code [2057]
    │  │  │  │  │  │     │  ╰─ .
    │  │  │  │  │  │     │     ╰─ {format} [2057]
    │  │  │  │  │  │     ╰─ credit_card [2055]
    │  │  │  │  │  │        ├─ _captcha [2056]
    │  │  │  │  │  │        │  ╰─ .
    │  │  │  │  │  │        │     ╰─ {format} [2056]
    │  │  │  │  │  │        ╰─ .
    │  │  │  │  │  │           ╰─ {format} [2055]
    │  │  │  │  │  ╰─ s
    │  │  │  │  │     ├─ end_phone_verification_code [2050]
    │  │  │  │  │     │  ╰─ .
    │  │  │  │  │     │     ╰─ {format} [2050]
    │  │  │  │  │     ╰─ uccess [2052]
    │  │  │  │  │        ╰─ .
    │  │  │  │  │           ╰─ {format} [2052]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [2051]
    │  │  │  ╰─ /
    │  │  │     ├─ reset_oauth_application_settings [72]
    │  │  │     ├─ oauth_redirect [805]
    │  │  │     ╰─ project [790]
    │  │  │        ╰─ /
    │  │  │           ╰─ {project_id:2} [791]
    │  │  │              ╰─ /
    │  │  │                 ├─ blob [792]
    │  │  │                 │  ╰─ /
    │  │  │                 │     ├─ {*branch}
    │  │  │                 │     │  ╰─ /- [794]
    │  │  │                 │     │     ╰─ /
    │  │  │                 │     │        ╰─ {*path} [795]
    │  │  │                 │     ╰─ {*branch} [793]
    │  │  │                 ├─ edit [796]
    │  │  │                 │  ╰─ /
    │  │  │                 │     ├─ {*branch}
    │  │  │                 │     │  ╰─ /- [798]
    │  │  │                 │     │     ╰─ /
    │  │  │                 │     │        ╰─ {*path} [799]
    │  │  │                 │     ╰─ {*branch} [797]
    │  │  │                 ├─ tree [801]
    │  │  │                 │  ╰─ /
    │  │  │                 │     ├─ {*branch}
    │  │  │                 │     │  ╰─ /- [803]
    │  │  │                 │     │     ╰─ /
    │  │  │                 │     │        ╰─ {*path} [804]
    │  │  │                 │     ╰─ {*branch} [802]
    │  │  │                 ╰─ merge_requests/
    │  │  │                    ╰─ {merge_request_id:3} [800]
    │  │  ╰─ nvites/
    │  │     ╰─ {id:10} [864]
    │  │        ├─ .
    │  │        │  ╰─ {format} [864]
    │  │        ╰─ /
    │  │           ├─ decline [863]
    │  │           │  ╰─ .
    │  │           │     ╰─ {format} [863]
    │  │           ╰─ accept [862]
    │  │              ╰─ .
    │  │                 ╰─ {format} [862]
    │  ├─ j
    │  │  ├─ ira
    │  │  │  ├─ _connect [2]
    │  │  │  │  ├─ /
    │  │  │  │  │  ├─ workspaces/search [883]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [883]
    │  │  │  │  │  ├─ oauth_callbacks [874]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [874]
    │  │  │  │  │  ├─ app_descriptor [865]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [865]
    │  │  │  │  │  ├─ subscriptions [882]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [882]
    │  │  │  │  │  ├─ repositories/
    │  │  │  │  │  │  ├─ associate [876]
    │  │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │  │     ╰─ {format} [876]
    │  │  │  │  │  │  ╰─ search [877]
    │  │  │  │  │  │     ╰─ .
    │  │  │  │  │  │        ╰─ {format} [877]
    │  │  │  │  │  ├─ public_keys/
    │  │  │  │  │  │  ╰─ {id} [875]
    │  │  │  │  │  │     ╰─ .
    │  │  │  │  │  │        ╰─ {format} [875]
    │  │  │  │  │  ├─ branches/
    │  │  │  │  │  │  ├─ route [867]
    │  │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │  │     ╰─ {format} [867]
    │  │  │  │  │  │  ╰─ new [866]
    │  │  │  │  │  │     ╰─ .
    │  │  │  │  │  │        ╰─ {format} [866]
    │  │  │  │  │  ╰─ events/
    │  │  │  │  │     ├─ uninstalled [869]
    │  │  │  │  │     │  ╰─ .
    │  │  │  │  │     │     ╰─ {format} [869]
    │  │  │  │  │     ╰─ installed [868]
    │  │  │  │  │        ╰─ .
    │  │  │  │  │           ╰─ {format} [868]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [2]
    │  │  │  ╰─ /
    │  │  │     ╰─ {*namespace_id:53}
    │  │  │        ╰─ /
    │  │  │           ╰─ {project_id:53} [1802]
    │  │  │              ├─ /
    │  │  │              │  ├─ commit/
    │  │  │              │  │  ╰─ {id:47} [1803]
    │  │  │              │  │     ╰─ .
    │  │  │              │  │        ╰─ {format} [1803]
    │  │  │              │  ╰─ tree/
    │  │  │              │     ├─ {*id}
    │  │  │              │     │  ╰─ .
    │  │  │              │     │     ╰─ {format} [1804]
    │  │  │              │     ╰─ {*id} [1804]
    │  │  │              ╰─ .
    │  │  │                 ╰─ {format} [1802]
    │  │  ╰─ wks [884]
    │  │     ╰─ .
    │  │        ╰─ {format} [884]
    │  ├─ m
    │  │  ├─ e
    │  │  │  ├─ mbers/mailgun/permanent_failures [908]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [908]
    │  │  │  ╰─ trics [909]
    │  │  │     ├─ /system [910]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [910]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [909]
    │  │  ╰─ a
    │  │     ├─ ilgun/webhooks [907]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [907]
    │  │     ╰─ nifest [1795]
    │  │        ╰─ .
    │  │           ╰─ {format} [1795]
    │  ├─ o
    │  │  ├─ rganizations [953]
    │  │  │  ├─ .
    │  │  │  │  ╰─ {format} [953]
    │  │  │  ╰─ /
    │  │  │     ├─ preview_markdown [955]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [955]
    │  │  │     ├─ new [954]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [954]
    │  │  │     ╰─ {organization_path} [956]
    │  │  │        ├─ .
    │  │  │        │  ╰─ {format} [956]
    │  │  │        ╰─ /
    │  │  │           ├─ settings/general [959]
    │  │  │           │  ╰─ .
    │  │  │           │     ╰─ {format} [959]
    │  │  │           ├─ activity [951]
    │  │  │           │  ╰─ .
    │  │  │           │     ╰─ {format} [951]
    │  │  │           ├─ users [957]
    │  │  │           │  ╰─ .
    │  │  │           │     ╰─ {format} [957]
    │  │  │           ├─ projects/
    │  │  │           │  ╰─ {*namespace_id}
    │  │  │           │     ╰─ /
    │  │  │           │        ╰─ {id:4}
    │  │  │           │           ╰─ /edit [958]
    │  │  │           │              ╰─ .
    │  │  │           │                 ╰─ {format} [958]
    │  │  │           ╰─ groups
    │  │  │              ├─ _and_projects [952]
    │  │  │              │  ╰─ .
    │  │  │              │     ╰─ {format} [952]
    │  │  │              ╰─ /
    │  │  │                 ├─ new [950]
    │  │  │                 │  ╰─ .
    │  │  │                 │     ╰─ {format} [950]
    │  │  │                 ╰─ {*id}
    │  │  │                    ╰─ /edit [949]
    │  │  │                       ╰─ .
    │  │  │                          ╰─ {format} [949]
    │  │  ├─ perations [946]
    │  │  │  ├─ /environments [945]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [945]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [946]
    │  │  ╰─ ffline [1796]
    │  │     ╰─ .
    │  │        ╰─ {format} [1796]
    │  ├─ p
    │  │  ├─ hone_verification/telesign_callback [967]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [967]
    │  │  ├─ eek [9]
    │  │  ├─ ush_from_secondary/
    │  │  │  ╰─ {geo_node_id}
    │  │  │     ╰─ /
    │  │  │        ├─ {*repository_path:5}
    │  │  │        │  ╰─ /
    │  │  │        │     ├─ info/
    │  │  │        │     │  ├─ lfs/
    │  │  │        │     │  │  ├─ objects [1907]
    │  │  │        │     │  │  │  ╰─ /
    │  │  │        │     │  │  │     ├─ batch [1903]
    │  │  │        │     │  │  │     ╰─ {*oid} [1905]
    │  │  │        │     │  │  ╰─ locks [1909]
    │  │  │        │     │  │     ╰─ /
    │  │  │        │     │  │        ├─ verify [1927]
    │  │  │        │     │  │        ├─ new [1917]
    │  │  │        │     │  │        ╰─ {id} [1911]
    │  │  │        │     │  │           ╰─ /
    │  │  │        │     │  │              ├─ unlock [1921]
    │  │  │        │     │  │              ╰─ edit [1913]
    │  │  │        │     │  ╰─ refs [1897]
    │  │  │        │     ├─ ssh-
    │  │  │        │     │  ├─ receive-pack [1899]
    │  │  │        │     │  ╰─ upload-pack [1901]
    │  │  │        │     ╰─ git
    │  │  │        │        ├─ lab-lfs/objects/
    │  │  │        │        │  ├─ {*oid:6}
    │  │  │        │        │  │  ╰─ /
    │  │  │        │        │  │     ├─ {*size:7}
    │  │  │        │        │  │     │  ╰─ /authorize [1931]
    │  │  │        │        │  │     ╰─ {*size:7} [1933]
    │  │  │        │        │  ╰─ {*oid:6} [1929]
    │  │  │        │        ╰─ -
    │  │  │        │           ├─ receive-pack [1893]
    │  │  │        │           ╰─ upload-pack [1895]
    │  │  │        ├─ {*repository_path:9}
    │  │  │        │  ╰─ /info/refs [1806]
    │  │  │        ╰─ {*repository_path:8} [1805]
    │  │  ├─ rofile/
    │  │  │  ├─ two_factor_auth [1003]
    │  │  │  │  ├─ .
    │  │  │  │  │  ╰─ {format} [1003]
    │  │  │  │  ╰─ /
    │  │  │  │     ├─ skip [1004]
    │  │  │  │     │  ╰─ .
    │  │  │  │     │     ╰─ {format} [1004]
    │  │  │  │     ├─ destroy_
    │  │  │  │     │  ├─ otp [1001]
    │  │  │  │     │  │  ╰─ .
    │  │  │  │     │  │     ╰─ {format} [1001]
    │  │  │  │     │  ╰─ webauthn/
    │  │  │  │     │     ╰─ {id} [1002]
    │  │  │  │     │        ╰─ .
    │  │  │  │     │           ╰─ {format} [1002]
    │  │  │  │     ╰─ c
    │  │  │  │        ├─ reate_webauthn [999]
    │  │  │  │        │  ╰─ .
    │  │  │  │        │     ╰─ {format} [999]
    │  │  │  │        ╰─ odes [997]
    │  │  │  │           ╰─ .
    │  │  │  │              ╰─ {format} [997]
    │  │  │  ├─ u
    │  │  │  │  ├─ pdate_username [971]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [971]
    │  │  │  │  ╰─ sage_quotas [1005]
    │  │  │  │     ╰─ .
    │  │  │  │        ╰─ {format} [1005]
    │  │  │  ├─ notifications [991]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [991]
    │  │  │  ├─ preferences [994]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [994]
    │  │  │  ├─ billings [975]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [975]
    │  │  │  ├─ emails/
    │  │  │  │  ├─ confirmation/new [325]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [325]
    │  │  │  │  ╰─ {id} [984]
    │  │  │  │     ├─ /resend_confirmation_instructions [986]
    │  │  │  │     │  ╰─ .
    │  │  │  │     │     ╰─ {format} [986]
    │  │  │  │     ╰─ .
    │  │  │  │        ╰─ {format} [984]
    │  │  │  ├─ reset_
    │  │  │  │  ├─ incoming_email_token [969]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [969]
    │  │  │  │  ├─ static_object_token [970]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [970]
    │  │  │  │  ╰─ feed_token [968]
    │  │  │  │     ╰─ .
    │  │  │  │        ╰─ {format} [968]
    │  │  │  ├─ slack/
    │  │  │  │  ├─ slack_link [996]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [996]
    │  │  │  │  ╰─ edit [995]
    │  │  │  │     ╰─ .
    │  │  │  │        ╰─ {format} [995]
    │  │  │  ├─ a
    │  │  │  │  ├─ pplications [1856]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [1856]
    │  │  │  │  ├─ udit_log [1857]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [1857]
    │  │  │  │  ├─ ccount [972]
    │  │  │  │  │  ├─ /unlink [973]
    │  │  │  │  │  │  ╰─ .
    │  │  │  │  │  │     ╰─ {format} [973]
    │  │  │  │  │  ╰─ .
    │  │  │  │  │     ╰─ {format} [972]
    │  │  │  │  ╰─ vatar [974]
    │  │  │  │     ╰─ .
    │  │  │  │        ╰─ {format} [974]
    │  │  │  ╰─ c
    │  │  │     ├─ omment_templates [981]
    │  │  │     │  ├─ .
    │  │  │     │  │  ╰─ {format} [981]
    │  │  │     │  ╰─ /
    │  │  │     │     ╰─ {id} [982]
    │  │  │     │        ╰─ .
    │  │  │     │           ╰─ {format} [982]
    │  │  │     ╰─ hat_names/
    │  │  │        ├─ deny [977]
    │  │  │        │  ╰─ .
    │  │  │        │     ╰─ {format} [977]
    │  │  │        ├─ new [980]
    │  │  │        │  ╰─ .
    │  │  │        │     ╰─ {format} [980]
    │  │  │        ╰─ {id} [978]
    │  │  │           ╰─ .
    │  │  │              ╰─ {format} [978]
    │  │  ╰─ /
    │  │     ╰─ {id} [1606]
    │  │        ╰─ .
    │  │           ╰─ {format} [1606]
    │  ├─ r
    │  │  ├─ unner_setup/platforms [1936]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [1936]
    │  │  ╰─ e
    │  │     ├─ mote_development/workspaces
    │  │     │  ├─ _feature_flag [1892]
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [1892]
    │  │     │  ╰─ /
    │  │     │     ├─ new [1888]
    │  │     │     │  ╰─ .
    │  │     │     │     ╰─ {format} [1888]
    │  │     │     ├─ {id}
    │  │     │     │  ╰─ /edit [1884]
    │  │     │     │     ╰─ .
    │  │     │     │        ╰─ {format} [1884]
    │  │     │     ├─ {workspace_id}
    │  │     │     │  ╰─ /workspaces [1886]
    │  │     │     │     ├─ /new [1887]
    │  │     │     │     │  ╰─ .
    │  │     │     │     │     ╰─ {format} [1887]
    │  │     │     │     ╰─ .
    │  │     │     │        ╰─ {format} [1886]
    │  │     │     ╰─ {*vueroute}
    │  │     │        ╰─ /
    │  │     │           ├─ new [1888]
    │  │     │           │  ╰─ .
    │  │     │           │     ╰─ {format} [1888]
    │  │     │           ├─ {id}
    │  │     │           │  ╰─ /edit [1884]
    │  │     │           │     ╰─ .
    │  │     │           │        ╰─ {format} [1884]
    │  │     │           ╰─ {workspace_id}
    │  │     │              ╰─ /workspaces [1886]
    │  │     │                 ├─ /new [1887]
    │  │     │                 │  ╰─ .
    │  │     │                 │     ╰─ {format} [1887]
    │  │     │                 ╰─ .
    │  │     │                    ╰─ {format} [1886]
    │  │     ╰─ adiness [781]
    │  │        ╰─ .
    │  │           ╰─ {format} [781]
    │  ├─ s
    │  │  ├─ ubscriptions [385]
    │  │  │  ├─ .
    │  │  │  │  ╰─ {format} [385]
    │  │  │  ╰─ /
    │  │  │     ├─ validate_payment_method [389]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [389]
    │  │  │     ├─ groups [377]
    │  │  │     │  ├─ .
    │  │  │     │  │  ╰─ {format} [377]
    │  │  │     │  ╰─ /
    │  │  │     │     ├─ new [379]
    │  │  │     │     │  ╰─ .
    │  │  │     │     │     ╰─ {format} [379]
    │  │  │     │     ╰─ {id}
    │  │  │     │        ╰─ /edit [378]
    │  │  │     │           ╰─ .
    │  │  │     │              ╰─ {format} [378]
    │  │  │     ├─ new [386]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [386]
    │  │  │     ├─ payment_
    │  │  │     │  ├─ method [388]
    │  │  │     │  │  ╰─ .
    │  │  │     │  │     ╰─ {format} [388]
    │  │  │     │  ╰─ form [387]
    │  │  │     │     ╰─ .
    │  │  │     │        ╰─ {format} [387]
    │  │  │     ╰─ buy_
    │  │  │        ├─ minutes [383]
    │  │  │        │  ╰─ .
    │  │  │        │     ╰─ {format} [383]
    │  │  │        ╰─ storage [384]
    │  │  │           ╰─ .
    │  │  │              ╰─ {format} [384]
    │  │  ├─ martcard/
    │  │  │  ├─ extract_certificate [1963]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [1963]
    │  │  │  ├─ verify_certificate [1964]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [1964]
    │  │  │  ╰─ auth [1962]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [1962]
    │  │  ├─ nippets [1966]
    │  │  │  ├─ .
    │  │  │  │  ╰─ {format} [1966]
    │  │  │  ╰─ /
    │  │  │     ├─ preview_markdown [1969]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [1969]
    │  │  │     ├─ new [1968]
    │  │  │     │  ╰─ .
    │  │  │     │     ╰─ {format} [1968]
    │  │  │     ├─ {id:3} [1972]
    │  │  │     │  ├─ .
    │  │  │     │  │  ╰─ {format} [1972]
    │  │  │     │  ╰─ /
    │  │  │     │     ├─ toggle_award_emoji [1973]
    │  │  │     │     │  ╰─ .
    │  │  │     │     │     ╰─ {format} [1973]
    │  │  │     │     ├─ mark_as_spam [1967]
    │  │  │     │     │  ╰─ .
    │  │  │     │     │     ╰─ {format} [1967]
    │  │  │     │     ├─ edit [1965]
    │  │  │     │     │  ╰─ .
    │  │  │     │     │     ╰─ {format} [1965]
    │  │  │     │     ╰─ raw [1970]
    │  │  │     │        ╰─ .
    │  │  │     │           ╰─ {format} [1970]
    │  │  │     ╰─ {snippet_id:3}
    │  │  │        ╰─ /
    │  │  │           ├─ notes/
    │  │  │           │  ╰─ {id:3} [1981]
    │  │  │           │     ├─ .
    │  │  │           │     │  ╰─ {format} [1981]
    │  │  │           │     ╰─ /
    │  │  │           │        ├─ toggle_award_emoji [1979]
    │  │  │           │        │  ╰─ .
    │  │  │           │        │     ╰─ {format} [1979]
    │  │  │           │        ╰─ delete_attachment [1976]
    │  │  │           │           ╰─ .
    │  │  │           │              ╰─ {format} [1976]
    │  │  │           ╰─ raw/
    │  │  │              ╰─ {ref}
    │  │  │                 ╰─ /
    │  │  │                    ╰─ {*path} [1974]
    │  │  ├─ andbox/
    │  │  │  ├─ mermaid [1937]
    │  │  │  │  ╰─ .
    │  │  │  │     ╰─ {format} [1937]
    │  │  │  ╰─ swagger [1938]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [1938]
    │  │  ├─ /
    │  │  │  ╰─ {username:12} [1867]
    │  │  │     ╰─ .
    │  │  │        ╰─ {format} [1867]
    │  │  ╰─ e
    │  │     ├─ curity [1855]
    │  │     │  ├─ /
    │  │     │  │  ├─ vulnerabilities [1950]
    │  │     │  │  │  ╰─ .
    │  │     │  │  │     ╰─ {format} [1950]
    │  │     │  │  ├─ dashboard [1946]
    │  │     │  │  │  ├─ /settings [1945]
    │  │     │  │  │  │  ╰─ .
    │  │     │  │  │  │     ╰─ {format} [1945]
    │  │     │  │  │  ╰─ .
    │  │     │  │  │     ╰─ {format} [1946]
    │  │     │  │  ╰─ projects/
    │  │     │  │     ╰─ {id} [1948]
    │  │     │  │        ╰─ .
    │  │     │  │           ╰─ {format} [1948]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [1855]
    │  │     ╰─ nt_notifications/
    │  │        ╰─ {id:11}
    │  │           ╰─ /unsubscribe [1951]
    │  │              ╰─ .
    │  │                 ╰─ {format} [1951]
    │  ├─ t
    │  │  ├─ imelogs [1983]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [1983]
    │  │  ╰─ r
    │  │     ├─ ack_namespace_visits [2058]
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [2058]
    │  │     ╰─ ial
    │  │        ├─ _registrations [1990]
    │  │        │  ├─ /new [1991]
    │  │        │  │  ╰─ .
    │  │        │  │     ╰─ {format} [1991]
    │  │        │  ╰─ .
    │  │        │     ╰─ {format} [1990]
    │  │        ╰─ s [390]
    │  │           ├─ /
    │  │           │  ├─ duo_
    │  │           │  │  ├─ enterprise [392]
    │  │           │  │  │  ├─ /new [393]
    │  │           │  │  │  │  ╰─ .
    │  │           │  │  │  │     ╰─ {format} [393]
    │  │           │  │  │  ╰─ .
    │  │           │  │  │     ╰─ {format} [392]
    │  │           │  │  ╰─ pro [394]
    │  │           │  │     ├─ /new [395]
    │  │           │  │     │  ╰─ .
    │  │           │  │     │     ╰─ {format} [395]
    │  │           │  │     ╰─ .
    │  │           │  │        ╰─ {format} [394]
    │  │           │  ╰─ new [391]
    │  │           │     ╰─ .
    │  │           │        ╰─ {format} [391]
    │  │           ╰─ .
    │  │              ╰─ {format} [390]
    │  ╰─ {model:1}
    │     ╰─ /
    │        ╰─ {model_id}
    │           ╰─ /uploads/
    │              ╰─ {secret}
    │                 ╰─ /
    │                    ╰─ {filename:0} [312]
    │                       ╰─ .
    │                          ╰─ {format} [312]
    ├─ he
    │  ├─ alth_check [782]
    │  │  ├─ .
    │  │  │  ╰─ {format} [782]
    │  │  ╰─ /
    │  │     ╰─ {checks} [782]
    │  │        ╰─ .
    │  │           ╰─ {format} [782]
    │  ╰─ lp [784]
    │     ├─ /
    │     │  ├─ instance_configuration [785]
    │     │  │  ╰─ .
    │     │  │     ╰─ {format} [785]
    │     │  ├─ shortcuts [787]
    │     │  │  ╰─ .
    │     │  │     ╰─ {format} [787]
    │     │  ├─ d
    │     │  │  ├─ ocs [786]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format} [786]
    │     │  │  ╰─ rawers/
    │     │  │     ├─ {*markdown_file}
    │     │  │     │  ╰─ .
    │     │  │     │     ╰─ {format} [783]
    │     │  │     ╰─ {*markdown_file} [783]
    │     │  ├─ {*path}
    │     │  │  ╰─ .
    │     │  │     ╰─ {format} [788]
    │     │  ╰─ {*path} [788]
    │     ╰─ .
    │        ╰─ {format} [784]
    ├─ a
    │  ├─ pi/
    │  │  ├─ v4/geo/graphql [398]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [398]
    │  │  ╰─ graphql [397]
    │  │     ╰─ .
    │  │        ╰─ {format} [397]
    │  ╰─ dmin [114]
    │     ├─ .
    │     │  ╰─ {format} [114]
    │     ╰─ /
    │        ├─ namespace_limits [208]
    │        │  ├─ /export_usage [207]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [207]
    │        │  ╰─ .
    │        │     ╰─ {format} [208]
    │        ├─ organizations [209]
    │        │  ╰─ .
    │        │     ╰─ {format} [209]
    │        ├─ version_check [290]
    │        │  ╰─ .
    │        │     ╰─ {format} [290]
    │        ├─ jobs [190]
    │        │  ├─ /cancel_all [189]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [189]
    │        │  ╰─ .
    │        │     ╰─ {format} [190]
    │        ├─ elasticsearch/
    │        │  ├─ cancel_index_deletion [124]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [124]
    │        │  ├─ trigger_reindexing [127]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [127]
    │        │  ├─ retry_migration [126]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [126]
    │        │  ╰─ enqueue_index [125]
    │        │     ╰─ .
    │        │        ╰─ {format} [125]
    │        ├─ topics/
    │        │  ├─ preview_markdown [254]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [254]
    │        │  ├─ merge [252]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [252]
    │        │  ├─ new [253]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [253]
    │        │  ├─ {id} [256]
    │        │  │  ├─ /edit [250]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [250]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [256]
    │        │  ╰─ {topic_id}
    │        │     ╰─ /avatar [257]
    │        │        ╰─ .
    │        │           ╰─ {format} [257]
    │        ├─ us
    │        │  ├─ age_trends [258]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [258]
    │        │  ╰─ er
    │        │     ├─ _permission_exports [259]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [259]
    │        │     ╰─ s/
    │        │        ├─ new [276]
    │        │        │  ╰─ .
    │        │        │     ╰─ {format} [276]
    │        │        ├─ {user_id:34}
    │        │        │  ╰─ /i
    │        │        │     ├─ mpersonation_tokens/
    │        │        │     │  ╰─ {id:34}
    │        │        │     │     ╰─ /revoke [177]
    │        │        │     │        ╰─ .
    │        │        │     │           ╰─ {format} [177]
    │        │        │     ╰─ dentities/
    │        │        │        ├─ new [172]
    │        │        │        │  ╰─ .
    │        │        │        │     ╰─ {format} [172]
    │        │        │        ╰─ {id:34} [174]
    │        │        │           ├─ /edit [170]
    │        │        │           │  ╰─ .
    │        │        │           │     ╰─ {format} [170]
    │        │        │           ╰─ .
    │        │        │              ╰─ {format} [174]
    │        │        ╰─ {id:34}
    │        │           ╰─ /
    │        │              ├─ trust [283]
    │        │              │  ╰─ .
    │        │              │     ╰─ {format} [283]
    │        │              ├─ un
    │        │              │  ├─ trust [287]
    │        │              │  │  ╰─ .
    │        │              │  │     ╰─ {format} [287]
    │        │              │  ├─ lock [286]
    │        │              │  │  ╰─ .
    │        │              │  │     ╰─ {format} [286]
    │        │              │  ╰─ b
    │        │              │     ├─ lock [285]
    │        │              │     │  ╰─ .
    │        │              │     │     ╰─ {format} [285]
    │        │              │     ╰─ an [284]
    │        │              │        ╰─ .
    │        │              │           ╰─ {format} [284]
    │        │              ├─ edit [271]
    │        │              │  ╰─ .
    │        │              │     ╰─ {format} [271]
    │        │              ├─ keys [275]
    │        │              │  ╰─ .
    │        │              │     ╰─ {format} [275]
    │        │              ├─ re
    │        │              │  ├─ set_runners_minutes [281]
    │        │              │  │  ╰─ .
    │        │              │  │     ╰─ {format} [281]
    │        │              │  ├─ ject [279]
    │        │              │  │  ╰─ .
    │        │              │  │     ╰─ {format} [279]
    │        │              │  ╰─ move/
    │        │              │     ╰─ {email_id} [280]
    │        │              │        ╰─ .
    │        │              │           ╰─ {format} [280]
    │        │              ├─ a
    │        │              │  ├─ ctivate [260]
    │        │              │  │  ╰─ .
    │        │              │  │     ╰─ {format} [260]
    │        │              │  ╰─ pprove [261]
    │        │              │     ╰─ .
    │        │              │        ╰─ {format} [261]
    │        │              ├─ b
    │        │              │  ├─ lock [263]
    │        │              │  │  ╰─ .
    │        │              │  │     ╰─ {format} [263]
    │        │              │  ╰─ an [262]
    │        │              │     ╰─ .
    │        │              │        ╰─ {format} [262]
    │        │              ├─ c
    │        │              │  ├─ ard_match [264]
    │        │              │  │  ╰─ .
    │        │              │  │     ╰─ {format} [264]
    │        │              │  ╰─ onfirm [265]
    │        │              │     ╰─ .
    │        │              │        ╰─ {format} [265]
    │        │              ├─ d
    │        │              │  ├─ isable_two_factor [270]
    │        │              │  │  ╰─ .
    │        │              │  │     ╰─ {format} [270]
    │        │              │  ╰─ e
    │        │              │     ├─ stroy_identity_verification_exemption [269]
    │        │              │     │  ╰─ .
    │        │              │     │     ╰─ {format} [269]
    │        │              │     ╰─ activate [267]
    │        │              │        ╰─ .
    │        │              │           ╰─ {format} [267]
    │        │              ├─ i
    │        │              │  ├─ dentity_verification_exemption [272]
    │        │              │  │  ╰─ .
    │        │              │  │     ╰─ {format} [272]
    │        │              │  ╰─ mpersonate [273]
    │        │              │     ╰─ .
    │        │              │        ╰─ {format} [273]
    │        │              ╰─ p
    │        │                 ├─ hone_match [277]
    │        │                 │  ╰─ .
    │        │                 │     ╰─ {format} [277]
    │        │                 ╰─ rojects [278]
    │        │                    ╰─ .
    │        │                       ╰─ {format} [278]
    │        ├─ a
    │        │  ├─ i/self_hosted_models [24]
    │        │  │  ├─ .
    │        │  │  │  ╰─ {format} [24]
    │        │  │  ╰─ /
    │        │  │     ├─ {*vueroute}
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [24]
    │        │  │     ╰─ {*vueroute} [24]
    │        │  ├─ udit_log
    │        │  │  ├─ _reports [76]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format:14} [76]
    │        │  │  ╰─ s [77]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [77]
    │        │  ├─ buse_reports [19]
    │        │  │  ├─ .
    │        │  │  │  ╰─ {format} [19]
    │        │  │  ╰─ /
    │        │  │     ╰─ {id}
    │        │  │        ╰─ /moderate_user [20]
    │        │  │           ╰─ .
    │        │  │              ╰─ {format} [20]
    │        │  ╰─ pplication
    │        │     ├─ s/
    │        │     │  ├─ new [70]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [70]
    │        │     │  ╰─ {id}
    │        │     │     ╰─ /
    │        │     │        ├─ renew [71]
    │        │     │        │  ╰─ .
    │        │     │        │     ╰─ {format} [71]
    │        │     │        ╰─ edit [68]
    │        │     │           ╰─ .
    │        │     │              ╰─ {format} [68]
    │        │     ╰─ _settings/
    │        │        ├─ lets_encrypt_terms_of_service [33]
    │        │        │  ╰─ .
    │        │        │     ╰─ {format} [33]
    │        │        ├─ u
    │        │        │  ├─ pdate_microsoft_application [50]
    │        │        │  │  ╰─ .
    │        │        │  │     ╰─ {format} [50]
    │        │        │  ╰─ sage_data [51]
    │        │        │     ╰─ .
    │        │        │        ╰─ {format} [51]
    │        │        ├─ metrics_and_profiling [34]
    │        │        │  ╰─ .
    │        │        │     ╰─ {format} [34]
    │        │        ├─ integrations [32]
    │        │        │  ├─ .
    │        │        │  │  ╰─ {format} [32]
    │        │        │  ╰─ /
    │        │        │     ╰─ {id}
    │        │        │        ╰─ /
    │        │        │           ├─ overrides [184]
    │        │        │           │  ╰─ .
    │        │        │           │     ╰─ {format} [184]
    │        │        │           ├─ reset [185]
    │        │        │           │  ╰─ .
    │        │        │           │     ╰─ {format} [185]
    │        │        │           ├─ edit [183]
    │        │        │           │  ╰─ .
    │        │        │           │     ╰─ {format} [183]
    │        │        │           ╰─ test [186]
    │        │        │              ╰─ .
    │        │        │                 ╰─ {format} [186]
    │        │        ├─ preferences [37]
    │        │        │  ╰─ .
    │        │        │     ╰─ {format} [37]
    │        │        ├─ templates [47]
    │        │        │  ╰─ .
    │        │        │     ╰─ {format} [47]
    │        │        ├─ ge
    │        │        │  ├─ neral [31]
    │        │        │  │  ╰─ .
    │        │        │  │     ╰─ {format} [31]
    │        │        │  ╰─ o [140]
    │        │        │     ╰─ .
    │        │        │        ╰─ {format} [140]
    │        │        ├─ r
    │        │        │  ├─ oles_and_permissions [62]
    │        │        │  │  ├─ .
    │        │        │  │  │  ╰─ {format} [62]
    │        │        │  │  ╰─ /
    │        │        │  │     ├─ new [63]
    │        │        │  │     │  ╰─ .
    │        │        │  │     │     ╰─ {format} [63]
    │        │        │  │     ╰─ {id} [64]
    │        │        │  │        ├─ /edit [61]
    │        │        │  │        │  ╰─ .
    │        │        │  │        │     ╰─ {format} [61]
    │        │        │  │        ╰─ .
    │        │        │  │           ╰─ {format} [64]
    │        │        │  ╰─ e
    │        │        │     ├─ set_
    │        │        │     │  ├─ error_tracking_access_token [40]
    │        │        │     │  │  ╰─ .
    │        │        │     │  │     ╰─ {format} [40]
    │        │        │     │  ├─ health_check_token [41]
    │        │        │     │  │  ╰─ .
    │        │        │     │  │     ╰─ {format} [41]
    │        │        │     │  ╰─ registration_token [42]
    │        │        │     │     ╰─ .
    │        │        │     │        ╰─ {format} [42]
    │        │        │     ╰─ po
    │        │        │        ├─ sitory [39]
    │        │        │        │  ╰─ .
    │        │        │        │     ╰─ {format} [39]
    │        │        │        ╰─ rting [38]
    │        │        │           ╰─ .
    │        │        │              ╰─ {format} [38]
    │        │        ├─ a
    │        │        │  ├─ dvanced_search [27]
    │        │        │  │  ╰─ .
    │        │        │  │     ╰─ {format} [27]
    │        │        │  ├─ ppearance/
    │        │        │  │  ├─ p
    │        │        │  │  │  ├─ review_sign_in [56]
    │        │        │  │  │  │  ╰─ .
    │        │        │  │  │  │     ╰─ {format} [56]
    │        │        │  │  │  ╰─ wa_icon [57]
    │        │        │  │  │     ╰─ .
    │        │        │  │  │        ╰─ {format} [57]
    │        │        │  │  ├─ header_logos [54]
    │        │        │  │  │  ╰─ .
    │        │        │  │  │     ╰─ {format} [54]
    │        │        │  │  ├─ favicon [53]
    │        │        │  │  │  ╰─ .
    │        │        │  │  │     ╰─ {format} [53]
    │        │        │  │  ╰─ logo [55]
    │        │        │  │     ╰─ .
    │        │        │  │        ╰─ {format} [55]
    │        │        │  ╰─ nalytics [28]
    │        │        │     ╰─ .
    │        │        │        ╰─ {format} [28]
    │        │        ├─ c
    │        │        │  ├─ lear_repository_check_states [30]
    │        │        │  │  ╰─ .
    │        │        │  │     ╰─ {format} [30]
    │        │        │  ╰─ i_cd [29]
    │        │        │     ╰─ .
    │        │        │        ╰─ {format} [29]
    │        │        ├─ n
    │        │        │  ├─ amespace_storage [35]
    │        │        │  │  ╰─ .
    │        │        │  │     ╰─ {format} [35]
    │        │        │  ╰─ etwork [36]
    │        │        │     ╰─ .
    │        │        │        ╰─ {format} [36]
    │        │        ╰─ s
    │        │           ├─ cim_oauth [65]
    │        │           │  ╰─ .
    │        │           │     ╰─ {format} [65]
    │        │           ├─ lack [241]
    │        │           │  ├─ /slack_auth [242]
    │        │           │  │  ╰─ .
    │        │           │  │     ╰─ {format} [242]
    │        │           │  ├─ _app_manifest_
    │        │           │  │  ├─ download [45]
    │        │           │  │  │  ╰─ .
    │        │           │  │  │     ╰─ {format} [45]
    │        │           │  │  ╰─ share [46]
    │        │           │  │     ╰─ .
    │        │           │  │        ╰─ {format} [46]
    │        │           │  ╰─ .
    │        │           │     ╰─ {format} [241]
    │        │           ╰─ e
    │        │              ├─ curity_and_compliance [44]
    │        │              │  ╰─ .
    │        │              │     ╰─ {format} [44]
    │        │              ╰─ at_link_payload [43]
    │        │                 ╰─ .
    │        │                    ╰─ {format} [43]
    │        ├─ b
    │        │  ├─ roadcast_messages/
    │        │  │  ├─ preview [89]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [89]
    │        │  │  ╰─ {id} [91]
    │        │  │     ├─ /edit [87]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [87]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [91]
    │        │  ╰─ ackground_
    │        │     ├─ migrations [79]
    │        │     │  ├─ .
    │        │     │  │  ╰─ {format} [79]
    │        │     │  ╰─ /
    │        │     │     ├─ {id} [83]
    │        │     │     │  ├─ .
    │        │     │     │  │  ╰─ {format} [83]
    │        │     │     │  ╰─ /
    │        │     │     │     ├─ re
    │        │     │     │     │  ├─ sume [81]
    │        │     │     │     │  │  ╰─ .
    │        │     │     │     │  │     ╰─ {format} [81]
    │        │     │     │     │  ╰─ try [82]
    │        │     │     │     │     ╰─ .
    │        │     │     │     │        ╰─ {format} [82]
    │        │     │     │     ╰─ pause [80]
    │        │     │     │        ╰─ .
    │        │     │     │           ╰─ {format} [80]
    │        │     │     ╰─ {background_migration_id}
    │        │     │        ╰─ /batched_jobs/
    │        │     │           ╰─ {id} [84]
    │        │     │              ╰─ .
    │        │     │                 ╰─ {format} [84]
    │        │     ╰─ jobs [78]
    │        │        ╰─ .
    │        │           ╰─ {format} [78]
    │        ├─ c
    │        │  ├─ i/variables [94]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [94]
    │        │  ├─ lusters [101]
    │        │  │  ├─ .
    │        │  │  │  ╰─ {format} [101]
    │        │  │  ╰─ /
    │        │  │     ├─ new_cluster_docs [104]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [104]
    │        │  │     ├─ c
    │        │  │     │  ├─ reate_user [98]
    │        │  │     │  │  ╰─ .
    │        │  │     │  │     ╰─ {format} [98]
    │        │  │     │  ╰─ onnect [97]
    │        │  │     │     ╰─ .
    │        │  │     │        ╰─ {format} [97]
    │        │  │     ├─ {cluster_id}
    │        │  │     │  ╰─ /integration/create_or_update [108]
    │        │  │     │     ╰─ .
    │        │  │     │        ╰─ {format} [108]
    │        │  │     ╰─ {id}
    │        │  │        ╰─ /
    │        │  │           ├─ environments [100]
    │        │  │           │  ╰─ .
    │        │  │           │     ╰─ {format} [100]
    │        │  │           ├─ metrics [102]
    │        │  │           │  ├─ _dashboard [103]
    │        │  │           │  │  ╰─ .
    │        │  │           │  │     ╰─ {format} [103]
    │        │  │           │  ╰─ .
    │        │  │           │     ╰─ {format} [102]
    │        │  │           ╰─ cl
    │        │  │              ├─ uster_status [96]
    │        │  │              │  ╰─ .
    │        │  │              │     ╰─ {format} [96]
    │        │  │              ╰─ ear_cache [95]
    │        │  │                 ╰─ .
    │        │  │                    ╰─ {format} [95]
    │        │  ├─ o
    │        │  │  ├─ de_suggestions [1860]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [1860]
    │        │  │  ╰─ horts [109]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [109]
    │        │  ╰─ redentials [111]
    │        │     ├─ .
    │        │     │  ╰─ {format} [111]
    │        │     ╰─ /
    │        │        ├─ {id} [110]
    │        │        │  ├─ /revoke [113]
    │        │        │  │  ╰─ .
    │        │        │  │     ╰─ {format} [113]
    │        │        │  ╰─ .
    │        │        │     ╰─ {format} [110]
    │        │        ╰─ {credential_id}
    │        │           ╰─ /resources/
    │        │              ╰─ {resource_id}
    │        │                 ╰─ /revoke [112]
    │        │                    ╰─ .
    │        │                       ╰─ {format} [112]
    │        ├─ d
    │        │  ├─ ashboard/stats [115]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [115]
    │        │  ╰─ e
    │        │     ├─ v_ops_report [1859]
    │        │     │  ├─ s [123]
    │        │     │  │  ╰─ .
    │        │     │  │     ╰─ {format} [123]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [1859]
    │        │     ╰─ ploy_keys/
    │        │        ├─ new [120]
    │        │        │  ╰─ .
    │        │        │     ╰─ {format} [120]
    │        │        ╰─ {id} [122]
    │        │           ├─ /edit [118]
    │        │           │  ╰─ .
    │        │           │     ╰─ {format} [118]
    │        │           ╰─ .
    │        │              ╰─ {format} [122]
    │        ├─ g
    │        │  ├─ roups/
    │        │  │  ├─ new [153]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [153]
    │        │  │  ╰─ {*id}
    │        │  │     ╰─ /
    │        │  │        ├─ reset_runners_minutes [154]
    │        │  │        │  ╰─ .
    │        │  │        │     ╰─ {format:18} [154]
    │        │  │        ├─ members_update [152]
    │        │  │        │  ╰─ .
    │        │  │        │     ╰─ {format:18} [152]
    │        │  │        ╰─ edit [150]
    │        │  │           ╰─ .
    │        │  │              ╰─ {format:18} [150]
    │        │  ├─ eo [132]
    │        │  │  ├─ /
    │        │  │  │  ├─ replication [1865]
    │        │  │  │  │  ├─ .
    │        │  │  │  │  │  ╰─ {format} [1865]
    │        │  │  │  │  ╰─ /
    │        │  │  │  │     ╰─ {replicable_name_plural} [138]
    │        │  │  │  │        ╰─ .
    │        │  │  │  │           ╰─ {format} [138]
    │        │  │  │  ╰─ s
    │        │  │  │     ├─ ettings [143]
    │        │  │  │     │  ╰─ .
    │        │  │  │     │     ╰─ {format} [143]
    │        │  │  │     ╰─ ites/
    │        │  │  │        ├─ new [135]
    │        │  │  │        │  ╰─ .
    │        │  │  │        │     ╰─ {format} [135]
    │        │  │  │        ╰─ {id}
    │        │  │  │           ╰─ /
    │        │  │  │              ├─ replication [134]
    │        │  │  │              │  ├─ .
    │        │  │  │              │  │  ╰─ {format} [134]
    │        │  │  │              │  ╰─ /
    │        │  │  │              │     ╰─ {replicable_name_plural} [139]
    │        │  │  │              │        ╰─ .
    │        │  │  │              │           ╰─ {format} [139]
    │        │  │  │              ╰─ edit [131]
    │        │  │  │                 ╰─ .
    │        │  │  │                    ╰─ {format} [131]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [132]
    │        │  ╰─ it
    │        │     ├─ aly_servers [144]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [144]
    │        │     ╰─ lab_duo [145]
    │        │        ├─ /
    │        │        │  ├─ seat_utilization [147]
    │        │        │  │  ╰─ .
    │        │        │  │     ╰─ {format} [147]
    │        │        │  ╰─ configuration [146]
    │        │        │     ╰─ .
    │        │        │        ╰─ {format} [146]
    │        │        ╰─ .
    │        │           ╰─ {format} [145]
    │        ├─ h
    │        │  ├─ ealth_check [158]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [158]
    │        │  ╰─ ooks/
    │        │     ├─ {id} [167]
    │        │     │  ├─ .
    │        │     │  │  ╰─ {format} [167]
    │        │     │  ╰─ /
    │        │     │     ├─ edit [163]
    │        │     │     │  ╰─ .
    │        │     │     │     ╰─ {format} [163]
    │        │     │     ╰─ test [165]
    │        │     │        ╰─ .
    │        │     │           ╰─ {format} [165]
    │        │     ╰─ {hook_id}
    │        │        ╰─ /hook_logs/
    │        │           ╰─ {id} [160]
    │        │              ├─ /retry [159]
    │        │              │  ╰─ .
    │        │              │     ╰─ {format} [159]
    │        │              ╰─ .
    │        │                 ╰─ {format} [160]
    │        ├─ i
    │        │  ├─ n
    │        │  │  ├─ itial_setup/new [179]
    │        │  │  │  ╰─ .
    │        │  │  │     ╰─ {format} [179]
    │        │  │  ╰─ stance_review [182]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [182]
    │        │  ╰─ mpersonation [178]
    │        │     ╰─ .
    │        │        ╰─ {format} [178]
    │        ├─ l
    │        │  ├─ icense [204]
    │        │  │  ├─ /
    │        │  │  │  ├─ sync_seat_link [205]
    │        │  │  │  │  ╰─ .
    │        │  │  │  │     ╰─ {format} [205]
    │        │  │  │  ├─ usage_export [206]
    │        │  │  │  │  ╰─ .
    │        │  │  │  │     ╰─ {format} [206]
    │        │  │  │  ╰─ download [203]
    │        │  │  │     ╰─ .
    │        │  │  │        ╰─ {format} [203]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [204]
    │        │  ╰─ abels/
    │        │     ├─ new [197]
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [197]
    │        │     ╰─ {id}
    │        │        ╰─ /edit [195]
    │        │           ╰─ .
    │        │              ╰─ {format} [195]
    │        ├─ p
    │        │  ├─ lan_limits [210]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [210]
    │        │  ├─ ush_rule [221]
    │        │  │  ╰─ .
    │        │  │     ╰─ {format} [221]
    │        │  ╰─ rojects [213]
    │        │     ├─ .
    │        │     │  ╰─ {format} [213]
    │        │     ╰─ /
    │        │        ╰─ {*namespace_id}
    │        │           ╰─ /
    │        │              ├─ {project_id:4}
    │        │              │  ╰─ /runner_projects [223]
    │        │              │     ├─ .
    │        │              │     │  ╰─ {format} [223]
    │        │              │     ╰─ /
    │        │              │        ╰─ {id:4} [224]
    │        │              │           ╰─ .
    │        │              │              ╰─ {format} [224]
    │        │              ╰─ {id:4}
    │        │                 ╰─ /
    │        │                    ├─ repository_check [214]
    │        │                    │  ╰─ .
    │        │                    │     ╰─ {format} [214]
    │        │                    ├─ transfer [216]
    │        │                    │  ╰─ .
    │        │                    │     ╰─ {format} [216]
    │        │                    ╰─ edit [212]
    │        │                       ╰─ .
    │        │                          ╰─ {format} [212]
    │        ├─ r
    │        │  ├─ unners [228]
    │        │  │  ├─ .
    │        │  │  │  ╰─ {format} [228]
    │        │  │  ╰─ /
    │        │  │     ├─ runner_setup_scripts [233]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [233]
    │        │  │     ├─ dashboard [225]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [225]
    │        │  │     ├─ tag_list [235]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [235]
    │        │  │     ├─ new [229]
    │        │  │     │  ╰─ .
    │        │  │     │     ╰─ {format} [229]
    │        │  │     ╰─ {id}
    │        │  │        ╰─ /
    │        │  │           ├─ re
    │        │  │           │  ├─ gister [231]
    │        │  │           │  │  ╰─ .
    │        │  │           │  │     ╰─ {format} [231]
    │        │  │           │  ╰─ sume [232]
    │        │  │           │     ╰─ .
    │        │  │           │        ╰─ {format} [232]
    │        │  │           ├─ pause [230]
    │        │  │           │  ╰─ .
    │        │  │           │     ╰─ {format} [230]
    │        │  │           ╰─ edit [227]
    │        │  │              ╰─ .
    │        │  │                 ╰─ {format} [227]
    │        │  ╰─ ole_promotion_requests [222]
    │        │     ╰─ .
    │        │        ╰─ {format} [222]
    │        ╰─ s
    │           ├─ ubscription [246]
    │           │  ╰─ .
    │           │     ╰─ {format} [246]
    │           ├─ ystem_info [247]
    │           │  ╰─ .
    │           │     ╰─ {format} [247]
    │           ├─ pam_logs [244]
    │           │  ├─ .
    │           │  │  ╰─ {format} [244]
    │           │  ╰─ /
    │           │     ╰─ {id} [243]
    │           │        ├─ /mark_as_ham [245]
    │           │        │  ╰─ .
    │           │        │     ╰─ {format} [245]
    │           │        ╰─ .
    │           │           ╰─ {format} [243]
    │           ├─ ession [238]
    │           │  ├─ /
    │           │  │  ├─ destroy [239]
    │           │  │  │  ╰─ .
    │           │  │  │     ╰─ {format} [239]
    │           │  │  ╰─ new [240]
    │           │  │     ╰─ .
    │           │  │        ╰─ {format} [240]
    │           │  ╰─ .
    │           │     ╰─ {format} [238]
    │           ╰─ idekiq [10]
    ├─ f
    │  ├─ iles/note/
    │  │  ╰─ {id}
    │  │     ╰─ /
    │  │        ╰─ {filename:0} [1866]
    │  │           ╰─ .
    │  │              ╰─ {format} [1866]
    │  ╰─ avicon.
    │     ├─ ico [1807]
    │     │  ╰─ .
    │     │     ╰─ {format} [1807]
    │     ╰─ png [1808]
    │        ╰─ .
    │           ╰─ {format} [1808]
    ├─ g
    │  ├─ itlab_experiment_engine/
    │  │  ╰─ {id} [376]
    │  │     ╰─ .
    │  │        ╰─ {format} [376]
    │  ╰─ roups/
    │     ├─ new [410]
    │     │  ╰─ .
    │     │     ╰─ {format} [410]
    │     ├─ {*group_id:2}
    │     │  ╰─ /-/
    │     │     ├─ analytics/dashboards [448]
    │     │     │  ╰─ /
    │     │     │     ╰─ {*vueroute} [448]
    │     │     ├─ uploads/
    │     │     │  ╰─ {secret}
    │     │     │     ╰─ /
    │     │     │        ╰─ {filename:0} [756]
    │     │     ╰─ wikis/
    │     │        ├─ {*id}
    │     │        │  ╰─ /
    │     │        │     ├─ preview_markdown [771]
    │     │        │     ├─ history [768]
    │     │        │     ├─ diff [765]
    │     │        │     ├─ edit [766]
    │     │        │     ╰─ raw [772]
    │     │        ╰─ {*id} [764]
    │     ├─ {*group_id}
    │     │  ╰─ /-/
    │     │     ├─ w
    │     │     │  ├─ ikis/
    │     │     │  │  ├─ -/confluence [488]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [488]
    │     │     │  │  ├─ git_access [767]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [767]
    │     │     │  │  ├─ templates [774]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [774]
    │     │     │  │  ├─ pages [770]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [770]
    │     │     │  │  ╰─ new [769]
    │     │     │  │     ╰─ .
    │     │     │  │        ╰─ {format} [769]
    │     │     │  ╰─ ork_items [778]
    │     │     │     ├─ .
    │     │     │     │  ╰─ {format} [778]
    │     │     │     ╰─ /
    │     │     │        ╰─ {iid} [779]
    │     │     │           ├─ /descriptions/
    │     │     │           │  ╰─ {version_id} [776]
    │     │     │           │     ├─ /diff [777]
    │     │     │           │     │  ╰─ .
    │     │     │           │     │     ╰─ {format} [777]
    │     │     │           │     ╰─ .
    │     │     │           │        ╰─ {format} [776]
    │     │     │           ╰─ .
    │     │     │              ╰─ {format} [779]
    │     │     ├─ variables [762]
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [762]
    │     │     ├─ group_
    │     │     │  ├─ members [559]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [559]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ bulk_reassignment_file [556]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [556]
    │     │     │  │     ├─ export_csv [558]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [558]
    │     │     │  │     ├─ leave [560]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [560]
    │     │     │  │     ╰─ {id} [567]
    │     │     │  │        ├─ .
    │     │     │  │        │  ╰─ {format} [567]
    │     │     │  │        ╰─ /
    │     │     │  │           ├─ approve_access_request [554]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [554]
    │     │     │  │           ├─ resend_invite [564]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [564]
    │     │     │  │           ├─ override [561]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [561]
    │     │     │  │           ├─ unban [565]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [565]
    │     │     │  │           ╰─ ban [555]
    │     │     │  │              ╰─ .
    │     │     │  │                 ╰─ {format} [555]
    │     │     │  ╰─ links/
    │     │     │     ╰─ {id:16} [553]
    │     │     │        ╰─ .
    │     │     │           ╰─ {format} [553]
    │     │     ├─ epic
    │     │     │  ├─ _boards [515]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [515]
    │     │     │  │  ╰─ /
    │     │     │  │     ╰─ {id} [516]
    │     │     │  │        ╰─ .
    │     │     │  │           ╰─ {format} [516]
    │     │     │  ╰─ s/
    │     │     │     ├─ bulk_update [522]
    │     │     │     │  ╰─ .
    │     │     │     │     ╰─ {format} [522]
    │     │     │     ├─ new [530]
    │     │     │     │  ╰─ .
    │     │     │     │     ╰─ {format} [530]
    │     │     │     ├─ {epic_id:3}
    │     │     │     │  ╰─ /
    │     │     │     │     ├─ related_epic_links/
    │     │     │     │     │  ╰─ {id:3} [549]
    │     │     │     │     │     ╰─ .
    │     │     │     │     │        ╰─ {format} [549]
    │     │     │     │     ├─ issues/
    │     │     │     │     │  ╰─ {id:3} [521]
    │     │     │     │     │     ╰─ .
    │     │     │     │     │        ╰─ {format} [521]
    │     │     │     │     ├─ links/
    │     │     │     │     │  ╰─ {id:3} [541]
    │     │     │     │     │     ╰─ .
    │     │     │     │     │        ╰─ {format} [541]
    │     │     │     │     ╰─ notes/
    │     │     │     │        ╰─ {id:3} [547]
    │     │     │     │           ├─ /toggle_award_emoji [545]
    │     │     │     │           │  ╰─ .
    │     │     │     │           │     ╰─ {format} [545]
    │     │     │     │           ╰─ .
    │     │     │     │              ╰─ {format} [547]
    │     │     │     ╰─ {id:3}
    │     │     │        ╰─ /
    │     │     │           ├─ toggle_
    │     │     │           │  ├─ subscription [534]
    │     │     │           │  │  ╰─ .
    │     │     │           │  │     ╰─ {format} [534]
    │     │     │           │  ╰─ award_emoji [533]
    │     │     │           │     ╰─ .
    │     │     │           │        ╰─ {format} [533]
    │     │     │           ├─ realtime_changes [531]
    │     │     │           │  ╰─ .
    │     │     │           │     ╰─ {format} [531]
    │     │     │           ├─ edit [528]
    │     │     │           │  ╰─ .
    │     │     │           │     ╰─ {format} [528]
    │     │     │           ╰─ d
    │     │     │              ├─ iscussions [527]
    │     │     │              │  ╰─ .
    │     │     │              │     ╰─ {format} [527]
    │     │     │              ╰─ escriptions/
    │     │     │                 ╰─ {version_id} [524]
    │     │     │                    ├─ /diff [525]
    │     │     │                    │  ╰─ .
    │     │     │                    │     ╰─ {format} [525]
    │     │     │                    ╰─ .
    │     │     │                       ╰─ {format} [524]
    │     │     ├─ a
    │     │     │  ├─ chievements [423]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [423]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ new [424]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [424]
    │     │     │  │     ╰─ {id}
    │     │     │  │        ╰─ /edit [422]
    │     │     │  │           ╰─ .
    │     │     │  │              ╰─ {format} [422]
    │     │     │  ├─ vatar [466]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [466]
    │     │     │  ├─ dd_ons/discover_duo_
    │     │     │  │  ├─ enterprise [425]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [425]
    │     │     │  │  ╰─ pro [426]
    │     │     │  │     ╰─ .
    │     │     │  │        ╰─ {format} [426]
    │     │     │  ├─ nalytics [1861]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [1861]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ type_of_work/tasks_by_type [453]
    │     │     │  │     │  ├─ /top_labels [454]
    │     │     │  │     │  │  ╰─ .
    │     │     │  │     │  │     ╰─ {format} [454]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [453]
    │     │     │  │     ├─ merge_request_analytics [450]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [450]
    │     │     │  │     ├─ productivity_analytics [451]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [451]
    │     │     │  │     ├─ value_stream_analytics [429]
    │     │     │  │     │  ├─ /
    │     │     │  │     │  │  ├─ time_summary [439]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format} [439]
    │     │     │  │     │  │  ├─ cycle_times [436]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format} [436]
    │     │     │  │     │  │  ├─ lead_times [437]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format} [437]
    │     │     │  │     │  │  ├─ summary [438]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format} [438]
    │     │     │  │     │  │  ╰─ value_streams/
    │     │     │  │     │  │     ├─ new [444]
    │     │     │  │     │  │     │  ╰─ .
    │     │     │  │     │  │     │     ╰─ {format} [444]
    │     │     │  │     │  │     ├─ {id}
    │     │     │  │     │  │     │  ╰─ /edit [442]
    │     │     │  │     │  │     │     ╰─ .
    │     │     │  │     │  │     │        ╰─ {format} [442]
    │     │     │  │     │  │     ╰─ {value_stream_id}
    │     │     │  │     │  │        ╰─ /stages [433]
    │     │     │  │     │  │           ├─ .
    │     │     │  │     │  │           │  ╰─ {format} [433]
    │     │     │  │     │  │           ╰─ /
    │     │     │  │     │  │              ╰─ {id}
    │     │     │  │     │  │                 ╰─ /
    │     │     │  │     │  │                    ├─ average [430]
    │     │     │  │     │  │                    │  ├─ _duration_chart [431]
    │     │     │  │     │  │                    │  │  ╰─ .
    │     │     │  │     │  │                    │  │     ╰─ {format} [431]
    │     │     │  │     │  │                    │  ╰─ .
    │     │     │  │     │  │                    │     ╰─ {format} [430]
    │     │     │  │     │  │                    ├─ records [435]
    │     │     │  │     │  │                    │  ╰─ .
    │     │     │  │     │  │                    │     ╰─ {format} [435]
    │     │     │  │     │  │                    ├─ median [434]
    │     │     │  │     │  │                    │  ╰─ .
    │     │     │  │     │  │                    │     ╰─ {format} [434]
    │     │     │  │     │  │                    ╰─ count [432]
    │     │     │  │     │  │                       ╰─ .
    │     │     │  │     │  │                          ╰─ {format} [432]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [429]
    │     │     │  │     ├─ repository_analytics [452]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [452]
    │     │     │  │     ├─ devops_adoption [449]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [449]
    │     │     │  │     ╰─ c
    │     │     │  │        ├─ overage_reports [428]
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [428]
    │     │     │  │        ├─ ycle_analytics [1854]
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [1854]
    │     │     │  │        ╰─ i_cd [427]
    │     │     │  │           ╰─ .
    │     │     │  │              ╰─ {format} [427]
    │     │     │  ╰─ u
    │     │     │     ├─ tocomplete_sources/
    │     │     │     │  ├─ vulnerabilities [464]
    │     │     │     │  │  ╰─ .
    │     │     │     │  │     ╰─ {format} [464]
    │     │     │     │  ├─ commands [456]
    │     │     │     │  │  ╰─ .
    │     │     │     │  │     ╰─ {format} [456]
    │     │     │     │  ├─ labels [460]
    │     │     │     │  │  ╰─ .
    │     │     │     │  │     ╰─ {format} [460]
    │     │     │     │  ├─ epics [457]
    │     │     │     │  │  ╰─ .
    │     │     │     │  │     ╰─ {format} [457]
    │     │     │     │  ├─ wikis [465]
    │     │     │     │  │  ╰─ .
    │     │     │     │  │     ╰─ {format} [465]
    │     │     │     │  ├─ i
    │     │     │     │  │  ├─ terations [459]
    │     │     │     │  │  │  ╰─ .
    │     │     │     │  │  │     ╰─ {format} [459]
    │     │     │     │  │  ╰─ ssues [458]
    │     │     │     │  │     ╰─ .
    │     │     │     │  │        ╰─ {format} [458]
    │     │     │     │  ╰─ m
    │     │     │     │     ├─ ilestones [463]
    │     │     │     │     │  ╰─ .
    │     │     │     │     │     ╰─ {format} [463]
    │     │     │     │     ╰─ e
    │     │     │     │        ├─ rge_requests [462]
    │     │     │     │        │  ╰─ .
    │     │     │     │        │     ╰─ {format} [462]
    │     │     │     │        ╰─ mbers [461]
    │     │     │     │           ╰─ .
    │     │     │     │              ╰─ {format} [461]
    │     │     │     ╰─ dit_events [455]
    │     │     │        ╰─ .
    │     │     │           ╰─ {format} [455]
    │     │     ├─ b
    │     │     │  ├─ illings [467]
    │     │     │  │  ├─ /refresh_seats [468]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [468]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [467]
    │     │     │  ╰─ oards [469]
    │     │     │     ├─ .
    │     │     │     │  ╰─ {format} [469]
    │     │     │     ╰─ /
    │     │     │        ╰─ {id:3} [470]
    │     │     │           ╰─ .
    │     │     │              ╰─ {format} [470]
    │     │     ├─ c
    │     │     │  ├─ ustom_emoji [496]
    │     │     │  │  ├─ /new [497]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [497]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [496]
    │     │     │  ├─ hildren [471]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [471]
    │     │     │  ├─ lusters [478]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [478]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ new_cluster_docs [481]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [481]
    │     │     │  │     ├─ c
    │     │     │  │     │  ├─ reate_user [475]
    │     │     │  │     │  │  ╰─ .
    │     │     │  │     │  │     ╰─ {format} [475]
    │     │     │  │     │  ╰─ onnect [474]
    │     │     │  │     │     ╰─ .
    │     │     │  │     │        ╰─ {format} [474]
    │     │     │  │     ├─ {cluster_id}
    │     │     │  │     │  ╰─ /integration/create_or_update [485]
    │     │     │  │     │     ╰─ .
    │     │     │  │     │        ╰─ {format} [485]
    │     │     │  │     ╰─ {id}
    │     │     │  │        ╰─ /
    │     │     │  │           ├─ environments [477]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [477]
    │     │     │  │           ├─ metrics [479]
    │     │     │  │           │  ├─ _dashboard [480]
    │     │     │  │           │  │  ╰─ .
    │     │     │  │           │  │     ╰─ {format} [480]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [479]
    │     │     │  │           ╰─ cl
    │     │     │  │              ├─ uster_status [473]
    │     │     │  │              │  ╰─ .
    │     │     │  │              │     ╰─ {format} [473]
    │     │     │  │              ╰─ ear_cache [472]
    │     │     │  │                 ╰─ .
    │     │     │  │                    ╰─ {format} [472]
    │     │     │  ├─ adences/
    │     │     │  │  ├─ new [589]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [589]
    │     │     │  │  ├─ {iteration_cadence_id}
    │     │     │  │  │  ╰─ /iterations [592]
    │     │     │  │  │     ├─ /
    │     │     │  │  │     │  ├─ new [593]
    │     │     │  │  │     │  │  ╰─ .
    │     │     │  │  │     │  │     ╰─ {format} [593]
    │     │     │  │  │     │  ╰─ {id:3} [594]
    │     │     │  │  │     │     ├─ /edit [595]
    │     │     │  │  │     │     │  ╰─ .
    │     │     │  │  │     │     │     ╰─ {format} [595]
    │     │     │  │  │     │     ╰─ .
    │     │     │  │  │     │        ╰─ {format} [594]
    │     │     │  │  │     ╰─ .
    │     │     │  │  │        ╰─ {format} [592]
    │     │     │  │  ├─ {id}
    │     │     │  │  │  ╰─ /edit [591]
    │     │     │  │  │     ╰─ .
    │     │     │  │  │        ╰─ {format} [591]
    │     │     │  │  ╰─ {*vueroute}
    │     │     │  │     ╰─ /
    │     │     │  │        ├─ new [589]
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [589]
    │     │     │  │        ├─ {iteration_cadence_id}
    │     │     │  │        │  ╰─ /iterations [592]
    │     │     │  │        │     ├─ /
    │     │     │  │        │     │  ├─ new [593]
    │     │     │  │        │     │  │  ╰─ .
    │     │     │  │        │     │  │     ╰─ {format} [593]
    │     │     │  │        │     │  ╰─ {id:3} [594]
    │     │     │  │        │     │     ├─ /edit [595]
    │     │     │  │        │     │     │  ╰─ .
    │     │     │  │        │     │     │     ╰─ {format} [595]
    │     │     │  │        │     │     ╰─ .
    │     │     │  │        │     │        ╰─ {format} [594]
    │     │     │  │        │     ╰─ .
    │     │     │  │        │        ╰─ {format} [592]
    │     │     │  │        ╰─ {id}
    │     │     │  │           ╰─ /edit [591]
    │     │     │  │              ╰─ .
    │     │     │  │                 ╰─ {format} [591]
    │     │     │  ├─ rm/
    │     │     │  │  ├─ contacts [491]
    │     │     │  │  │  ├─ .
    │     │     │  │  │  │  ╰─ {format} [491]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ├─ new [492]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [492]
    │     │     │  │  │     ╰─ {id}
    │     │     │  │  │        ╰─ /edit [490]
    │     │     │  │  │           ╰─ .
    │     │     │  │  │              ╰─ {format} [490]
    │     │     │  │  ╰─ organizations [494]
    │     │     │  │     ├─ .
    │     │     │  │     │  ╰─ {format} [494]
    │     │     │  │     ╰─ /
    │     │     │  │        ├─ new [495]
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [495]
    │     │     │  │        ╰─ {id}
    │     │     │  │           ╰─ /edit [493]
    │     │     │  │              ╰─ .
    │     │     │  │                 ╰─ {format} [493]
    │     │     │  ╰─ o
    │     │     │     ├─ nt
    │     │     │     │  ├─ ribution_analytics [489]
    │     │     │     │  │  ╰─ .
    │     │     │     │  │     ╰─ {format} [489]
    │     │     │     │  ╰─ ainer_registries [644]
    │     │     │     │     ├─ .
    │     │     │     │     │  ╰─ {format} [644]
    │     │     │     │     ╰─ /
    │     │     │     │        ╰─ {id} [645]
    │     │     │     │           ╰─ .
    │     │     │     │              ╰─ {format} [645]
    │     │     │     ╰─ mment_templates [486]
    │     │     │        ├─ .
    │     │     │        │  ╰─ {format} [486]
    │     │     │        ╰─ /
    │     │     │           ╰─ {id} [487]
    │     │     │              ╰─ .
    │     │     │                 ╰─ {format} [487]
    │     │     ├─ d
    │     │     │  ├─ iscover [512]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [512]
    │     │     │  ╰─ ep
    │     │     │     ├─ loy_tokens/
    │     │     │     │  ╰─ {id:3}
    │     │     │     │     ╰─ /revoke [511]
    │     │     │     │        ╰─ .
    │     │     │     │           ╰─ {format} [511]
    │     │     │     ╰─ endenc
    │     │     │        ├─ y_proxy [503]
    │     │     │        │  ╰─ .
    │     │     │        │     ╰─ {format} [503]
    │     │     │        ╰─ ies [498]
    │     │     │           ├─ /l
    │     │     │           │  ├─ ocations [500]
    │     │     │           │  │  ╰─ .
    │     │     │           │  │     ╰─ {format} [500]
    │     │     │           │  ╰─ icenses [499]
    │     │     │           │     ╰─ .
    │     │     │           │        ╰─ {format} [499]
    │     │     │           ╰─ .
    │     │     │              ╰─ {format} [498]
    │     │     ├─ h
    │     │     │  ├─ arbor/repositories [569]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [569]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ {id:17} [570]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [570]
    │     │     │  │     ╰─ {repository_id:17}
    │     │     │  │        ╰─ /artifacts [568]
    │     │     │  │           ├─ .
    │     │     │  │           │  ╰─ {format} [568]
    │     │     │  │           ╰─ /
    │     │     │  │              ╰─ {artifact_id:17}
    │     │     │  │                 ╰─ /tags [571]
    │     │     │  │                    ╰─ .
    │     │     │  │                       ╰─ {format} [571]
    │     │     │  ╰─ ooks/
    │     │     │     ├─ {id:3} [580]
    │     │     │     │  ├─ .
    │     │     │     │  │  ╰─ {format} [580]
    │     │     │     │  ╰─ /
    │     │     │     │     ├─ edit [576]
    │     │     │     │     │  ╰─ .
    │     │     │     │     │     ╰─ {format} [576]
    │     │     │     │     ╰─ test [578]
    │     │     │     │        ╰─ .
    │     │     │     │           ╰─ {format} [578]
    │     │     │     ╰─ {hook_id:3}
    │     │     │        ╰─ /hook_logs/
    │     │     │           ╰─ {id:3} [573]
    │     │     │              ├─ /retry [572]
    │     │     │              │  ╰─ .
    │     │     │              │     ╰─ {format} [572]
    │     │     │              ╰─ .
    │     │     │                 ╰─ {format} [573]
    │     │     ├─ i
    │     │     │  ├─ n
    │     │     │  │  ├─ frastructure_registry [1863]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [1863]
    │     │     │  │  ╰─ sights [584]
    │     │     │  │     ├─ /query [583]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [583]
    │     │     │  │     ╰─ .
    │     │     │  │        ╰─ {format} [584]
    │     │     │  ├─ mport [581]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [581]
    │     │     │  ├─ terations [600]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [600]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ new [601]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [601]
    │     │     │  │     ╰─ {id:3} [602]
    │     │     │  │        ├─ /edit [599]
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [599]
    │     │     │  │        ╰─ .
    │     │     │  │           ╰─ {format} [602]
    │     │     │  ╰─ ssues
    │     │     │     ├─ /bulk_update [585]
    │     │     │     │  ╰─ .
    │     │     │     │     ╰─ {format} [585]
    │     │     │     ╰─ _analytics [586]
    │     │     │        ╰─ .
    │     │     │           ╰─ {format} [586]
    │     │     ├─ l
    │     │     │  ├─ dap
    │     │     │  │  ├─ /sync [614]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [614]
    │     │     │  │  ╰─ _group_links/
    │     │     │  │     ╰─ {id} [612]
    │     │     │  │        ╰─ .
    │     │     │  │           ╰─ {format} [612]
    │     │     │  ╰─ abels/
    │     │     │     ├─ new [607]
    │     │     │     │  ╰─ .
    │     │     │     │     ╰─ {format} [607]
    │     │     │     ╰─ {id} [610]
    │     │     │        ├─ .
    │     │     │        │  ╰─ {format} [610]
    │     │     │        ╰─ /
    │     │     │           ├─ toggle_subscription [608]
    │     │     │           │  ╰─ .
    │     │     │           │     ╰─ {format} [608]
    │     │     │           ╰─ edit [605]
    │     │     │              ╰─ .
    │     │     │                 ╰─ {format} [605]
    │     │     ├─ m
    │     │     │  ├─ erge_requests/bulk_update [615]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [615]
    │     │     │  ╰─ ilestones/
    │     │     │     ├─ new [623]
    │     │     │     │  ╰─ .
    │     │     │     │     ╰─ {format} [623]
    │     │     │     ╰─ {id:0}
    │     │     │        ╰─ /
    │     │     │           ├─ merge_requests [622]
    │     │     │           │  ╰─ .
    │     │     │           │     ╰─ {format} [622]
    │     │     │           ├─ participants [624]
    │     │     │           │  ╰─ .
    │     │     │           │     ╰─ {format} [624]
    │     │     │           ├─ issues [620]
    │     │     │           │  ╰─ .
    │     │     │           │     ╰─ {format} [620]
    │     │     │           ├─ labels [621]
    │     │     │           │  ╰─ .
    │     │     │           │     ╰─ {format} [621]
    │     │     │           ╰─ edit [618]
    │     │     │              ╰─ .
    │     │     │                 ╰─ {format} [618]
    │     │     ├─ p
    │     │     │  ├─ ackages [631]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [631]
    │     │     │  │  ╰─ /
    │     │     │  │     ╰─ {id} [632]
    │     │     │  │        ╰─ .
    │     │     │  │           ╰─ {format} [632]
    │     │     │  ╰─ r
    │     │     │     ├─ otected_
    │     │     │     │  ├─ environments [637]
    │     │     │     │  │  ├─ .
    │     │     │     │  │  │  ╰─ {format} [637]
    │     │     │     │  │  ╰─ /
    │     │     │     │  │     ╰─ {id} [640]
    │     │     │     │  │        ╰─ .
    │     │     │     │  │           ╰─ {format} [640]
    │     │     │     │  ╰─ branches [633]
    │     │     │     │     ├─ .
    │     │     │     │     │  ╰─ {format} [633]
    │     │     │     │     ╰─ /
    │     │     │     │        ╰─ {id} [636]
    │     │     │     │           ╰─ .
    │     │     │     │              ╰─ {format} [636]
    │     │     │     ╰─ eview_markdown [411]
    │     │     │        ╰─ .
    │     │     │           ╰─ {format} [411]
    │     │     ├─ r
    │     │     │  ├─ unners [651]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [651]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ dashboard [648]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [648]
    │     │     │  │     ├─ new [652]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [652]
    │     │     │  │     ╰─ {id}
    │     │     │  │        ╰─ /
    │     │     │  │           ├─ re
    │     │     │  │           │  ├─ gister [654]
    │     │     │  │           │  │  ╰─ .
    │     │     │  │           │  │     ╰─ {format} [654]
    │     │     │  │           │  ╰─ sume [655]
    │     │     │  │           │     ╰─ .
    │     │     │  │           │        ╰─ {format} [655]
    │     │     │  │           ├─ pause [653]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [653]
    │     │     │  │           ╰─ edit [650]
    │     │     │  │              ╰─ .
    │     │     │  │                 ╰─ {format} [650]
    │     │     │  ├─ oadmap [647]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [647]
    │     │     │  ╰─ e
    │     │     │     ├─ leases [646]
    │     │     │     │  ╰─ .
    │     │     │     │     ╰─ {format} [646]
    │     │     │     ╰─ store [413]
    │     │     │        ╰─ .
    │     │     │           ╰─ {format} [413]
    │     │     ├─ s
    │     │     │  ├─ hared_projects [748]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [748]
    │     │     │  ├─ cim_oauth [667]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [667]
    │     │     │  ├─ aml
    │     │     │  │  ├─ /
    │     │     │  │  │  ├─ u
    │     │     │  │  │  │  ├─ pdate_microsoft_application [666]
    │     │     │  │  │  │  │  ╰─ .
    │     │     │  │  │  │  │     ╰─ {format} [666]
    │     │     │  │  │  │  ╰─ nlink [751]
    │     │     │  │  │  │     ╰─ .
    │     │     │  │  │  │        ╰─ {format} [751]
    │     │     │  │  │  ╰─ callback [630]
    │     │     │  │  │     ╰─ .
    │     │     │  │  │        ╰─ {format} [630]
    │     │     │  │  ╰─ _group_links/
    │     │     │  │     ╰─ {id} [660]
    │     │     │  │        ╰─ .
    │     │     │  │           ╰─ {format} [660]
    │     │     │  ╰─ e
    │     │     │     ├─ at_usage [668]
    │     │     │     │  ╰─ .
    │     │     │     │     ╰─ {format} [668]
    │     │     │     ├─ ttings/
    │     │     │     │  ├─ packages_and_registries [735]
    │     │     │     │  │  ╰─ .
    │     │     │     │  │     ╰─ {format} [735]
    │     │     │     │  ├─ i
    │     │     │     │  │  ├─ ntegrations [728]
    │     │     │     │  │  │  ├─ .
    │     │     │     │  │  │  │  ╰─ {format} [728]
    │     │     │     │  │  │  ╰─ /
    │     │     │     │  │  │     ╰─ {id}
    │     │     │     │  │  │        ╰─ /
    │     │     │     │  │  │           ├─ reset [729]
    │     │     │     │  │  │           │  ╰─ .
    │     │     │     │  │  │           │     ╰─ {format} [729]
    │     │     │     │  │  │           ├─ edit [727]
    │     │     │     │  │  │           │  ╰─ .
    │     │     │     │  │  │           │     ╰─ {format} [727]
    │     │     │     │  │  │           ╰─ test [730]
    │     │     │     │  │  │              ╰─ .
    │     │     │     │  │  │                 ╰─ {format} [730]
    │     │     │     │  │  ╰─ ssues [747]
    │     │     │     │  │     ╰─ .
    │     │     │     │  │        ╰─ {format} [747]
    │     │     │     │  ├─ gitlab_duo [724]
    │     │     │     │  │  ├─ _usage [1862]
    │     │     │     │  │  │  ╰─ .
    │     │     │     │  │  │     ╰─ {format} [1862]
    │     │     │     │  │  ├─ .
    │     │     │     │  │  │  ╰─ {format} [724]
    │     │     │     │  │  ╰─ /
    │     │     │     │  │     ├─ seat_utilization [726]
    │     │     │     │  │     │  ╰─ .
    │     │     │     │  │     │     ╰─ {format} [726]
    │     │     │     │  │     ╰─ configuration [725]
    │     │     │     │  │        ╰─ .
    │     │     │     │  │           ╰─ {format} [725]
    │     │     │     │  ├─ workspaces [736]
    │     │     │     │  │  ╰─ .
    │     │     │     │  │     ╰─ {format} [736]
    │     │     │     │  ├─ ci_cd [712]
    │     │     │     │  │  ├─ /
    │     │     │     │  │  │  ├─ deploy_token/create [738]
    │     │     │     │  │  │  │  ╰─ .
    │     │     │     │  │  │  │     ╰─ {format} [738]
    │     │     │     │  │  │  ├─ update_auto_devops [713]
    │     │     │     │  │  │  │  ╰─ .
    │     │     │     │  │  │  │     ╰─ {format} [713]
    │     │     │     │  │  │  ╰─ r
    │     │     │     │  │  │     ├─ eset_registration_token [708]
    │     │     │     │  │  │     │  ╰─ .
    │     │     │     │  │  │     │     ╰─ {format} [708]
    │     │     │     │  │  │     ╰─ unner_setup_scripts [709]
    │     │     │     │  │  │        ╰─ .
    │     │     │     │  │  │           ╰─ {format} [709]
    │     │     │     │  │  ╰─ .
    │     │     │     │  │     ╰─ {format} [712]
    │     │     │     │  ├─ slack [745]
    │     │     │     │  │  ├─ /slack_auth [746]
    │     │     │     │  │  │  ╰─ .
    │     │     │     │  │  │     ╰─ {format} [746]
    │     │     │     │  │  ╰─ .
    │     │     │     │  │     ╰─ {format} [745]
    │     │     │     │  ├─ domain_verification/
    │     │     │     │  │  ├─ new [718]
    │     │     │     │  │  │  ╰─ .
    │     │     │     │  │  │     ╰─ {format} [718]
    │     │     │     │  │  ╰─ {id:0}
    │     │     │     │  │     ╰─ /
    │     │     │     │  │        ├─ clean_certificate [714]
    │     │     │     │  │        │  ╰─ .
    │     │     │     │  │        │     ╰─ {format} [714]
    │     │     │     │  │        ├─ retry_auto_ssl [719]
    │     │     │     │  │        │  ╰─ .
    │     │     │     │  │        │     ╰─ {format} [719]
    │     │     │     │  │        ╰─ verify [723]
    │     │     │     │  │           ╰─ .
    │     │     │     │  │              ╰─ {format} [723]
    │     │     │     │  ├─ a
    │     │     │     │  │  ├─ pplications/
    │     │     │     │  │  │  ├─ new [703]
    │     │     │     │  │  │  │  ╰─ .
    │     │     │     │  │  │  │     ╰─ {format} [703]
    │     │     │     │  │  │  ╰─ {id}
    │     │     │     │  │  │     ╰─ /
    │     │     │     │  │  │        ├─ renew [704]
    │     │     │     │  │  │        │  ╰─ .
    │     │     │     │  │  │        │     ╰─ {format} [704]
    │     │     │     │  │  │        ╰─ edit [701]
    │     │     │     │  │  │           ╰─ .
    │     │     │     │  │  │              ╰─ {format} [701]
    │     │     │     │  │  ├─ nalytics [698]
    │     │     │     │  │  │  ╰─ .
    │     │     │     │  │  │     ╰─ {format} [698]
    │     │     │     │  │  ╰─ ccess_tokens/
    │     │     │     │  │     ╰─ {id}
    │     │     │     │  │        ╰─ /revoke [695]
    │     │     │     │  │           ╰─ .
    │     │     │     │  │              ╰─ {format} [695]
    │     │     │     │  ╰─ r
    │     │     │     │     ├─ oles_and_permissions [742]
    │     │     │     │     │  ├─ .
    │     │     │     │     │  │  ╰─ {format} [742]
    │     │     │     │     │  ╰─ /
    │     │     │     │     │     ├─ new [743]
    │     │     │     │     │     │  ╰─ .
    │     │     │     │     │     │     ╰─ {format} [743]
    │     │     │     │     │     ╰─ {id} [744]
    │     │     │     │     │        ├─ /edit [741]
    │     │     │     │     │        │  ╰─ .
    │     │     │     │     │        │     ╰─ {format} [741]
    │     │     │     │     │        ╰─ .
    │     │     │     │     │           ╰─ {format} [744]
    │     │     │     │     ╰─ epo
    │     │     │     │        ├─ sitory [740]
    │     │     │     │        │  ├─ /deploy_token/create [739]
    │     │     │     │        │  │  ╰─ .
    │     │     │     │        │  │     ╰─ {format} [739]
    │     │     │     │        │  ╰─ .
    │     │     │     │        │     ╰─ {format} [740]
    │     │     │     │        ╰─ rting [737]
    │     │     │     │           ╰─ .
    │     │     │     │              ╰─ {format} [737]
    │     │     │     ├─ rvice_accounts/
    │     │     │     │  ├─ new [687]
    │     │     │     │  │  ╰─ .
    │     │     │     │  │     ╰─ {format} [687]
    │     │     │     │  ├─ {id}
    │     │     │     │  │  ╰─ /edit [689]
    │     │     │     │  │     ╰─ .
    │     │     │     │  │        ╰─ {format} [689]
    │     │     │     │  ╰─ {*vueroute}
    │     │     │     │     ╰─ /
    │     │     │     │        ├─ new [687]
    │     │     │     │        │  ╰─ .
    │     │     │     │        │     ╰─ {format} [687]
    │     │     │     │        ╰─ {id}
    │     │     │     │           ╰─ /edit [689]
    │     │     │     │              ╰─ .
    │     │     │     │                 ╰─ {format} [689]
    │     │     │     ╰─ curity/
    │     │     │        ├─ merge_commit_reports [679]
    │     │     │        │  ╰─ .
    │     │     │        │     ╰─ {format:14} [679]
    │     │     │        ├─ vulnerabilities [684]
    │     │     │        │  ╰─ .
    │     │     │        │     ╰─ {format} [684]
    │     │     │        ├─ policies [681]
    │     │     │        │  ├─ .
    │     │     │        │  │  ╰─ {format} [681]
    │     │     │        │  ╰─ /
    │     │     │        │     ├─ schema [683]
    │     │     │        │     │  ╰─ .
    │     │     │        │     │     ╰─ {format} [683]
    │     │     │        │     ├─ new [682]
    │     │     │        │     │  ╰─ .
    │     │     │        │     │     ╰─ {format} [682]
    │     │     │        │     ╰─ {id:0}
    │     │     │        │        ╰─ /edit [680]
    │     │     │        │           ╰─ .
    │     │     │        │              ╰─ {format} [680]
    │     │     │        ├─ c
    │     │     │        │  ├─ redentials [675]
    │     │     │        │  │  ├─ .
    │     │     │        │  │  │  ╰─ {format} [675]
    │     │     │        │  │  ╰─ /
    │     │     │        │  │     ╰─ {id} [674]
    │     │     │        │  │        ├─ /revoke [676]
    │     │     │        │  │        │  ╰─ .
    │     │     │        │  │        │     ╰─ {format} [676]
    │     │     │        │  │        ╰─ .
    │     │     │        │  │           ╰─ {format} [674]
    │     │     │        │  ╰─ ompliance_
    │     │     │        │     ├─ standards_adherence_reports [672]
    │     │     │        │     │  ╰─ .
    │     │     │        │     │     ╰─ {format:14} [672]
    │     │     │        │     ├─ project_framework_reports [671]
    │     │     │        │     │  ╰─ .
    │     │     │        │     │     ╰─ {format:14} [671]
    │     │     │        │     ├─ framework_reports [670]
    │     │     │        │     │  ╰─ .
    │     │     │        │     │     ╰─ {format:14} [670]
    │     │     │        │     ├─ violation_reports [673]
    │     │     │        │     │  ╰─ .
    │     │     │        │     │     ╰─ {format:14} [673]
    │     │     │        │     ╰─ dashboard [669]
    │     │     │        │        ├─ .
    │     │     │        │        │  ╰─ {format} [669]
    │     │     │        │        ╰─ /
    │     │     │        │           ├─ {*vueroute}
    │     │     │        │           │  ╰─ .
    │     │     │        │           │     ╰─ {format} [669]
    │     │     │        │           ╰─ {*vueroute} [669]
    │     │     │        ╰─ d
    │     │     │           ├─ ashboard [677]
    │     │     │           │  ╰─ .
    │     │     │           │     ╰─ {format} [677]
    │     │     │           ╰─ iscover [678]
    │     │     │              ╰─ .
    │     │     │                 ╰─ {format} [678]
    │     │     ├─ t
    │     │     │  ├─ erraform_module_registry [582]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [582]
    │     │     │  ├─ wo_factor_auth [753]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [753]
    │     │     │  ╰─ odos [752]
    │     │     │     ╰─ .
    │     │     │        ╰─ {format} [752]
    │     │     ╰─ u
    │     │        ├─ sage_quotas [757]
    │     │        │  ├─ /
    │     │        │  │  ├─ subscription_history [759]
    │     │        │  │  │  ╰─ .
    │     │        │  │  │     ╰─ {format:14} [759]
    │     │        │  │  ╰─ pending_members [758]
    │     │        │  │     ╰─ .
    │     │        │  │        ╰─ {format} [758]
    │     │        │  ╰─ .
    │     │        │     ╰─ {format} [757]
    │     │        ╰─ ploads [755]
    │     │           ├─ /authorize [754]
    │     │           │  ╰─ .
    │     │           │     ╰─ {format} [754]
    │     │           ╰─ .
    │     │              ╰─ {format} [755]
    │     ├─ {*id}
    │     │  ├─ /-/
    │     │  │  ├─ unfoldered_environment_names [419]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format:15} [419]
    │     │  │  ├─ merge_requests [409]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format:15} [409]
    │     │  │  ├─ a
    │     │  │  │  ├─ ctivity [399]
    │     │  │  │  │  ╰─ .
    │     │  │  │  │     ╰─ {format:15} [399]
    │     │  │  │  ╰─ rchived [1864]
    │     │  │  │     ╰─ .
    │     │  │  │        ╰─ {format:15} [1864]
    │     │  │  ├─ projects [412]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format:15} [412]
    │     │  │  ├─ transfer [418]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format:15} [418]
    │     │  │  ├─ shared [416]
    │     │  │  │  ╰─ .
    │     │  │  │     ╰─ {format:15} [416]
    │     │  │  ├─ d
    │     │  │  │  ├─ ownload_export [403]
    │     │  │  │  │  ╰─ .
    │     │  │  │  │     ╰─ {format:15} [403]
    │     │  │  │  ╰─ etails [402]
    │     │  │  │     ╰─ .
    │     │  │  │        ╰─ {format:15} [402]
    │     │  │  ├─ e
    │     │  │  │  ├─ xport [405]
    │     │  │  │  │  ╰─ .
    │     │  │  │  │     ╰─ {format:15} [405]
    │     │  │  │  ╰─ dit [404]
    │     │  │  │     ╰─ .
    │     │  │  │        ╰─ {format:15} [404]
    │     │  │  ╰─ i
    │     │  │     ├─ nactive [415]
    │     │  │     │  ╰─ .
    │     │  │     │     ╰─ {format:15} [415]
    │     │  │     ╰─ ssues [407]
    │     │  │        ╰─ .
    │     │  │           ├─ ics [408]
    │     │  │           ╰─ {format:15} [407]
    │     │  ╰─ .
    │     │     ╰─ {format:15} [414]
    │     ╰─ {*id} [414]
    ├─ l
    │  ├─ ookbook_engine [898]
    │  │  ╰─ /
    │  │     ├─ cable [0]
    │  │     ├─ embed [900]
    │  │     │  ├─ .
    │  │     │  │  ╰─ {format} [900]
    │  │     │  ╰─ /
    │  │     │     ├─ {*path}
    │  │     │     │  ╰─ .
    │  │     │     │     ╰─ {format} [901]
    │  │     │     ╰─ {*path} [901]
    │  │     ├─ p
    │  │     │  ├─ review
    │  │     │  │  ├─ s [905]
    │  │     │  │  │  ╰─ .
    │  │     │  │  │     ╰─ {format} [905]
    │  │     │  │  ╰─ /
    │  │     │  │     ├─ {*path}
    │  │     │  │     │  ╰─ .
    │  │     │  │     │     ╰─ {format} [906]
    │  │     │  │     ╰─ {*path} [906]
    │  │     │  ╰─ ages [903]
    │  │     │     ├─ .
    │  │     │     │  ╰─ {format} [903]
    │  │     │     ╰─ /
    │  │     │        ├─ {*path}
    │  │     │        │  ╰─ .
    │  │     │        │     ╰─ {format} [904]
    │  │     │        ╰─ {*path} [904]
    │  │     ├─ inspect/
    │  │     │  ├─ {*path}
    │  │     │  │  ╰─ .
    │  │     │  │     ╰─ {format} [902]
    │  │     │  ╰─ {*path} [902]
    │  │     ├─ {*path}
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [899]
    │  │     ╰─ {*path} [899]
    │  ╰─ etteropenerweb_engine [896]
    │     ╰─ /
    │        ├─ clear [894]
    │        │  ╰─ .
    │        │     ╰─ {format} [894]
    │        ╰─ {id} [897]
    │           ├─ .
    │           │  ╰─ {format} [897]
    │           ╰─ /
    │              ├─ delete [895]
    │              │  ╰─ .
    │              │     ╰─ {format} [895]
    │              ├─ attachments/
    │              │  ╰─ {file:0} [893]
    │              │     ╰─ .
    │              │        ╰─ {format} [893]
    │              ╰─ {style} [897]
    │                 ╰─ .
    │                    ╰─ {format} [897]
    ├─ p
    │  ├─ eek_railtie/results [966]
    │  │  ╰─ .
    │  │     ╰─ {format} [966]
    │  ├─ rojects/
    │  │  ├─ new [1016]
    │  │  │  ╰─ .
    │  │  │     ╰─ {format} [1016]
    │  │  ╰─ {id} [1607]
    │  │     ╰─ .
    │  │        ╰─ {format} [1607]
    │  ╰─ ublic [368]
    │     ├─ /projects [369]
    │     │  ╰─ .
    │     │     ╰─ {format} [369]
    │     ╰─ .
    │        ╰─ {format} [368]
    ├─ s
    │  ├─ nippets [1815]
    │  │  ├─ .
    │  │  │  ╰─ {format} [1815]
    │  │  ╰─ /
    │  │     ├─ {id:3}
    │  │     │  ╰─ /raw [1971]
    │  │     ├─ {*rest}
    │  │     │  ╰─ .
    │  │     │     ╰─ {format} [1815]
    │  │     ╰─ {*rest} [1815]
    │  ├─ itemap [1961]
    │  │  ╰─ .
    │  │     ╰─ {format} [1961]
    │  ╰─ earch [1944]
    │     ├─ .
    │     │  ╰─ {format} [1944]
    │     ╰─ /
    │        ├─ opensearch [1942]
    │        │  ╰─ .
    │        │     ╰─ {format} [1942]
    │        ├─ settings [1943]
    │        │  ╰─ .
    │        │     ╰─ {format} [1943]
    │        ├─ count [1941]
    │        │  ╰─ .
    │        │     ╰─ {format} [1941]
    │        ╰─ a
    │           ├─ ggregations [1939]
    │           │  ╰─ .
    │           │     ╰─ {format} [1939]
    │           ╰─ utocomplete [1940]
    │              ╰─ .
    │                 ╰─ {format} [1940]
    ├─ {username:35} [2042]
    │  ╰─ .
    │     ├─ keys [2044]
    │     │  ╰─ .
    │     │     ╰─ {format} [2044]
    │     ├─ gpg [2039]
    │     │  ╰─ .
    │     │     ╰─ {format} [2039]
    │     ╰─ {format} [2042]
    ├─ {*repository_path:5}
    │  ╰─ /
    │     ├─ info/
    │     │  ├─ lfs/
    │     │  │  ├─ objects [1908]
    │     │  │  │  ╰─ /
    │     │  │  │     ├─ batch [1904]
    │     │  │  │     ╰─ {*oid} [1906]
    │     │  │  ╰─ locks [1910]
    │     │  │     ╰─ /
    │     │  │        ├─ verify [1928]
    │     │  │        ├─ new [1918]
    │     │  │        ╰─ {id} [1912]
    │     │  │           ╰─ /
    │     │  │              ├─ unlock [1922]
    │     │  │              ╰─ edit [1914]
    │     │  ╰─ refs [1898]
    │     ├─ ssh-
    │     │  ├─ receive-pack [1900]
    │     │  ╰─ upload-pack [1902]
    │     ╰─ git
    │        ├─ lab-lfs/objects/
    │        │  ├─ {*oid:6}
    │        │  │  ╰─ /
    │        │  │     ├─ {*size:7}
    │        │  │     │  ╰─ /authorize [1932]
    │        │  │     ╰─ {*size:7} [1934]
    │        │  ╰─ {*oid:6} [1930]
    │        ╰─ -
    │           ├─ receive-pack [1894]
    │           ╰─ upload-pack [1896]
    ├─ {*repository_path:9}
    │  ╰─ /info/refs [1814]
    ├─ {*namespace_id:2}
    │  ╰─ /
    │     ├─ {project_id:4}
    │     │  ╰─ /
    │     │     ├─ uploads [1760]
    │     │     │  ├─ /
    │     │     │  │  ├─ authorize [1759]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [1759]
    │     │     │  │  ╰─ {secret}
    │     │     │  │     ╰─ /
    │     │     │  │        ╰─ {filename:0} [1761]
    │     │     │  ╰─ .
    │     │     │     ╰─ {format} [1760]
    │     │     ├─ hooks [1828]
    │     │     │  ├─ .
    │     │     │  │  ╰─ {format} [1828]
    │     │     │  ╰─ /
    │     │     │     ├─ {*rest}
    │     │     │     │  ╰─ .
    │     │     │     │     ╰─ {format} [1828]
    │     │     │     ╰─ {*rest} [1828]
    │     │     ├─ wikis [1844]
    │     │     │  ├─ .
    │     │     │  │  ╰─ {format} [1844]
    │     │     │  ╰─ /
    │     │     │     ├─ {*rest}
    │     │     │     │  ╰─ .
    │     │     │     │     ╰─ {format} [1844]
    │     │     │     ╰─ {*rest} [1844]
    │     │     ├─ n
    │     │     │  ├─ ew/
    │     │     │  │  ╰─ {*id:46} [1848]
    │     │     │  ╰─ ote
    │     │     │     ├─ s [1492]
    │     │     │     │  ├─ .
    │     │     │     │  │  ╰─ {format} [1492]
    │     │     │     │  ╰─ /
    │     │     │     │     ╰─ {id:3} [1501]
    │     │     │     │        ├─ .
    │     │     │     │        │  ╰─ {format} [1501]
    │     │     │     │        ╰─ /
    │     │     │     │           ├─ outdated_line_change [1496]
    │     │     │     │           │  ╰─ .
    │     │     │     │           │     ╰─ {format} [1496]
    │     │     │     │           ├─ toggle_award_emoji [1498]
    │     │     │     │           │  ╰─ .
    │     │     │     │           │     ╰─ {format} [1498]
    │     │     │     │           ╰─ delete_attachment [1493]
    │     │     │     │              ╰─ .
    │     │     │     │                 ╰─ {format} [1493]
    │     │     │     ╰─ able/
    │     │     │        ╰─ {target_type}
    │     │     │           ╰─ /
    │     │     │              ╰─ {target_id}
    │     │     │                 ╰─ /notes [1495]
    │     │     │                    ╰─ .
    │     │     │                       ╰─ {format} [1495]
    │     │     ├─ -/
    │     │     │  ├─ w
    │     │     │  │  ├─ ork_items/
    │     │     │  │  │  ├─ import_csv [1792]
    │     │     │  │  │  │  ├─ /authorize [1791]
    │     │     │  │  │  │  │  ╰─ .
    │     │     │  │  │  │  │     ╰─ {format} [1791]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1792]
    │     │     │  │  │  ╰─ {iid} [1793]
    │     │     │  │  │     ├─ /designs [1794]
    │     │     │  │  │     │  ╰─ /
    │     │     │  │  │     │     ╰─ {*vueroute} [1794]
    │     │     │  │  │     ╰─ .
    │     │     │  │  │        ╰─ {format} [1793]
    │     │     │  │  ╰─ ikis/
    │     │     │  │     ├─ -/confluence [1168]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1168]
    │     │     │  │     ├─ git_access [1782]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1782]
    │     │     │  │     ├─ templates [1789]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1789]
    │     │     │  │     ├─ pages [1785]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1785]
    │     │     │  │     ├─ new [1784]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1784]
    │     │     │  │     ├─ {*id}
    │     │     │  │     │  ╰─ /
    │     │     │  │     │     ├─ preview_markdown [1786]
    │     │     │  │     │     ├─ history [1783]
    │     │     │  │     │     ├─ diff [1780]
    │     │     │  │     │     ├─ edit [1781]
    │     │     │  │     │     ╰─ raw [1787]
    │     │     │  │     ╰─ {*id} [1779]
    │     │     │  ├─ quality/test_cases [1601]
    │     │     │  │  ├─ /
    │     │     │  │  │  ├─ new [1602]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1602]
    │     │     │  │  │  ╰─ {id} [1603]
    │     │     │  │  │     ╰─ .
    │     │     │  │  │        ╰─ {format} [1603]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [1601]
    │     │     │  ├─ t
    │     │     │  │  ├─ erraform [1747]
    │     │     │  │  │  ├─ _module_registry [1505]
    │     │     │  │  │  │  ├─ .
    │     │     │  │  │  │  │  ╰─ {format} [1505]
    │     │     │  │  │  │  ╰─ /
    │     │     │  │  │  │     ╰─ {id} [1506]
    │     │     │  │  │  │        ╰─ .
    │     │     │  │  │  │           ╰─ {format} [1506]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [1747]
    │     │     │  │  ├─ r
    │     │     │  │  │  ├─ acing [1749]
    │     │     │  │  │  │  ├─ .
    │     │     │  │  │  │  │  ╰─ {format} [1749]
    │     │     │  │  │  │  ╰─ /
    │     │     │  │  │  │     ╰─ {id} [1750]
    │     │     │  │  │  │        ╰─ .
    │     │     │  │  │  │           ╰─ {format} [1750]
    │     │     │  │  │  ├─ iggers/
    │     │     │  │  │  │  ╰─ {id} [1758]
    │     │     │  │  │  │     ╰─ .
    │     │     │  │  │  │        ╰─ {format} [1758]
    │     │     │  │  │  ╰─ ee/
    │     │     │  │  │     ╰─ {*id:46} [1752]
    │     │     │  │  ╰─ a
    │     │     │  │     ├─ rget_branch_rules/
    │     │     │  │     │  ╰─ {id} [1742]
    │     │     │  │     │     ╰─ .
    │     │     │  │     │        ╰─ {format} [1742]
    │     │     │  │     ╰─ gs [1736]
    │     │     │  │        ╰─ /
    │     │     │  │           ├─ new [1739]
    │     │     │  │           ╰─ {id:42} [1737]
    │     │     │  ├─ v
    │     │     │  │  ├─ ulnerability_feedback/
    │     │     │  │  │  ├─ count [1766]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1766]
    │     │     │  │  │  ╰─ {id:3} [1771]
    │     │     │  │  │     ╰─ .
    │     │     │  │  │        ╰─ {format} [1771]
    │     │     │  │  ╰─ a
    │     │     │  │     ├─ lue_stream_analytics [1169]
    │     │     │  │     │  ├─ /events/
    │     │     │  │     │  │  ├─ staging [1175]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format} [1175]
    │     │     │  │     │  │  ├─ review [1174]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format} [1174]
    │     │     │  │     │  │  ├─ issue [1171]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format} [1171]
    │     │     │  │     │  │  ├─ code [1170]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format} [1170]
    │     │     │  │     │  │  ├─ test [1176]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format} [1176]
    │     │     │  │     │  │  ╰─ p
    │     │     │  │     │  │     ├─ roduction [1173]
    │     │     │  │     │  │     │  ╰─ .
    │     │     │  │     │  │     │     ╰─ {format} [1173]
    │     │     │  │     │  │     ╰─ lan [1172]
    │     │     │  │     │  │        ╰─ .
    │     │     │  │     │  │           ╰─ {format} [1172]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1169]
    │     │     │  │     ╰─ riables [1765]
    │     │     │  │        ╰─ .
    │     │     │  │           ╰─ {format} [1765]
    │     │     │  ├─ s
    │     │     │  │  ├─ ubscriptions [1734]
    │     │     │  │  │  ├─ .
    │     │     │  │  │  │  ╰─ {format} [1734]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ╰─ {id} [1735]
    │     │     │  │  │        ╰─ .
    │     │     │  │  │           ╰─ {format} [1735]
    │     │     │  │  ├─ nippets [1725]
    │     │     │  │  │  ├─ .
    │     │     │  │  │  │  ╰─ {format} [1725]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ├─ new [1727]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1727]
    │     │     │  │  │     ├─ {id:3} [1730]
    │     │     │  │  │     │  ├─ .
    │     │     │  │  │     │  │  ╰─ {format} [1730]
    │     │     │  │  │     │  ╰─ /
    │     │     │  │  │     │     ├─ toggle_award_emoji [1731]
    │     │     │  │  │     │     │  ╰─ .
    │     │     │  │  │     │     │     ╰─ {format} [1731]
    │     │     │  │  │     │     ├─ mark_as_spam [1726]
    │     │     │  │  │     │     │  ╰─ .
    │     │     │  │  │     │     │     ╰─ {format} [1726]
    │     │     │  │  │     │     ├─ edit [1724]
    │     │     │  │  │     │     │  ╰─ .
    │     │     │  │  │     │     │     ╰─ {format} [1724]
    │     │     │  │  │     │     ╰─ raw [1728]
    │     │     │  │  │     │        ╰─ .
    │     │     │  │  │     │           ╰─ {format} [1728]
    │     │     │  │  │     ╰─ {snippet_id:3}
    │     │     │  │  │        ╰─ /raw/
    │     │     │  │  │           ╰─ {ref}
    │     │     │  │  │              ╰─ /
    │     │     │  │  │                 ╰─ {*path} [1732]
    │     │     │  │  ├─ tarrers [1733]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [1733]
    │     │     │  │  ├─ chema/
    │     │     │  │  │  ╰─ {branch}
    │     │     │  │  │     ╰─ /
    │     │     │  │  │        ╰─ {*filename} [1772]
    │     │     │  │  ╰─ e
    │     │     │  │     ├─ rvice_desk/custom_email [1680]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1680]
    │     │     │  │     ├─ ttings/
    │     │     │  │     │  ├─ packages_and_registries [1712]
    │     │     │  │     │  │  ├─ /cleanup_image_tags [1711]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format} [1711]
    │     │     │  │     │  │  ╰─ .
    │     │     │  │     │  │     ╰─ {format} [1712]
    │     │     │  │     │  ├─ merge_requests [1705]
    │     │     │  │     │  │  ╰─ .
    │     │     │  │     │  │     ╰─ {format} [1705]
    │     │     │  │     │  ├─ integrations [1699]
    │     │     │  │     │  │  ├─ .
    │     │     │  │     │  │  │  ╰─ {format} [1699]
    │     │     │  │     │  │  ╰─ /
    │     │     │  │     │  │     ├─ {integration_id:0}
    │     │     │  │     │  │     │  ╰─ /hook_logs/
    │     │     │  │     │  │     │     ╰─ {id:0} [1697]
    │     │     │  │     │  │     │        ├─ /retry [1696]
    │     │     │  │     │  │     │        │  ╰─ .
    │     │     │  │     │  │     │        │     ╰─ {format} [1696]
    │     │     │  │     │  │     │        ╰─ .
    │     │     │  │     │  │     │           ╰─ {format} [1697]
    │     │     │  │     │  │     ╰─ {id:0}
    │     │     │  │     │  │        ╰─ /
    │     │     │  │     │  │           ├─ edit [1698]
    │     │     │  │     │  │           │  ╰─ .
    │     │     │  │     │  │           │     ╰─ {format} [1698]
    │     │     │  │     │  │           ╰─ test [1700]
    │     │     │  │     │  │              ╰─ .
    │     │     │  │     │  │                 ╰─ {format} [1700]
    │     │     │  │     │  ├─ operations [1710]
    │     │     │  │     │  │  ├─ /reset_
    │     │     │  │     │  │  │  ├─ pagerduty_token [1707]
    │     │     │  │     │  │  │  │  ╰─ .
    │     │     │  │     │  │  │  │     ╰─ {format} [1707]
    │     │     │  │     │  │  │  ╰─ alerting_token [1706]
    │     │     │  │     │  │  │     ╰─ .
    │     │     │  │     │  │  │        ╰─ {format} [1706]
    │     │     │  │     │  │  ╰─ .
    │     │     │  │     │  │     ╰─ {format} [1710]
    │     │     │  │     │  ├─ repository [1718]
    │     │     │  │     │  │  ├─ .
    │     │     │  │     │  │  │  ╰─ {format} [1718]
    │     │     │  │     │  │  ╰─ /
    │     │     │  │     │  │     ├─ deploy_token/create [1715]
    │     │     │  │     │  │     │  ╰─ .
    │     │     │  │     │  │     │     ╰─ {format} [1715]
    │     │     │  │     │  │     ├─ branch_rules [1688]
    │     │     │  │     │  │     │  ╰─ .
    │     │     │  │     │  │     │     ╰─ {format} [1688]
    │     │     │  │     │  │     ╰─ cleanup [1713]
    │     │     │  │     │  │        ╰─ .
    │     │     │  │     │  │           ╰─ {format} [1713]
    │     │     │  │     │  ├─ ci_cd [1695]
    │     │     │  │     │  │  ├─ .
    │     │     │  │     │  │  │  ╰─ {format} [1695]
    │     │     │  │     │  │  ╰─ /
    │     │     │  │     │  │     ├─ deploy_token/create [1714]
    │     │     │  │     │  │     │  ╰─ .
    │     │     │  │     │  │     │     ╰─ {format} [1714]
    │     │     │  │     │  │     ├─ export_job_token_authorizations [1689]
    │     │     │  │     │  │     │  ╰─ .
    │     │     │  │     │  │     │     ╰─ {format} [1689]
    │     │     │  │     │  │     ╰─ r
    │     │     │  │     │  │        ├─ unner_setup_scripts [1692]
    │     │     │  │     │  │        │  ╰─ .
    │     │     │  │     │  │        │     ╰─ {format} [1692]
    │     │     │  │     │  │        ╰─ eset_
    │     │     │  │     │  │           ├─ registration_token [1691]
    │     │     │  │     │  │           │  ╰─ .
    │     │     │  │     │  │           │     ╰─ {format} [1691]
    │     │     │  │     │  │           ╰─ cache [1690]
    │     │     │  │     │  │              ╰─ .
    │     │     │  │     │  │                 ╰─ {format} [1690]
    │     │     │  │     │  ├─ slack [1723]
    │     │     │  │     │  │  ├─ .
    │     │     │  │     │  │  │  ╰─ {format} [1723]
    │     │     │  │     │  │  ╰─ /
    │     │     │  │     │  │     ├─ slack_auth [1721]
    │     │     │  │     │  │     │  ╰─ .
    │     │     │  │     │  │     │     ╰─ {format} [1721]
    │     │     │  │     │  │     ╰─ edit [1720]
    │     │     │  │     │  │        ╰─ .
    │     │     │  │     │  │           ╰─ {format} [1720]
    │     │     │  │     │  ╰─ a
    │     │     │  │     │     ├─ nalytics [1687]
    │     │     │  │     │     │  ╰─ .
    │     │     │  │     │     │     ╰─ {format} [1687]
    │     │     │  │     │     ╰─ ccess_tokens/
    │     │     │  │     │        ╰─ {id}
    │     │     │  │     │           ╰─ /revoke [1684]
    │     │     │  │     │              ╰─ .
    │     │     │  │     │                 ╰─ {format} [1684]
    │     │     │  │     ╰─ c
    │     │     │  │        ├─ urity/
    │     │     │  │        │  ├─ scanned_resources [1662]
    │     │     │  │        │  │  ╰─ .
    │     │     │  │        │  │     ╰─ {format} [1662]
    │     │     │  │        │  ├─ policies [1658]
    │     │     │  │        │  │  ├─ .
    │     │     │  │        │  │  │  ╰─ {format} [1658]
    │     │     │  │        │  │  ╰─ /
    │     │     │  │        │  │     ├─ schema [1660]
    │     │     │  │        │  │     │  ╰─ .
    │     │     │  │        │  │     │     ╰─ {format} [1660]
    │     │     │  │        │  │     ├─ new [1659]
    │     │     │  │        │  │     │  ╰─ .
    │     │     │  │        │  │     │     ╰─ {format} [1659]
    │     │     │  │        │  │     ╰─ {id:0}
    │     │     │  │        │  │        ╰─ /edit [1657]
    │     │     │  │        │  │           ╰─ .
    │     │     │  │        │  │              ╰─ {format} [1657]
    │     │     │  │        │  ├─ vulnerabilit
    │     │     │  │        │  │  ├─ y_report [1673]
    │     │     │  │        │  │  │  ╰─ .
    │     │     │  │        │  │  │     ╰─ {format} [1673]
    │     │     │  │        │  │  ╰─ ies/
    │     │     │  │        │  │     ├─ new [1665]
    │     │     │  │        │  │     │  ╰─ .
    │     │     │  │        │  │     │     ╰─ {format} [1665]
    │     │     │  │        │  │     ├─ {id} [1666]
    │     │     │  │        │  │     │  ├─ /discussions [1664]
    │     │     │  │        │  │     │  │  ╰─ .
    │     │     │  │        │  │     │  │     ╰─ {format} [1664]
    │     │     │  │        │  │     │  ╰─ .
    │     │     │  │        │  │     │     ╰─ {format} [1666]
    │     │     │  │        │  │     ╰─ {vulnerability_id}
    │     │     │  │        │  │        ╰─ /notes/
    │     │     │  │        │  │           ╰─ {id:3} [1672]
    │     │     │  │        │  │              ├─ /toggle_award_emoji [1670]
    │     │     │  │        │  │              │  ╰─ .
    │     │     │  │        │  │              │     ╰─ {format} [1670]
    │     │     │  │        │  │              ╰─ .
    │     │     │  │        │  │                 ╰─ {format} [1672]
    │     │     │  │        │  ├─ co
    │     │     │  │        │  │  ├─ nfiguration [1647]
    │     │     │  │        │  │  │  ├─ /
    │     │     │  │        │  │  │  │  ├─ corpus_management [1648]
    │     │     │  │        │  │  │  │  │  ╰─ .
    │     │     │  │        │  │  │  │  │     ╰─ {format} [1648]
    │     │     │  │        │  │  │  │  ├─ profile_library [1651]
    │     │     │  │        │  │  │  │  │  ├─ /dast_s
    │     │     │  │        │  │  │  │  │  │  ├─ canner_profiles/
    │     │     │  │        │  │  │  │  │  │  │  ├─ new [1653]
    │     │     │  │        │  │  │  │  │  │  │  │  ╰─ .
    │     │     │  │        │  │  │  │  │  │  │  │     ╰─ {format} [1653]
    │     │     │  │        │  │  │  │  │  │  │  ╰─ {id}
    │     │     │  │        │  │  │  │  │  │  │     ╰─ /edit [1652]
    │     │     │  │        │  │  │  │  │  │  │        ╰─ .
    │     │     │  │        │  │  │  │  │  │  │           ╰─ {format} [1652]
    │     │     │  │        │  │  │  │  │  │  ╰─ ite_profiles/
    │     │     │  │        │  │  │  │  │  │     ├─ new [1655]
    │     │     │  │        │  │  │  │  │  │     │  ╰─ .
    │     │     │  │        │  │  │  │  │  │     │     ╰─ {format} [1655]
    │     │     │  │        │  │  │  │  │  │     ╰─ {id}
    │     │     │  │        │  │  │  │  │  │        ╰─ /edit [1654]
    │     │     │  │        │  │  │  │  │  │           ╰─ .
    │     │     │  │        │  │  │  │  │  │              ╰─ {format} [1654]
    │     │     │  │        │  │  │  │  │  ╰─ .
    │     │     │  │        │  │  │  │  │     ╰─ {format} [1651]
    │     │     │  │        │  │  │  │  ├─ api_fuzzing [1645]
    │     │     │  │        │  │  │  │  │  ╰─ .
    │     │     │  │        │  │  │  │  │     ╰─ {format} [1645]
    │     │     │  │        │  │  │  │  ├─ dast [1650]
    │     │     │  │        │  │  │  │  │  ╰─ .
    │     │     │  │        │  │  │  │  │     ╰─ {format} [1650]
    │     │     │  │        │  │  │  │  ╰─ s
    │     │     │  │        │  │  │  │     ├─ ecret_detection [1663]
    │     │     │  │        │  │  │  │     │  ╰─ .
    │     │     │  │        │  │  │  │     │     ╰─ {format} [1663]
    │     │     │  │        │  │  │  │     ╰─ ast [1661]
    │     │     │  │        │  │  │  │        ╰─ .
    │     │     │  │        │  │  │  │           ╰─ {format} [1661]
    │     │     │  │        │  │  │  ╰─ .
    │     │     │  │        │  │  │     ╰─ {format} [1647]
    │     │     │  │        │  │  ╰─ mpliance_dashboard [1646]
    │     │     │  │        │  │     ├─ .
    │     │     │  │        │  │     │  ╰─ {format} [1646]
    │     │     │  │        │  │     ╰─ /
    │     │     │  │        │  │        ├─ {*vueroute}
    │     │     │  │        │  │        │  ╰─ .
    │     │     │  │        │  │        │     ╰─ {format} [1646]
    │     │     │  │        │  │        ╰─ {*vueroute} [1646]
    │     │     │  │        │  ╰─ d
    │     │     │  │        │     ├─ ashboard [1649]
    │     │     │  │        │     │  ╰─ .
    │     │     │  │        │     │     ╰─ {format} [1649]
    │     │     │  │        │     ╰─ iscover [1656]
    │     │     │  │        │        ╰─ .
    │     │     │  │        │           ╰─ {format} [1656]
    │     │     │  │        ╰─ rets [1644]
    │     │     │  │           ├─ .
    │     │     │  │           │  ╰─ {format} [1644]
    │     │     │  │           ╰─ /
    │     │     │  │              ├─ {*vueroute}
    │     │     │  │              │  ╰─ .
    │     │     │  │              │     ╰─ {format} [1644]
    │     │     │  │              ╰─ {*vueroute} [1644]
    │     │     │  ├─ jobs [1340]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [1340]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ artifacts/
    │     │     │  │     │  ╰─ {*ref_name_and_path} [1070]
    │     │     │  │     ├─ {job_id:3}
    │     │     │  │     │  ╰─ /artifacts/
    │     │     │  │     │     ├─ download [1065]
    │     │     │  │     │     │  ╰─ .
    │     │     │  │     │     │     ╰─ {format} [1065]
    │     │     │  │     │     ├─ browse [1063]
    │     │     │  │     │     │  ╰─ /
    │     │     │  │     │     │     ╰─ {*path} [1063]
    │     │     │  │     │     ├─ keep [1069]
    │     │     │  │     │     │  ╰─ .
    │     │     │  │     │     │     ╰─ {format} [1069]
    │     │     │  │     │     ├─ external_file/
    │     │     │  │     │     │  ╰─ {*path} [1066]
    │     │     │  │     │     ├─ file/
    │     │     │  │     │     │  ╰─ {*path} [1067]
    │     │     │  │     │     ╰─ raw/
    │     │     │  │     │        ╰─ {*path} [1071]
    │     │     │  │     ╰─ {id:3} [1346]
    │     │     │  │        ├─ .
    │     │     │  │        │  ╰─ {format} [1346]
    │     │     │  │        ╰─ /
    │     │     │  │           ├─ unschedule [1352]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [1352]
    │     │     │  │           ├─ cancel [1338]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [1338]
    │     │     │  │           ├─ status [1347]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [1347]
    │     │     │  │           ├─ viewer [1353]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [1353]
    │     │     │  │           ├─ erase [1339]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [1339]
    │     │     │  │           ├─ p
    │     │     │  │           │  ├─ roxy [1342]
    │     │     │  │           │  │  ╰─ .
    │     │     │  │           │  │     ├─ ws/authorize [1343]
    │     │     │  │           │  │     ╰─ {format} [1342]
    │     │     │  │           │  ╰─ lay [1341]
    │     │     │  │           │     ╰─ .
    │     │     │  │           │        ╰─ {format} [1341]
    │     │     │  │           ├─ r
    │     │     │  │           │  ├─ etry [1345]
    │     │     │  │           │  │  ╰─ .
    │     │     │  │           │  │     ╰─ {format} [1345]
    │     │     │  │           │  ╰─ aw [1344]
    │     │     │  │           │     ╰─ .
    │     │     │  │           │        ╰─ {format} [1344]
    │     │     │  │           ╰─ t
    │     │     │  │              ├─ race [1351]
    │     │     │  │              │  ╰─ .
    │     │     │  │              │     ╰─ {format:37} [1351]
    │     │     │  │              ╰─ e
    │     │     │  │                 ├─ st_report_summary [1350]
    │     │     │  │                 │  ╰─ .
    │     │     │  │                 │     ╰─ {format} [1350]
    │     │     │  │                 ╰─ rminal [1348]
    │     │     │  │                    ╰─ .
    │     │     │  │                       ├─ ws/authorize [1349]
    │     │     │  │                       ╰─ {format} [1348]
    │     │     │  ├─ u
    │     │     │  │  ├─ sage_quotas [1762]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [1762]
    │     │     │  │  ╰─ pdate/
    │     │     │  │     ╰─ {*id:46} [1107]
    │     │     │  ├─ de
    │     │     │  │  ├─ sign_management/designs/
    │     │     │  │  │  ╰─ {design_id}
    │     │     │  │  │     ╰─ /
    │     │     │  │  │        ├─ r
    │     │     │  │  │        │  ├─ aw_image [1195]
    │     │     │  │  │        │  │  ╰─ .
    │     │     │  │  │        │  │     ╰─ {format} [1195]
    │     │     │  │  │        │  ╰─ esized_image/
    │     │     │  │  │        │     ╰─ {id} [1196]
    │     │     │  │  │        │        ╰─ .
    │     │     │  │  │        │           ╰─ {format} [1196]
    │     │     │  │  │        ╰─ {sha}
    │     │     │  │  │           ╰─ /r
    │     │     │  │  │              ├─ aw_image [1195]
    │     │     │  │  │              │  ╰─ .
    │     │     │  │  │              │     ╰─ {format} [1195]
    │     │     │  │  │              ╰─ esized_image/
    │     │     │  │  │                 ╰─ {id} [1196]
    │     │     │  │  │                    ╰─ .
    │     │     │  │  │                       ╰─ {format} [1196]
    │     │     │  │  ╰─ p
    │     │     │  │     ├─ loy_
    │     │     │  │     │  ├─ tokens/
    │     │     │  │     │  │  ╰─ {id:3}
    │     │     │  │     │  │     ╰─ /revoke [1190]
    │     │     │  │     │  │        ╰─ .
    │     │     │  │     │  │           ╰─ {format} [1190]
    │     │     │  │     │  ╰─ keys/
    │     │     │  │     │     ├─ enabled_keys [1185]
    │     │     │  │     │     │  ╰─ .
    │     │     │  │     │     │     ╰─ {format} [1185]
    │     │     │  │     │     ├─ new [1187]
    │     │     │  │     │     │  ╰─ .
    │     │     │  │     │     │     ╰─ {format} [1187]
    │     │     │  │     │     ├─ available_p
    │     │     │  │     │     │  ├─ roject_keys [1179]
    │     │     │  │     │     │  │  ╰─ .
    │     │     │  │     │     │  │     ╰─ {format} [1179]
    │     │     │  │     │     │  ╰─ ublic_keys [1180]
    │     │     │  │     │     │     ╰─ .
    │     │     │  │     │     │        ╰─ {format} [1180]
    │     │     │  │     │     ╰─ {id:3}
    │     │     │  │     │        ╰─ /
    │     │     │  │     │           ├─ disable [1182]
    │     │     │  │     │           │  ╰─ .
    │     │     │  │     │           │     ╰─ {format} [1182]
    │     │     │  │     │           ╰─ e
    │     │     │  │     │              ├─ nable [1184]
    │     │     │  │     │              │  ╰─ .
    │     │     │  │     │              │     ╰─ {format} [1184]
    │     │     │  │     │              ╰─ dit [1183]
    │     │     │  │     │                 ╰─ .
    │     │     │  │     │                    ╰─ {format} [1183]
    │     │     │  │     ╰─ endencies [1177]
    │     │     │  │        ├─ /licenses [1178]
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [1178]
    │     │     │  │        ╰─ .
    │     │     │  │           ╰─ {format} [1177]
    │     │     │  ├─ ne
    │     │     │  │  ├─ twork/
    │     │     │  │  │  ╰─ {id:42} [1491]
    │     │     │  │  ╰─ w/
    │     │     │  │     ╰─ {*id:46} [1102]
    │     │     │  ├─ on
    │     │     │  │  ├─ call_schedules [1281]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [1281]
    │     │     │  │  ╰─ _demand_scans [1503]
    │     │     │  │     ├─ .
    │     │     │  │     │  ╰─ {format} [1503]
    │     │     │  │     ╰─ /
    │     │     │  │        ├─ new [1504]
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [1504]
    │     │     │  │        ╰─ {id}
    │     │     │  │           ╰─ /edit [1502]
    │     │     │  │              ╰─ .
    │     │     │  │                 ╰─ {format} [1502]
    │     │     │  ├─ a
    │     │     │  │  ├─ ws [1845]
    │     │     │  │  │  ├─ /configuration [1088]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1088]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [1845]
    │     │     │  │  ├─ lert_management [1032]
    │     │     │  │  │  ├─ .
    │     │     │  │  │  │  ╰─ {format} [1032]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ╰─ {id} [1030]
    │     │     │  │  │        ├─ /details [1031]
    │     │     │  │  │        │  ├─ .
    │     │     │  │  │        │  │  ╰─ {format} [1031]
    │     │     │  │  │        │  ╰─ /
    │     │     │  │  │        │     ├─ {*page}
    │     │     │  │  │        │     │  ╰─ .
    │     │     │  │  │        │     │     ╰─ {format} [1031]
    │     │     │  │  │        │     ╰─ {*page} [1031]
    │     │     │  │  │        ╰─ .
    │     │     │  │  │           ╰─ {format} [1030]
    │     │     │  │  ├─ r
    │     │     │  │  │  ├─ tifacts [1068]
    │     │     │  │  │  │  ├─ .
    │     │     │  │  │  │  │  ╰─ {format} [1068]
    │     │     │  │  │  │  ╰─ /
    │     │     │  │  │  │     ╰─ {id} [1064]
    │     │     │  │  │  │        ╰─ .
    │     │     │  │  │  │           ╰─ {format} [1064]
    │     │     │  │  │  ╰─ chive/
    │     │     │  │  │     ╰─ {*id:33}
    │     │     │  │  │        ╰─ .
    │     │     │  │  │           ╰─ {format:36} [1624]
    │     │     │  │  ├─ nalytics/
    │     │     │  │  │  ├─ merge_request_analytics [1057]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1057]
    │     │     │  │  │  ├─ value_stream_analytics [1038]
    │     │     │  │  │  │  ├─ /
    │     │     │  │  │  │  │  ├─ time_summary [1046]
    │     │     │  │  │  │  │  │  ╰─ .
    │     │     │  │  │  │  │  │     ╰─ {format} [1046]
    │     │     │  │  │  │  │  ├─ summary [1045]
    │     │     │  │  │  │  │  │  ╰─ .
    │     │     │  │  │  │  │  │     ╰─ {format} [1045]
    │     │     │  │  │  │  │  ╰─ value_streams/
    │     │     │  │  │  │  │     ├─ new [1051]
    │     │     │  │  │  │  │     │  ╰─ .
    │     │     │  │  │  │  │     │     ╰─ {format} [1051]
    │     │     │  │  │  │  │     ├─ {id}
    │     │     │  │  │  │  │     │  ╰─ /edit [1049]
    │     │     │  │  │  │  │     │     ╰─ .
    │     │     │  │  │  │  │     │        ╰─ {format} [1049]
    │     │     │  │  │  │  │     ╰─ {value_stream_id}
    │     │     │  │  │  │  │        ╰─ /stages [1042]
    │     │     │  │  │  │  │           ├─ .
    │     │     │  │  │  │  │           │  ╰─ {format} [1042]
    │     │     │  │  │  │  │           ╰─ /
    │     │     │  │  │  │  │              ╰─ {id}
    │     │     │  │  │  │  │                 ╰─ /
    │     │     │  │  │  │  │                    ├─ average [1039]
    │     │     │  │  │  │  │                    │  ├─ _duration_chart [1040]
    │     │     │  │  │  │  │                    │  │  ╰─ .
    │     │     │  │  │  │  │                    │  │     ╰─ {format} [1040]
    │     │     │  │  │  │  │                    │  ╰─ .
    │     │     │  │  │  │  │                    │     ╰─ {format} [1039]
    │     │     │  │  │  │  │                    ├─ records [1044]
    │     │     │  │  │  │  │                    │  ╰─ .
    │     │     │  │  │  │  │                    │     ╰─ {format} [1044]
    │     │     │  │  │  │  │                    ├─ median [1043]
    │     │     │  │  │  │  │                    │  ╰─ .
    │     │     │  │  │  │  │                    │     ╰─ {format} [1043]
    │     │     │  │  │  │  │                    ╰─ count [1041]
    │     │     │  │  │  │  │                       ╰─ .
    │     │     │  │  │  │  │                          ╰─ {format} [1041]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1038]
    │     │     │  │  │  ├─ issues_analytics [1056]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1056]
    │     │     │  │  │  ├─ code_reviews [1037]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1037]
    │     │     │  │  │  ╰─ dashboards [1055]
    │     │     │  │  │     ╰─ /
    │     │     │  │  │        ╰─ {*vueroute} [1055]
    │     │     │  │  ├─ pprover
    │     │     │  │  │  ├─ _groups/
    │     │     │  │  │  │  ╰─ {id} [1058]
    │     │     │  │  │  │     ╰─ .
    │     │     │  │  │  │        ╰─ {format} [1058]
    │     │     │  │  │  ╰─ s/
    │     │     │  │  │     ╰─ {id} [1060]
    │     │     │  │  │        ╰─ .
    │     │     │  │  │           ╰─ {format} [1060]
    │     │     │  │  ╰─ u
    │     │     │  │     ├─ to
    │     │     │  │     │  ├─ mations [1085]
    │     │     │  │     │  │  ╰─ .
    │     │     │  │     │  │     ╰─ {format} [1085]
    │     │     │  │     │  ╰─ complete_sources/
    │     │     │  │     │     ├─ vulnerabilities [1083]
    │     │     │  │     │     │  ╰─ .
    │     │     │  │     │     │     ╰─ {format} [1083]
    │     │     │  │     │     ├─ snippets [1082]
    │     │     │  │     │     │  ╰─ .
    │     │     │  │     │     │     ╰─ {format} [1082]
    │     │     │  │     │     ├─ labels [1078]
    │     │     │  │     │     │  ╰─ .
    │     │     │  │     │     │     ╰─ {format} [1078]
    │     │     │  │     │     ├─ epics [1075]
    │     │     │  │     │     │  ╰─ .
    │     │     │  │     │     │     ╰─ {format} [1075]
    │     │     │  │     │     ├─ wikis [1084]
    │     │     │  │     │     │  ╰─ .
    │     │     │  │     │     │     ╰─ {format} [1084]
    │     │     │  │     │     ├─ co
    │     │     │  │     │     │  ├─ mmands [1073]
    │     │     │  │     │     │  │  ╰─ .
    │     │     │  │     │     │  │     ╰─ {format} [1073]
    │     │     │  │     │     │  ╰─ ntacts [1074]
    │     │     │  │     │     │     ╰─ .
    │     │     │  │     │     │        ╰─ {format} [1074]
    │     │     │  │     │     ├─ i
    │     │     │  │     │     │  ├─ terations [1077]
    │     │     │  │     │     │  │  ╰─ .
    │     │     │  │     │     │  │     ╰─ {format} [1077]
    │     │     │  │     │     │  ╰─ ssues [1076]
    │     │     │  │     │     │     ╰─ .
    │     │     │  │     │     │        ╰─ {format} [1076]
    │     │     │  │     │     ╰─ m
    │     │     │  │     │        ├─ ilestones [1081]
    │     │     │  │     │        │  ╰─ .
    │     │     │  │     │        │     ╰─ {format} [1081]
    │     │     │  │     │        ╰─ e
    │     │     │  │     │           ├─ rge_requests [1080]
    │     │     │  │     │           │  ╰─ .
    │     │     │  │     │           │     ╰─ {format} [1080]
    │     │     │  │     │           ╰─ mbers [1079]
    │     │     │  │     │              ╰─ .
    │     │     │  │     │                 ╰─ {format} [1079]
    │     │     │  │     ╰─ dit_events [1072]
    │     │     │  │        ╰─ .
    │     │     │  │           ╰─ {format} [1072]
    │     │     │  ├─ b
    │     │     │  │  ├─ adges/release [1092]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format:48} [1092]
    │     │     │  │  ├─ ranches [1110]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ├─ diverging_commit_counts [1113]
    │     │     │  │  │     ├─ new [1116]
    │     │     │  │  │     ├─ {state:45} [1115]
    │     │     │  │  │     ╰─ {id:42} [1111]
    │     │     │  │  ├─ oards [1108]
    │     │     │  │  │  ├─ .
    │     │     │  │  │  │  ╰─ {format} [1108]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ╰─ {id:3} [1109]
    │     │     │  │  │        ╰─ .
    │     │     │  │  │           ╰─ {format} [1109]
    │     │     │  │  ╰─ l
    │     │     │  │     ├─ ame
    │     │     │  │     │  ├─ _page/
    │     │     │  │     │  │  ╰─ {*id:46} [1093]
    │     │     │  │     │  ╰─ /
    │     │     │  │     │     ├─ {*id:46}
    │     │     │  │     │     │  ╰─ /streaming [1096]
    │     │     │  │     │     ╰─ {*id:46} [1094]
    │     │     │  │     ╰─ ob/
    │     │     │  │        ├─ {*id:46}
    │     │     │  │        │  ╰─ /diff [1100]
    │     │     │  │        ╰─ {*id:46} [1097]
    │     │     │  ├─ c
    │     │     │  │  ├─ ycle_analytics [1852]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [1852]
    │     │     │  │  ├─ adences/
    │     │     │  │  │  ├─ new [1328]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1328]
    │     │     │  │  │  ├─ {iteration_cadence_id}
    │     │     │  │  │  │  ╰─ /iterations [1331]
    │     │     │  │  │  │     ├─ .
    │     │     │  │  │  │     │  ╰─ {format} [1331]
    │     │     │  │  │  │     ╰─ /
    │     │     │  │  │  │        ╰─ {id:3} [1332]
    │     │     │  │  │  │           ╰─ .
    │     │     │  │  │  │              ╰─ {format} [1332]
    │     │     │  │  │  ├─ {id}
    │     │     │  │  │  │  ╰─ /edit [1330]
    │     │     │  │  │  │     ╰─ .
    │     │     │  │  │  │        ╰─ {format} [1330]
    │     │     │  │  │  ╰─ {*vueroute}
    │     │     │  │  │     ╰─ /
    │     │     │  │  │        ├─ new [1328]
    │     │     │  │  │        │  ╰─ .
    │     │     │  │  │        │     ╰─ {format} [1328]
    │     │     │  │  │        ├─ {iteration_cadence_id}
    │     │     │  │  │        │  ╰─ /iterations [1331]
    │     │     │  │  │        │     ├─ .
    │     │     │  │  │        │     │  ╰─ {format} [1331]
    │     │     │  │  │        │     ╰─ /
    │     │     │  │  │        │        ╰─ {id:3} [1332]
    │     │     │  │  │        │           ╰─ .
    │     │     │  │  │        │              ╰─ {format} [1332]
    │     │     │  │  │        ╰─ {id}
    │     │     │  │  │           ╰─ /edit [1330]
    │     │     │  │  │              ╰─ .
    │     │     │  │  │                 ╰─ {format} [1330]
    │     │     │  │  ├─ luster
    │     │     │  │  │  ├─ _agents/
    │     │     │  │  │  │  ╰─ {name} [1130]
    │     │     │  │  │  │     ╰─ .
    │     │     │  │  │  │        ╰─ {format} [1130]
    │     │     │  │  │  ╰─ s [1137]
    │     │     │  │  │     ├─ .
    │     │     │  │  │     │  ╰─ {format} [1137]
    │     │     │  │  │     ╰─ /
    │     │     │  │  │        ├─ new_cluster_docs [1140]
    │     │     │  │  │        │  ╰─ .
    │     │     │  │  │        │     ╰─ {format} [1140]
    │     │     │  │  │        ├─ c
    │     │     │  │  │        │  ├─ reate_user [1134]
    │     │     │  │  │        │  │  ╰─ .
    │     │     │  │  │        │  │     ╰─ {format} [1134]
    │     │     │  │  │        │  ╰─ onnect [1133]
    │     │     │  │  │        │     ╰─ .
    │     │     │  │  │        │        ╰─ {format} [1133]
    │     │     │  │  │        ├─ {cluster_id}
    │     │     │  │  │        │  ╰─ /integration/create_or_update [1144]
    │     │     │  │  │        │     ╰─ .
    │     │     │  │  │        │        ╰─ {format} [1144]
    │     │     │  │  │        ╰─ {id}
    │     │     │  │  │           ╰─ /
    │     │     │  │  │              ├─ environments [1136]
    │     │     │  │  │              │  ╰─ .
    │     │     │  │  │              │     ╰─ {format} [1136]
    │     │     │  │  │              ├─ metrics [1138]
    │     │     │  │  │              │  ├─ _dashboard [1139]
    │     │     │  │  │              │  │  ╰─ .
    │     │     │  │  │              │  │     ╰─ {format} [1139]
    │     │     │  │  │              │  ╰─ .
    │     │     │  │  │              │     ╰─ {format} [1138]
    │     │     │  │  │              ╰─ cl
    │     │     │  │  │                 ├─ uster_status [1132]
    │     │     │  │  │                 │  ╰─ .
    │     │     │  │  │                 │     ╰─ {format} [1132]
    │     │     │  │  │                 ╰─ ear_cache [1131]
    │     │     │  │  │                    ╰─ .
    │     │     │  │  │                       ╰─ {format} [1131]
    │     │     │  │  ├─ reate
    │     │     │  │  │  ├─ _dir/
    │     │     │  │  │  │  ╰─ {*id:46} [1751]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ╰─ {*id:46} [1098]
    │     │     │  │  ├─ i/
    │     │     │  │  │  ├─ prometheus_metrics/histograms [1129]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format:37} [1129]
    │     │     │  │  │  ├─ daily_build_group_report_results [1125]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format:38} [1125]
    │     │     │  │  │  ╰─ editor [1128]
    │     │     │  │  │     ╰─ .
    │     │     │  │  │        ╰─ {format} [1128]
    │     │     │  │  ╰─ om
    │     │     │  │     ├─ pare [1159]
    │     │     │  │     │  ╰─ /
    │     │     │  │     │     ├─ diff
    │     │     │  │     │     │  ├─ _for_path [1160]
    │     │     │  │     │     │  ╰─ s_stream [1167]
    │     │     │  │     │     ├─ signatures [1166]
    │     │     │  │     │     ├─ {from:26}
    │     │     │  │     │     │  ╰─ ..
    │     │     │  │     │     │     ├─ .
    │     │     │  │     │     │     │  ╰─ {to:26} [1164]
    │     │     │  │     │     │     ╰─ {to:26} [1165]
    │     │     │  │     │     ╰─ {from}
    │     │     │  │     │        ╰─ ..
    │     │     │  │     │           ├─ .
    │     │     │  │     │           │  ╰─ {to} [1162]
    │     │     │  │     │           ╰─ {to} [1163]
    │     │     │  │     ╰─ m
    │     │     │  │        ├─ ent_templates [1145]
    │     │     │  │        │  ├─ .
    │     │     │  │        │  │  ╰─ {format} [1145]
    │     │     │  │        │  ╰─ /
    │     │     │  │        │     ╰─ {id} [1146]
    │     │     │  │        │        ╰─ .
    │     │     │  │        │           ╰─ {format} [1146]
    │     │     │  │        ╰─ it
    │     │     │  │           ├─ s [1156]
    │     │     │  │           │  ╰─ /
    │     │     │  │           │     ├─ {*id:46}
    │     │     │  │           │     │  ╰─ /signatures [1158]
    │     │     │  │           │     ╰─ {*id:46} [1157]
    │     │     │  │           ╰─ /
    │     │     │  │              ╰─ {id:47} [1154]
    │     │     │  │                 ├─ .
    │     │     │  │                 │  ╰─ {format} [1154]
    │     │     │  │                 ╰─ /
    │     │     │  │                    ├─ merge_requests [1151]
    │     │     │  │                    │  ╰─ .
    │     │     │  │                    │     ╰─ {format} [1151]
    │     │     │  │                    ├─ cherry_pick [1148]
    │     │     │  │                    │  ╰─ .
    │     │     │  │                    │     ╰─ {format} [1148]
    │     │     │  │                    ├─ pipelines [1152]
    │     │     │  │                    │  ╰─ .
    │     │     │  │                    │     ╰─ {format} [1152]
    │     │     │  │                    ├─ branches [1147]
    │     │     │  │                    │  ╰─ .
    │     │     │  │                    │     ╰─ {format} [1147]
    │     │     │  │                    ├─ revert [1153]
    │     │     │  │                    │  ╰─ .
    │     │     │  │                    │     ╰─ {format} [1153]
    │     │     │  │                    ╰─ diff
    │     │     │  │                       ├─ s_stream [1155]
    │     │     │  │                       │  ╰─ .
    │     │     │  │                       │     ╰─ {format} [1155]
    │     │     │  │                       ╰─ _f
    │     │     │  │                          ├─ or_path [1150]
    │     │     │  │                          │  ╰─ .
    │     │     │  │                          │     ╰─ {format} [1150]
    │     │     │  │                          ╰─ iles [1149]
    │     │     │  │                             ╰─ .
    │     │     │  │                                ╰─ {format} [1149]
    │     │     │  ├─ e
    │     │     │  │  ├─ scalation_policies [1280]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [1280]
    │     │     │  │  ├─ rror_tracking [1216]
    │     │     │  │  │  ├─ .
    │     │     │  │  │  │  ╰─ {format} [1216]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ├─ projects [1218]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1218]
    │     │     │  │  │     ╰─ {issue_id} [1217]
    │     │     │  │  │        ├─ /
    │     │     │  │  │        │  ├─ stack_trace [1219]
    │     │     │  │  │        │  │  ╰─ .
    │     │     │  │  │        │  │     ╰─ {format} [1219]
    │     │     │  │  │        │  ╰─ details [1215]
    │     │     │  │  │        │     ╰─ .
    │     │     │  │  │        │        ╰─ {format} [1215]
    │     │     │  │  │        ╰─ .
    │     │     │  │  │           ╰─ {format} [1217]
    │     │     │  │  ├─ nvironments/
    │     │     │  │  │  ├─ search [1207]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1207]
    │     │     │  │  │  ├─ new [1206]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1206]
    │     │     │  │  │  ├─ folders/
    │     │     │  │  │  │  ├─ {*id}
    │     │     │  │  │  │  │  ╰─ .
    │     │     │  │  │  │  │     ╰─ {format:13} [1203]
    │     │     │  │  │  │  ╰─ {*id} [1203]
    │     │     │  │  │  ├─ {environment_id}
    │     │     │  │  │  │  ╰─ /deployments [1192]
    │     │     │  │  │  │     ├─ .
    │     │     │  │  │  │     │  ╰─ {format} [1192]
    │     │     │  │  │  │     ╰─ /
    │     │     │  │  │  │        ╰─ {id} [1194]
    │     │     │  │  │  │           ├─ .
    │     │     │  │  │  │           │  ╰─ {format} [1194]
    │     │     │  │  │  │           ╰─ /
    │     │     │  │  │  │              ├─ additional_metrics [1191]
    │     │     │  │  │  │              │  ╰─ .
    │     │     │  │  │  │              │     ╰─ {format} [1191]
    │     │     │  │  │  │              ╰─ metrics [1193]
    │     │     │  │  │  │                 ╰─ .
    │     │     │  │  │  │                    ╰─ {format} [1193]
    │     │     │  │  │  ╰─ {id} [1213]
    │     │     │  │  │     ├─ .
    │     │     │  │  │     │  ╰─ {format} [1213]
    │     │     │  │  │     ╰─ /
    │     │     │  │  │        ├─ cancel_auto_stop [1200]
    │     │     │  │  │        │  ╰─ .
    │     │     │  │  │        │     ╰─ {format} [1200]
    │     │     │  │  │        ├─ terminal [1210]
    │     │     │  │  │        │  ╰─ .
    │     │     │  │  │        │     ├─ ws/authorize [1211]
    │     │     │  │  │        │     ╰─ {format} [1210]
    │     │     │  │  │        ├─ edit [1202]
    │     │     │  │  │        │  ╰─ .
    │     │     │  │  │        │     ╰─ {format} [1202]
    │     │     │  │  │        ├─ stop [1209]
    │     │     │  │  │        │  ╰─ .
    │     │     │  │  │        │     ╰─ {format} [1209]
    │     │     │  │  │        ├─ k8s [1205]
    │     │     │  │  │        │  ├─ .
    │     │     │  │  │        │  │  ╰─ {format} [1205]
    │     │     │  │  │        │  ╰─ /
    │     │     │  │  │        │     ├─ {*vueroute}
    │     │     │  │  │        │     │  ╰─ .
    │     │     │  │  │        │     │     ╰─ {format} [1205]
    │     │     │  │  │        │     ╰─ {*vueroute} [1205]
    │     │     │  │  │        ╰─ prometheus/api/v1/
    │     │     │  │  │           ├─ {*proxy_path}
    │     │     │  │  │           │  ╰─ .
    │     │     │  │  │           │     ╰─ {format} [1214]
    │     │     │  │  │           ╰─ {*proxy_path} [1214]
    │     │     │  │  ╰─ dit/
    │     │     │  │     ╰─ {*id:46} [1101]
    │     │     │  ├─ f
    │     │     │  │  ├─ orks/new [1240]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [1240]
    │     │     │  │  ├─ eature_flags
    │     │     │  │  │  ├─ _
    │     │     │  │  │  │  ├─ client/reset_token [1231]
    │     │     │  │  │  │  │  ╰─ .
    │     │     │  │  │  │  │     ╰─ {format} [1231]
    │     │     │  │  │  │  ╰─ user_lists [1233]
    │     │     │  │  │  │     ├─ .
    │     │     │  │  │  │     │  ╰─ {format} [1233]
    │     │     │  │  │  │     ╰─ /
    │     │     │  │  │  │        ├─ new [1234]
    │     │     │  │  │  │        │  ╰─ .
    │     │     │  │  │  │        │     ╰─ {format} [1234]
    │     │     │  │  │  │        ╰─ {iid} [1235]
    │     │     │  │  │  │           ├─ /edit [1232]
    │     │     │  │  │  │           │  ╰─ .
    │     │     │  │  │  │           │     ╰─ {format} [1232]
    │     │     │  │  │  │           ╰─ .
    │     │     │  │  │  │              ╰─ {format} [1235]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ├─ new [1227]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1227]
    │     │     │  │  │     ├─ {iid}
    │     │     │  │  │     │  ╰─ /edit [1225]
    │     │     │  │  │     │     ╰─ .
    │     │     │  │  │     │        ╰─ {format} [1225]
    │     │     │  │  │     ╰─ {feature_flag_iid}
    │     │     │  │  │        ╰─ /issues/
    │     │     │  │  │           ╰─ {id} [1221]
    │     │     │  │  │              ╰─ .
    │     │     │  │  │                 ╰─ {format} [1221]
    │     │     │  │  ╰─ i
    │     │     │  │     ├─ nd_file/
    │     │     │  │     │  ╰─ {*id:46} [1237]
    │     │     │  │     ╰─ les/
    │     │     │  │        ╰─ {*id:46} [1236]
    │     │     │  ├─ g
    │     │     │  │  ├─ oogle_cloud [1847]
    │     │     │  │  │  ├─ .
    │     │     │  │  │  │  ╰─ {format} [1847]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ├─ artifact_registry [1241]
    │     │     │  │  │     │  ├─ /projects/
    │     │     │  │  │     │  │  ╰─ {project}
    │     │     │  │  │     │  │     ╰─ /locations/
    │     │     │  │  │     │  │        ╰─ {location}
    │     │     │  │  │     │  │           ╰─ /repositories/
    │     │     │  │  │     │  │              ╰─ {repository}
    │     │     │  │  │     │  │                 ╰─ /dockerImages/
    │     │     │  │  │     │  │                    ╰─ {image} [1242]
    │     │     │  │  │     │  │                       ╰─ .
    │     │     │  │  │     │  │                          ╰─ {format} [1242]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1241]
    │     │     │  │  │     ├─ configuration [1243]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1243]
    │     │     │  │  │     ├─ revoke_oauth [1252]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1252]
    │     │     │  │  │     ╰─ d
    │     │     │  │  │        ├─ eployments [1249]
    │     │     │  │  │        │  ├─ /cloud_
    │     │     │  │  │        │  │  ├─ storage [1248]
    │     │     │  │  │        │  │  │  ╰─ .
    │     │     │  │  │        │  │  │     ╰─ {format} [1248]
    │     │     │  │  │        │  │  ╰─ run [1247]
    │     │     │  │  │        │  │     ╰─ .
    │     │     │  │  │        │  │        ╰─ {format} [1247]
    │     │     │  │  │        │  ╰─ .
    │     │     │  │  │        │     ╰─ {format} [1249]
    │     │     │  │  │        ╰─ atabases/new/
    │     │     │  │  │           ╰─ {product} [1246]
    │     │     │  │  │              ╰─ .
    │     │     │  │  │                 ╰─ {format} [1246]
    │     │     │  │  ╰─ r
    │     │     │  │     ├─ oup_links/
    │     │     │  │     │  ╰─ {id:16} [1262]
    │     │     │  │     │     ╰─ .
    │     │     │  │     │        ╰─ {format} [1262]
    │     │     │  │     ╰─ aphs/
    │     │     │  │        ╰─ {id:42} [1259]
    │     │     │  │           ╰─ /
    │     │     │  │              ├─ languages [1258]
    │     │     │  │              ╰─ c
    │     │     │  │                 ├─ ommits [1257]
    │     │     │  │                 ├─ harts [1255]
    │     │     │  │                 ╰─ i [1256]
    │     │     │  ├─ h
    │     │     │  │  ├─ arbor/repositories [1264]
    │     │     │  │  │  ├─ .
    │     │     │  │  │  │  ╰─ {format} [1264]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ├─ {id:17} [1265]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1265]
    │     │     │  │  │     ╰─ {repository_id:17}
    │     │     │  │  │        ╰─ /artifacts [1263]
    │     │     │  │  │           ├─ .
    │     │     │  │  │           │  ╰─ {format} [1263]
    │     │     │  │  │           ╰─ /
    │     │     │  │  │              ╰─ {artifact_id:17}
    │     │     │  │  │                 ╰─ /tags [1266]
    │     │     │  │  │                    ╰─ .
    │     │     │  │  │                       ╰─ {format} [1266]
    │     │     │  │  ╰─ ooks/
    │     │     │  │     ├─ {id:3} [1275]
    │     │     │  │     │  ├─ .
    │     │     │  │     │  │  ╰─ {format} [1275]
    │     │     │  │     │  ╰─ /
    │     │     │  │     │     ├─ edit [1271]
    │     │     │  │     │     │  ╰─ .
    │     │     │  │     │     │     ╰─ {format} [1271]
    │     │     │  │     │     ╰─ test [1273]
    │     │     │  │     │        ╰─ .
    │     │     │  │     │           ╰─ {format} [1273]
    │     │     │  │     ╰─ {hook_id:3}
    │     │     │  │        ╰─ /hook_logs/
    │     │     │  │           ╰─ {id:3} [1268]
    │     │     │  │              ├─ /retry [1267]
    │     │     │  │              │  ╰─ .
    │     │     │  │              │     ╰─ {format} [1267]
    │     │     │  │              ╰─ .
    │     │     │  │                 ╰─ {format} [1268]
    │     │     │  ├─ i
    │     │     │  │  ├─ terations [1336]
    │     │     │  │  │  ├─ .
    │     │     │  │  │  │  ╰─ {format} [1336]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ╰─ {id:3} [1337]
    │     │     │  │  │        ╰─ .
    │     │     │  │  │           ╰─ {format} [1337]
    │     │     │  │  ├─ mport/
    │     │     │  │  │  ├─ jira [1276]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1276]
    │     │     │  │  │  ╰─ new [1278]
    │     │     │  │  │     ╰─ .
    │     │     │  │  │        ╰─ {format} [1278]
    │     │     │  │  ├─ ssues
    │     │     │  │  │  ├─ .ics [1300]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ├─ service_desk [1319]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1319]
    │     │     │  │  │     ├─ bulk_update [1299]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1299]
    │     │     │  │  │     ├─ export_csv [1310]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1310]
    │     │     │  │  │     ├─ new [1315]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1315]
    │     │     │  │  │     ├─ i
    │     │     │  │  │     │  ├─ mport_csv [1311]
    │     │     │  │  │     │  │  ╰─ .
    │     │     │  │  │     │  │     ╰─ {format} [1311]
    │     │     │  │  │     │  ╰─ ncident/
    │     │     │  │  │     │     ╰─ {id:3} [1285]
    │     │     │  │  │     │        ├─ .
    │     │     │  │  │     │        │  ╰─ {format} [1285]
    │     │     │  │  │     │        ╰─ /
    │     │     │  │  │     │           ╰─ {incident_tab:41} [1285]
    │     │     │  │  │     │              ╰─ .
    │     │     │  │  │     │                 ╰─ {format} [1285]
    │     │     │  │  │     ├─ {issue_id:3}
    │     │     │  │  │     │  ╰─ /
    │     │     │  │  │     │     ├─ feature_flags [1294]
    │     │     │  │  │     │     │  ├─ .
    │     │     │  │  │     │     │  │  ╰─ {format} [1294]
    │     │     │  │  │     │     │  ╰─ /
    │     │     │  │  │     │     │     ╰─ {id:3} [1295]
    │     │     │  │  │     │     │        ╰─ .
    │     │     │  │  │     │     │           ╰─ {format} [1295]
    │     │     │  │  │     │     ╰─ links/
    │     │     │  │  │     │        ╰─ {id:3} [1297]
    │     │     │  │  │     │           ╰─ .
    │     │     │  │  │     │              ╰─ {format} [1297]
    │     │     │  │  │     ╰─ {id:3}
    │     │     │  │  │        ╰─ /
    │     │     │  │  │           ├─ toggle_
    │     │     │  │  │           │  ├─ subscription [1323]
    │     │     │  │  │           │  │  ╰─ .
    │     │     │  │  │           │  │     ╰─ {format} [1323]
    │     │     │  │  │           │  ╰─ award_emoji [1322]
    │     │     │  │  │           │     ╰─ .
    │     │     │  │  │           │        ╰─ {format} [1322]
    │     │     │  │  │           ├─ edit [1309]
    │     │     │  │  │           │  ╰─ .
    │     │     │  │  │           │     ╰─ {format} [1309]
    │     │     │  │  │           ├─ re
    │     │     │  │  │           │  ├─ altime_changes [1316]
    │     │     │  │  │           │  │  ╰─ .
    │     │     │  │  │           │  │     ╰─ {format} [1316]
    │     │     │  │  │           │  ├─ lated_branches [1317]
    │     │     │  │  │           │  │  ╰─ .
    │     │     │  │  │           │  │     ╰─ {format} [1317]
    │     │     │  │  │           │  ╰─ order [1318]
    │     │     │  │  │           │     ╰─ .
    │     │     │  │  │           │        ╰─ {format} [1318]
    │     │     │  │  │           ├─ c
    │     │     │  │  │           │  ├─ reate_merge_request [1303]
    │     │     │  │  │           │  │  ╰─ .
    │     │     │  │  │           │  │     ╰─ {format} [1303]
    │     │     │  │  │           │  ╰─ an_create_branch [1301]
    │     │     │  │  │           │     ╰─ .
    │     │     │  │  │           │        ╰─ {format} [1301]
    │     │     │  │  │           ├─ d
    │     │     │  │  │           │  ├─ iscussions [1308]
    │     │     │  │  │           │  │  ╰─ .
    │     │     │  │  │           │  │     ╰─ {format} [1308]
    │     │     │  │  │           │  ╰─ es
    │     │     │  │  │           │     ├─ igns [1306]
    │     │     │  │  │           │     │  ╰─ /
    │     │     │  │  │           │     │     ╰─ {*vueroute} [1306]
    │     │     │  │  │           │     ╰─ criptions/
    │     │     │  │  │           │        ╰─ {version_id} [1304]
    │     │     │  │  │           │           ├─ /diff [1305]
    │     │     │  │  │           │           │  ╰─ .
    │     │     │  │  │           │           │     ╰─ {format} [1305]
    │     │     │  │  │           │           ╰─ .
    │     │     │  │  │           │              ╰─ {format} [1304]
    │     │     │  │  │           ├─ m
    │     │     │  │  │           │  ├─ ark_as_spam [1313]
    │     │     │  │  │           │  │  ╰─ .
    │     │     │  │  │           │  │     ╰─ {format} [1313]
    │     │     │  │  │           │  ╰─ ove [1314]
    │     │     │  │  │           │     ╰─ .
    │     │     │  │  │           │        ╰─ {format} [1314]
    │     │     │  │  │           ╰─ {incident_tab:41} [1321]
    │     │     │  │  │              ╰─ .
    │     │     │  │  │                 ╰─ {format} [1321]
    │     │     │  │  ╰─ n
    │     │     │  │     ├─ frastructure_registry [1851]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1851]
    │     │     │  │     ├─ tegrations/
    │     │     │  │     │  ├─ zentao/issues [1292]
    │     │     │  │     │  │  ├─ .
    │     │     │  │     │  │  │  ╰─ {format} [1292]
    │     │     │  │     │  │  ╰─ /
    │     │     │  │     │  │     ╰─ {id} [1293]
    │     │     │  │     │  │        ╰─ .
    │     │     │  │     │  │           ╰─ {format} [1293]
    │     │     │  │     │  ├─ jira/issues [1288]
    │     │     │  │     │  │  ├─ .
    │     │     │  │     │  │  │  ╰─ {format} [1288]
    │     │     │  │     │  │  ╰─ /
    │     │     │  │     │  │     ╰─ {id} [1289]
    │     │     │  │     │  │        ╰─ .
    │     │     │  │     │  │           ╰─ {format} [1289]
    │     │     │  │     │  ╰─ slash_commands [1291]
    │     │     │  │     │     ├─ /confirm [1290]
    │     │     │  │     │     │  ╰─ .
    │     │     │  │     │     │     ╰─ {format} [1290]
    │     │     │  │     │     ╰─ .
    │     │     │  │     │        ╰─ {format} [1291]
    │     │     │  │     ╰─ cident
    │     │     │  │        ├─ _management/timeline_events/preview_markdown [1283]
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [1283]
    │     │     │  │        ╰─ s [1284]
    │     │     │  │           ├─ /integrations/pagerduty [1282]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [1282]
    │     │     │  │           ╰─ .
    │     │     │  │              ╰─ {format} [1284]
    │     │     │  ├─ l
    │     │     │  │  ├─ earn_gitlab [1367]
    │     │     │  │  │  ├─ /end_tutorial [1366]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1366]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [1367]
    │     │     │  │  ├─ ogs [1368]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [1368]
    │     │     │  │  ╰─ abels/
    │     │     │  │     ├─ set_priorities [1362]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1362]
    │     │     │  │     ├─ generate [1357]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1357]
    │     │     │  │     ├─ new [1359]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1359]
    │     │     │  │     ╰─ {id:3} [1365]
    │     │     │  │        ├─ .
    │     │     │  │        │  ╰─ {format} [1365]
    │     │     │  │        ╰─ /
    │     │     │  │           ├─ toggle_subscription [1363]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [1363]
    │     │     │  │           ├─ remove_priority [1361]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [1361]
    │     │     │  │           ├─ promote [1360]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format} [1360]
    │     │     │  │           ╰─ edit [1356]
    │     │     │  │              ╰─ .
    │     │     │  │                 ╰─ {format} [1356]
    │     │     │  ├─ m
    │     │     │  │  ├─ l/
    │     │     │  │  │  ├─ preview_markdown [1469]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1469]
    │     │     │  │  │  ├─ experiments [1481]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1481]
    │     │     │  │  │  ├─ agents/
    │     │     │  │  │  │  ├─ new [1472]
    │     │     │  │  │  │  │  ╰─ .
    │     │     │  │  │  │  │     ╰─ {format} [1472]
    │     │     │  │  │  │  ├─ {id}
    │     │     │  │  │  │  │  ╰─ /edit [1474]
    │     │     │  │  │  │  │     ╰─ .
    │     │     │  │  │  │  │        ╰─ {format} [1474]
    │     │     │  │  │  │  ╰─ {*vueroute}
    │     │     │  │  │  │     ╰─ /
    │     │     │  │  │  │        ├─ new [1472]
    │     │     │  │  │  │        │  ╰─ .
    │     │     │  │  │  │        │     ╰─ {format} [1472]
    │     │     │  │  │  │        ╰─ {id}
    │     │     │  │  │  │           ╰─ /edit [1474]
    │     │     │  │  │  │              ╰─ .
    │     │     │  │  │  │                 ╰─ {format} [1474]
    │     │     │  │  │  ╰─ models [1488]
    │     │     │  │  │     ├─ .
    │     │     │  │  │     │  ╰─ {format} [1488]
    │     │     │  │  │     ╰─ /
    │     │     │  │  │        ├─ new [1489]
    │     │     │  │  │        │  ╰─ .
    │     │     │  │  │        │     ╰─ {format} [1489]
    │     │     │  │  │        ├─ {model_id}
    │     │     │  │  │        │  ╰─ /edit [1487]
    │     │     │  │  │        │     ╰─ .
    │     │     │  │  │        │        ╰─ {format} [1487]
    │     │     │  │  │        ╰─ {model_model_id}
    │     │     │  │  │           ╰─ /versions/
    │     │     │  │  │              ├─ new [1484]
    │     │     │  │  │              │  ╰─ .
    │     │     │  │  │              │     ╰─ {format} [1484]
    │     │     │  │  │              ╰─ {model_version_id} [1485]
    │     │     │  │  │                 ├─ /edit [1483]
    │     │     │  │  │                 │  ╰─ .
    │     │     │  │  │                 │     ╰─ {format} [1483]
    │     │     │  │  │                 ╰─ .
    │     │     │  │  │                    ╰─ {format} [1485]
    │     │     │  │  ├─ attermost [1369]
    │     │     │  │  │  ├─ /new [1370]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1370]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [1369]
    │     │     │  │  ├─ e
    │     │     │  │  │  ├─ trics [1449]
    │     │     │  │  │  │  ├─ .
    │     │     │  │  │  │  │  ╰─ {format} [1449]
    │     │     │  │  │  │  ╰─ /
    │     │     │  │  │  │     ╰─ {id:0} [1450]
    │     │     │  │  │  │        ╰─ .
    │     │     │  │  │  │           ╰─ {format} [1450]
    │     │     │  │  │  ╰─ rge
    │     │     │  │  │     ├─ d_branches [1112]
    │     │     │  │  │     ╰─ _
    │     │     │  │  │        ├─ trains [1448]
    │     │     │  │  │        │  ╰─ .
    │     │     │  │  │        │     ╰─ {format} [1448]
    │     │     │  │  │        ╰─ requests/
    │     │     │  │  │           ├─ new [1428]
    │     │     │  │  │           │  ├─ .
    │     │     │  │  │           │  │  ╰─ {format} [1428]
    │     │     │  │  │           │  ╰─ /
    │     │     │  │  │           │     ├─ target_projects [1432]
    │     │     │  │  │           │     │  ╰─ .
    │     │     │  │  │           │     │     ╰─ {format} [1432]
    │     │     │  │  │           │     ├─ pipelines [1430]
    │     │     │  │  │           │     │  ╰─ .
    │     │     │  │  │           │     │     ├─ json [1431]
    │     │     │  │  │           │     │     ╰─ {format} [1430]
    │     │     │  │  │           │     ├─ branch_
    │     │     │  │  │           │     │  ├─ from [1423]
    │     │     │  │  │           │     │  │  ╰─ .
    │     │     │  │  │           │     │  │     ╰─ {format} [1423]
    │     │     │  │  │           │     │  ╰─ to [1424]
    │     │     │  │  │           │     │     ╰─ .
    │     │     │  │  │           │     │        ╰─ {format} [1424]
    │     │     │  │  │           │     ╰─ diff
    │     │     │  │  │           │        ├─ _for_path [1426]
    │     │     │  │  │           │        │  ╰─ .
    │     │     │  │  │           │        │     ╰─ {format} [1426]
    │     │     │  │  │           │        ╰─ s [1429]
    │     │     │  │  │           │           ╰─ .
    │     │     │  │  │           │              ├─ json [1427]
    │     │     │  │  │           │              ╰─ {format} [1429]
    │     │     │  │  │           ├─ diff_for_path [1390]
    │     │     │  │  │           │  ╰─ .
    │     │     │  │  │           │     ╰─ {format} [1390]
    │     │     │  │  │           ├─ bulk_update [1374]
    │     │     │  │  │           │  ╰─ .
    │     │     │  │  │           │     ╰─ {format} [1374]
    │     │     │  │  │           ├─ export_csv [1394]
    │     │     │  │  │           │  ╰─ .
    │     │     │  │  │           │     ╰─ {format} [1394]
    │     │     │  │  │           ├─ {merge_request_id:3}
    │     │     │  │  │           │  ╰─ /
    │     │     │  │  │           │     ├─ drafts/
    │     │     │  │  │           │     │  ├─ discard [1442]
    │     │     │  │  │           │     │  │  ╰─ .
    │     │     │  │  │           │     │  │     ╰─ {format} [1442]
    │     │     │  │  │           │     │  ├─ publish [1444]
    │     │     │  │  │           │     │  │  ╰─ .
    │     │     │  │  │           │     │  │     ╰─ {format} [1444]
    │     │     │  │  │           │     │  ╰─ {id:3} [1446]
    │     │     │  │  │           │     │     ╰─ .
    │     │     │  │  │           │     │        ╰─ {format} [1446]
    │     │     │  │  │           │     ╰─ approver
    │     │     │  │  │           │        ├─ _groups/
    │     │     │  │  │           │        │  ╰─ {id:3} [1059]
    │     │     │  │  │           │        │     ╰─ .
    │     │     │  │  │           │        │        ╰─ {format} [1059]
    │     │     │  │  │           │        ╰─ s [1062]
    │     │     │  │  │           │           ├─ .
    │     │     │  │  │           │           │  ╰─ {format} [1062]
    │     │     │  │  │           │           ╰─ /
    │     │     │  │  │           │              ╰─ {id:3} [1061]
    │     │     │  │  │           │                 ╰─ .
    │     │     │  │  │           │                    ╰─ {format} [1061]
    │     │     │  │  │           ╰─ {id:3}
    │     │     │  │  │              ╰─ /
    │     │     │  │  │                 ├─ license_scanning_reports [1397]
    │     │     │  │  │                 │  ├─ _collapsed [1398]
    │     │     │  │  │                 │  │  ╰─ .
    │     │     │  │  │                 │  │     ╰─ {format} [1398]
    │     │     │  │  │                 │  ╰─ .
    │     │     │  │  │                 │     ╰─ {format} [1397]
    │     │     │  │  │                 ├─ widget [1422]
    │     │     │  │  │                 │  ╰─ .
    │     │     │  │  │                 │     ╰─ {format} [1422]
    │     │     │  │  │                 ├─ pipeline
    │     │     │  │  │                 │  ├─ _status [1401]
    │     │     │  │  │                 │  │  ╰─ .
    │     │     │  │  │                 │  │     ╰─ {format} [1401]
    │     │     │  │  │                 │  ╰─ s [1411]
    │     │     │  │  │                 │     ╰─ .
    │     │     │  │  │                 │        ├─ json [1402]
    │     │     │  │  │                 │        ╰─ {format} [1411]
    │     │     │  │  │                 ├─ me
    │     │     │  │  │                 │  ├─ trics_reports [1400]
    │     │     │  │  │                 │  │  ╰─ .
    │     │     │  │  │                 │  │     ╰─ {format} [1400]
    │     │     │  │  │                 │  ╰─ rge [1399]
    │     │     │  │  │                 │     ╰─ .
    │     │     │  │  │                 │        ╰─ {format} [1399]
    │     │     │  │  │                 ├─ re
    │     │     │  │  │                 │  ├─ solve_conflicts [1419]
    │     │     │  │  │                 │  │  ╰─ .
    │     │     │  │  │                 │  │     ╰─ {format} [1419]
    │     │     │  │  │                 │  ├─ move_wip [1404]
    │     │     │  │  │                 │  │  ╰─ .
    │     │     │  │  │                 │  │     ╰─ {format} [1404]
    │     │     │  │  │                 │  ├─ ports [1405]
    │     │     │  │  │                 │  │  ╰─ .
    │     │     │  │  │                 │  │     ╰─ {format} [1405]
    │     │     │  │  │                 │  ╰─ base [1403]
    │     │     │  │  │                 │     ╰─ .
    │     │     │  │  │                 │        ╰─ {format} [1403]
    │     │     │  │  │                 ├─ a
    │     │     │  │  │                 │  ├─ ccessibility_reports [1371]
    │     │     │  │  │                 │  │  ╰─ .
    │     │     │  │  │                 │  │     ╰─ {format} [1371]
    │     │     │  │  │                 │  ├─ ssign_related_issues [1373]
    │     │     │  │  │                 │  │  ╰─ .
    │     │     │  │  │                 │  │     ╰─ {format} [1373]
    │     │     │  │  │                 │  ╰─ pi_fuzzing_reports [1372]
    │     │     │  │  │                 │     ╰─ .
    │     │     │  │  │                 │        ╰─ {format} [1372]
    │     │     │  │  │                 ├─ c
    │     │     │  │  │                 │  ├─ o
    │     │     │  │  │                 │  │  ├─ verage_
    │     │     │  │  │                 │  │  │  ├─ fuzzing_reports [1383]
    │     │     │  │  │                 │  │  │  │  ╰─ .
    │     │     │  │  │                 │  │  │  │     ╰─ {format} [1383]
    │     │     │  │  │                 │  │  │  ╰─ reports [1384]
    │     │     │  │  │                 │  │  │     ╰─ .
    │     │     │  │  │                 │  │  │        ╰─ {format} [1384]
    │     │     │  │  │                 │  │  ├─ dequality_
    │     │     │  │  │                 │  │  │  ├─ mr_diff_reports [1377]
    │     │     │  │  │                 │  │  │  │  ╰─ .
    │     │     │  │  │                 │  │  │  │     ╰─ {format} [1377]
    │     │     │  │  │                 │  │  │  ╰─ reports [1378]
    │     │     │  │  │                 │  │  │     ╰─ .
    │     │     │  │  │                 │  │  │        ╰─ {format} [1378]
    │     │     │  │  │                 │  │  ├─ mmit
    │     │     │  │  │                 │  │  │  ├─ _change_content [1379]
    │     │     │  │  │                 │  │  │  │  ╰─ .
    │     │     │  │  │                 │  │  │  │     ╰─ {format} [1379]
    │     │     │  │  │                 │  │  │  ╰─ s [1410]
    │     │     │  │  │                 │  │  │     ╰─ .
    │     │     │  │  │                 │  │  │        ├─ json [1380]
    │     │     │  │  │                 │  │  │        ╰─ {format} [1410]
    │     │     │  │  │                 │  │  ╰─ n
    │     │     │  │  │                 │  │     ├─ flict
    │     │     │  │  │                 │  │     │  ├─ _for_path [1418]
    │     │     │  │  │                 │  │     │  │  ╰─ .
    │     │     │  │  │                 │  │     │  │     ╰─ {format} [1418]
    │     │     │  │  │                 │  │     │  ╰─ s [1420]
    │     │     │  │  │                 │  │     │     ╰─ .
    │     │     │  │  │                 │  │     │        ╰─ {format} [1420]
    │     │     │  │  │                 │  │     ╰─ t
    │     │     │  │  │                 │  │        ├─ ainer_scanning_reports [1381]
    │     │     │  │  │                 │  │        │  ╰─ .
    │     │     │  │  │                 │  │        │     ╰─ {format} [1381]
    │     │     │  │  │                 │  │        ╰─ ext_commits [1382]
    │     │     │  │  │                 │  │           ╰─ .
    │     │     │  │  │                 │  │              ╰─ {format} [1382]
    │     │     │  │  │                 │  ├─ i_environments_status [1376]
    │     │     │  │  │                 │  │  ╰─ .
    │     │     │  │  │                 │  │     ╰─ {format} [1376]
    │     │     │  │  │                 │  ╰─ a
    │     │     │  │  │                 │     ├─ ncel_auto_merge [1375]
    │     │     │  │  │                 │     │  ╰─ .
    │     │     │  │  │                 │     │     ╰─ {format} [1375]
    │     │     │  │  │                 │     ╰─ ched_widget [1421]
    │     │     │  │  │                 │        ╰─ .
    │     │     │  │  │                 │           ╰─ {format} [1421]
    │     │     │  │  │                 ├─ d
    │     │     │  │  │                 │  ├─ ast_reports [1385]
    │     │     │  │  │                 │  │  ╰─ .
    │     │     │  │  │                 │  │     ╰─ {format} [1385]
    │     │     │  │  │                 │  ├─ i
    │     │     │  │  │                 │  │  ├─ scussions [1392]
    │     │     │  │  │                 │  │  │  ╰─ .
    │     │     │  │  │                 │  │  │     ╰─ {format} [1392]
    │     │     │  │  │                 │  │  ╰─ ff
    │     │     │  │  │                 │  │     ├─ s [1391]
    │     │     │  │  │                 │  │     │  ├─ _
    │     │     │  │  │                 │  │     │  │  ├─ metadata [1436]
    │     │     │  │  │                 │  │     │  │  │  ╰─ .
    │     │     │  │  │                 │  │     │  │  │     ╰─ {format} [1436]
    │     │     │  │  │                 │  │     │  │  ├─ stream [1439]
    │     │     │  │  │                 │  │     │  │  │  ╰─ .
    │     │     │  │  │                 │  │     │  │  │     ╰─ {format} [1439]
    │     │     │  │  │                 │  │     │  │  ╰─ batch [1435]
    │     │     │  │  │                 │  │     │  │     ╰─ .
    │     │     │  │  │                 │  │     │  │        ╰─ {format} [1435]
    │     │     │  │  │                 │  │     │  ╰─ .
    │     │     │  │  │                 │  │     │     ├─ json [1437]
    │     │     │  │  │                 │  │     │     ╰─ {format} [1391]
    │     │     │  │  │                 │  │     ╰─ _
    │     │     │  │  │                 │  │        ├─ for_path [1438]
    │     │     │  │  │                 │  │        │  ╰─ .
    │     │     │  │  │                 │  │        │     ├─ json [1434]
    │     │     │  │  │                 │  │        │     ╰─ {format} [1438]
    │     │     │  │  │                 │  │        ╰─ by_file_hash/
    │     │     │  │  │                 │  │           ╰─ {file_hash} [1433]
    │     │     │  │  │                 │  │              ╰─ .
    │     │     │  │  │                 │  │                 ╰─ {format} [1433]
    │     │     │  │  │                 │  ╰─ e
    │     │     │  │  │                 │     ├─ pendency_scanning_reports [1387]
    │     │     │  │  │                 │     │  ╰─ .
    │     │     │  │  │                 │     │     ╰─ {format} [1387]
    │     │     │  │  │                 │     ╰─ scriptions/
    │     │     │  │  │                 │        ╰─ {version_id} [1386]
    │     │     │  │  │                 │           ├─ /diff [1388]
    │     │     │  │  │                 │           │  ╰─ .
    │     │     │  │  │                 │           │     ╰─ {format} [1388]
    │     │     │  │  │                 │           ╰─ .
    │     │     │  │  │                 │              ╰─ {format} [1386]
    │     │     │  │  │                 ├─ e
    │     │     │  │  │                 │  ├─ xposed_artifacts [1395]
    │     │     │  │  │                 │  │  ╰─ .
    │     │     │  │  │                 │  │     ╰─ {format} [1395]
    │     │     │  │  │                 │  ╰─ dit [1393]
    │     │     │  │  │                 │     ╰─ .
    │     │     │  │  │                 │        ╰─ {format} [1393]
    │     │     │  │  │                 ├─ s
    │     │     │  │  │                 │  ├─ ec
    │     │     │  │  │                 │  │  ├─ ret_detection_reports [1407]
    │     │     │  │  │                 │  │  │  ╰─ .
    │     │     │  │  │                 │  │  │     ╰─ {format} [1407]
    │     │     │  │  │                 │  │  ╰─ urity_reports [1408]
    │     │     │  │  │                 │  │     ╰─ .
    │     │     │  │  │                 │  │        ╰─ {format} [1408]
    │     │     │  │  │                 │  ╰─ a
    │     │     │  │  │                 │     ├─ ml_approval [1447]
    │     │     │  │  │                 │     │  ╰─ .
    │     │     │  │  │                 │     │     ╰─ {format} [1447]
    │     │     │  │  │                 │     ╰─ st_reports [1406]
    │     │     │  │  │                 │        ╰─ .
    │     │     │  │  │                 │           ╰─ {format} [1406]
    │     │     │  │  │                 ╰─ t
    │     │     │  │  │                    ├─ oggle_
    │     │     │  │  │                    │  ├─ subscription [1415]
    │     │     │  │  │                    │  │  ╰─ .
    │     │     │  │  │                    │  │     ╰─ {format} [1415]
    │     │     │  │  │                    │  ╰─ award_emoji [1414]
    │     │     │  │  │                    │     ╰─ .
    │     │     │  │  │                    │        ╰─ {format} [1414]
    │     │     │  │  │                    ╰─ e
    │     │     │  │  │                       ├─ rraform_reports [1412]
    │     │     │  │  │                       │  ╰─ .
    │     │     │  │  │                       │     ╰─ {format} [1412]
    │     │     │  │  │                       ╰─ st_reports [1413]
    │     │     │  │  │                          ╰─ .
    │     │     │  │  │                             ╰─ {format} [1413]
    │     │     │  │  ╰─ i
    │     │     │  │     ├─ rror [1467]
    │     │     │  │     │  ├─ /
    │     │     │  │     │  │  ├─ ssh_host_keys [1465]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format:37} [1465]
    │     │     │  │     │  │  ╰─ update_now [1468]
    │     │     │  │     │  │     ╰─ .
    │     │     │  │     │  │        ╰─ {format} [1468]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1467]
    │     │     │  │     ╰─ lestones/
    │     │     │  │        ├─ new [1458]
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [1458]
    │     │     │  │        ╰─ {id:3}
    │     │     │  │           ╰─ /
    │     │     │  │              ├─ merge_requests [1457]
    │     │     │  │              │  ╰─ .
    │     │     │  │              │     ╰─ {format} [1457]
    │     │     │  │              ├─ p
    │     │     │  │              │  ├─ articipants [1459]
    │     │     │  │              │  │  ╰─ .
    │     │     │  │              │  │     ╰─ {format} [1459]
    │     │     │  │              │  ╰─ romote [1460]
    │     │     │  │              │     ╰─ .
    │     │     │  │              │        ╰─ {format} [1460]
    │     │     │  │              ├─ issues [1455]
    │     │     │  │              │  ╰─ .
    │     │     │  │              │     ╰─ {format} [1455]
    │     │     │  │              ├─ labels [1456]
    │     │     │  │              │  ╰─ .
    │     │     │  │              │     ╰─ {format} [1456]
    │     │     │  │              ╰─ edit [1453]
    │     │     │  │                 ╰─ .
    │     │     │  │                    ╰─ {format} [1453]
    │     │     │  ├─ p
    │     │     │  │  ├─ ipeline
    │     │     │  │  │  ├─ _schedules/
    │     │     │  │  │  │  ├─ new [1533]
    │     │     │  │  │  │  │  ╰─ .
    │     │     │  │  │  │  │     ╰─ {format} [1533]
    │     │     │  │  │  │  ╰─ {id} [1537]
    │     │     │  │  │  │     ├─ .
    │     │     │  │  │  │     │  ╰─ {format} [1537]
    │     │     │  │  │  │     ╰─ /
    │     │     │  │  │  │        ├─ take_ownership [1535]
    │     │     │  │  │  │        │  ╰─ .
    │     │     │  │  │  │        │     ╰─ {format} [1535]
    │     │     │  │  │  │        ├─ edit [1531]
    │     │     │  │  │  │        │  ╰─ .
    │     │     │  │  │  │        │     ╰─ {format} [1531]
    │     │     │  │  │  │        ╰─ play [1534]
    │     │     │  │  │  │           ╰─ .
    │     │     │  │  │  │              ╰─ {format} [1534]
    │     │     │  │  │  ╰─ s/
    │     │     │  │  │     ├─ settings [1563]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1563]
    │     │     │  │  │     ├─ charts [1540]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1540]
    │     │     │  │  │     ├─ latest [1553]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1553]
    │     │     │  │  │     ├─ new [1550]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1550]
    │     │     │  │  │     ├─ {pipeline_id}
    │     │     │  │  │     │  ╰─ /
    │     │     │  │  │     │     ├─ stages/
    │     │     │  │  │     │     │  ╰─ {stage_name}
    │     │     │  │  │     │     │     ╰─ /play_manual [1558]
    │     │     │  │  │     │     │        ╰─ .
    │     │     │  │  │     │     │           ╰─ {format} [1558]
    │     │     │  │  │     │     ╰─ tests/
    │     │     │  │  │     │        ├─ summary [1560]
    │     │     │  │  │     │        │  ╰─ .
    │     │     │  │  │     │        │     ╰─ {format} [1560]
    │     │     │  │  │     │        ╰─ {suite_name} [1559]
    │     │     │  │  │     │           ╰─ .
    │     │     │  │  │     │              ╰─ {format} [1559]
    │     │     │  │  │     ├─ {id}
    │     │     │  │  │     │  ╰─ /
    │     │     │  │  │     │     ├─ downloadable_artifacts [1544]
    │     │     │  │  │     │     │  ╰─ .
    │     │     │  │  │     │     │     ╰─ {format} [1544]
    │     │     │  │  │     │     ├─ manual_variables [1549]
    │     │     │  │  │     │     │  ╰─ .
    │     │     │  │  │     │     │     ╰─ {format} [1549]
    │     │     │  │  │     │     ├─ test_report [1557]
    │     │     │  │  │     │     │  ╰─ .
    │     │     │  │  │     │     │     ╰─ {format} [1557]
    │     │     │  │  │     │     ├─ failures [1545]
    │     │     │  │  │     │     │  ╰─ .
    │     │     │  │  │     │     │     ╰─ {format} [1545]
    │     │     │  │  │     │     ├─ builds [1538]
    │     │     │  │  │     │     │  ╰─ .
    │     │     │  │  │     │     │     ╰─ {format} [1538]
    │     │     │  │  │     │     ├─ retry [1551]
    │     │     │  │  │     │     │  ╰─ .
    │     │     │  │  │     │     │     ╰─ {format} [1551]
    │     │     │  │  │     │     ├─ license
    │     │     │  │  │     │     │  ├─ _count [1547]
    │     │     │  │  │     │     │  │  ╰─ .
    │     │     │  │  │     │     │  │     ╰─ {format} [1547]
    │     │     │  │  │     │     │  ╰─ s [1548]
    │     │     │  │  │     │     │     ╰─ .
    │     │     │  │  │     │     │        ╰─ {format} [1548]
    │     │     │  │  │     │     ├─ c
    │     │     │  │  │     │     │  ├─ odequality_report [1541]
    │     │     │  │  │     │     │  │  ╰─ .
    │     │     │  │  │     │     │  │     ╰─ {format} [1541]
    │     │     │  │  │     │     │  ╰─ ancel [1539]
    │     │     │  │  │     │     │     ╰─ .
    │     │     │  │  │     │     │        ╰─ {format} [1539]
    │     │     │  │  │     │     ╰─ s
    │     │     │  │  │     │        ├─ ecurity [1552]
    │     │     │  │  │     │        │  ╰─ .
    │     │     │  │  │     │        │     ╰─ {format} [1552]
    │     │     │  │  │     │        ╰─ ta
    │     │     │  │  │     │           ├─ tus [1556]
    │     │     │  │  │     │           │  ╰─ .
    │     │     │  │  │     │           │     ╰─ {format} [1556]
    │     │     │  │  │     │           ╰─ ge [1555]
    │     │     │  │  │     │              ╰─ .
    │     │     │  │  │     │                 ╰─ {format} [1555]
    │     │     │  │  │     ╰─ {*ref}
    │     │     │  │  │        ╰─ /latest [1553]
    │     │     │  │  │           ╰─ .
    │     │     │  │  │              ╰─ {format} [1553]
    │     │     │  │  ├─ ackage
    │     │     │  │  │  ├─ _files/
    │     │     │  │  │  │  ╰─ {id}
    │     │     │  │  │  │     ╰─ /download [1507]
    │     │     │  │  │  │        ╰─ .
    │     │     │  │  │  │           ╰─ {format} [1507]
    │     │     │  │  │  ╰─ s [1509]
    │     │     │  │  │     ╰─ .
    │     │     │  │  │        ╰─ {format} [1509]
    │     │     │  │  ╰─ r
    │     │     │  │     ├─ o
    │     │     │  │     │  ├─ tected_
    │     │     │  │     │  │  ├─ environments [1588]
    │     │     │  │     │  │  │  ├─ .
    │     │     │  │     │  │  │  │  ╰─ {format} [1588]
    │     │     │  │     │  │  │  ╰─ /
    │     │     │  │     │  │  │     ├─ search [1590]
    │     │     │  │     │  │  │     │  ╰─ .
    │     │     │  │     │  │  │     │     ╰─ {format} [1590]
    │     │     │  │     │  │  │     ╰─ {id:3} [1592]
    │     │     │  │     │  │  │        ╰─ .
    │     │     │  │     │  │  │           ╰─ {format} [1592]
    │     │     │  │     │  │  ├─ branches [1582]
    │     │     │  │     │  │  │  ╰─ /
    │     │     │  │     │  │  │     ╰─ {id:42} [1583]
    │     │     │  │     │  │  ╰─ tags [1593]
    │     │     │  │     │  │     ╰─ /
    │     │     │  │     │  │        ╰─ {id:42} [1594]
    │     │     │  │     │  ╰─ ject_members [1566]
    │     │     │  │     │     ├─ .
    │     │     │  │     │     │  ╰─ {format} [1566]
    │     │     │  │     │     ╰─ /
    │     │     │  │     │        ├─ leave [1567]
    │     │     │  │     │        │  ╰─ .
    │     │     │  │     │        │     ╰─ {format} [1567]
    │     │     │  │     │        ╰─ {id:39} [1572]
    │     │     │  │     │           ├─ .
    │     │     │  │     │           │  ╰─ {format} [1572]
    │     │     │  │     │           ╰─ /
    │     │     │  │     │              ├─ approve_access_request [1564]
    │     │     │  │     │              │  ╰─ .
    │     │     │  │     │              │     ╰─ {format} [1564]
    │     │     │  │     │              ╰─ resend_invite [1570]
    │     │     │  │     │                 ╰─ .
    │     │     │  │     │                    ╰─ {format} [1570]
    │     │     │  │     ╰─ eview
    │     │     │  │        ├─ _markdown [1018]
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [1018]
    │     │     │  │        ╰─ /
    │     │     │  │           ╰─ {*id:46} [1103]
    │     │     │  ├─ r
    │     │     │  │  ├─ unners [1634]
    │     │     │  │  │  ├─ .
    │     │     │  │  │  │  ╰─ {format} [1634]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ├─ toggle_
    │     │     │  │  │     │  ├─ shared_runners [1641]
    │     │     │  │  │     │  │  ╰─ .
    │     │     │  │  │     │  │     ╰─ {format} [1641]
    │     │     │  │  │     │  ╰─ group_runners [1640]
    │     │     │  │  │     │     ╰─ .
    │     │     │  │  │     │        ╰─ {format} [1640]
    │     │     │  │  │     ├─ new [1635]
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1635]
    │     │     │  │  │     ╰─ {id}
    │     │     │  │  │        ╰─ /
    │     │     │  │  │           ├─ re
    │     │     │  │  │           │  ├─ gister [1637]
    │     │     │  │  │           │  │  ╰─ .
    │     │     │  │  │           │  │     ╰─ {format} [1637]
    │     │     │  │  │           │  ╰─ sume [1638]
    │     │     │  │  │           │     ╰─ .
    │     │     │  │  │           │        ╰─ {format} [1638]
    │     │     │  │  │           ├─ pause [1636]
    │     │     │  │  │           │  ╰─ .
    │     │     │  │  │           │     ╰─ {format} [1636]
    │     │     │  │  │           ╰─ edit [1633]
    │     │     │  │  │              ╰─ .
    │     │     │  │  │                 ╰─ {format} [1633]
    │     │     │  │  ├─ aw/
    │     │     │  │  │  ╰─ {*id:46} [1604]
    │     │     │  │  ╰─ e
    │     │     │  │     ├─ quirements_management/requirements [1629]
    │     │     │  │     │  ├─ /import_csv [1628]
    │     │     │  │     │  │  ├─ /authorize [1627]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format} [1627]
    │     │     │  │     │  │  ╰─ .
    │     │     │  │     │  │     ╰─ {format} [1628]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1629]
    │     │     │  │     ├─ pository [1625]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1625]
    │     │     │  │     ├─ leases [1619]
    │     │     │  │     │  ├─ /
    │     │     │  │     │  │  ├─ permalink/latest [1620]
    │     │     │  │     │  │  │  ├─ / [1620]
    │     │     │  │     │  │  │  │  ╰─ {*suffix_path} [1620]
    │     │     │  │     │  │  │  ╰─ {*suffix_path} [1620]
    │     │     │  │     │  │  ├─ outbox [17]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format} [17]
    │     │     │  │     │  │  ├─ inbox [15]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format} [15]
    │     │     │  │     │  │  ├─ new [1621]
    │     │     │  │     │  │  │  ╰─ .
    │     │     │  │     │  │  │     ╰─ {format} [1621]
    │     │     │  │     │  │  ╰─ {tag:40} [1622]
    │     │     │  │     │  │     ├─ .
    │     │     │  │     │  │     │  ╰─ {format} [1622]
    │     │     │  │     │  │     ╰─ /
    │     │     │  │     │  │        ├─ e
    │     │     │  │     │  │        │  ├─ dit [1618]
    │     │     │  │     │  │        │  │  ╰─ .
    │     │     │  │     │  │        │  │     ╰─ {format} [1618]
    │     │     │  │     │  │        │  ╰─ vidences/
    │     │     │  │     │  │        │     ╰─ {id} [1623]
    │     │     │  │     │  │        │        ╰─ .
    │     │     │  │     │  │        │           ╰─ {format} [1623]
    │     │     │  │     │  │        ╰─ downloads/
    │     │     │  │     │  │           ╰─ {*filepath} [1617]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ├─ json [16]
    │     │     │  │     │     ╰─ {format} [1619]
    │     │     │  │     ╰─ fs/
    │     │     │  │        ├─ switch [1610]
    │     │     │  │        ├─ {id:42}
    │     │     │  │        │  ╰─ /logs_tree [1608]
    │     │     │  │        ╰─ {id:43}
    │     │     │  │           ╰─ /logs_tree/
    │     │     │  │              ╰─ {*path:44} [1609]
    │     │     │  ╰─ {noteable_type}
    │     │     │     ╰─ /
    │     │     │        ╰─ {noteable_id}
    │     │     │           ╰─ /discussions/
    │     │     │              ╰─ {id:49} [1198]
    │     │     │                 ╰─ .
    │     │     │                    ╰─ {format} [1198]
    │     │     ├─ de
    │     │     │  ├─ pendencies [1823]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [1823]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ {*rest}
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1823]
    │     │     │  │     ╰─ {*rest} [1823]
    │     │     │  ╰─ scription_templates/names/
    │     │     │     ╰─ {template_type:50} [1745]
    │     │     │        ╰─ .
    │     │     │           ╰─ {format:37} [1745]
    │     │     ├─ fi
    │     │     │  ├─ nd_file [1827]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [1827]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ {*rest}
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1827]
    │     │     │  │     ╰─ {*rest} [1827]
    │     │     │  ╰─ les [1826]
    │     │     │     ├─ .
    │     │     │     │  ╰─ {format} [1826]
    │     │     │     ╰─ /
    │     │     │        ├─ {*rest}
    │     │     │        │  ╰─ .
    │     │     │        │     ╰─ {format} [1826]
    │     │     │        ╰─ {*rest} [1826]
    │     │     ├─ a
    │     │     │  ├─ udit_events [1817]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [1817]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ {*rest}
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1817]
    │     │     │  │     ╰─ {*rest} [1817]
    │     │     │  ╰─ lert
    │     │     │     ├─ s/notify [1033]
    │     │     │     │  ├─ .
    │     │     │     │  │  ╰─ {format} [1033]
    │     │     │     │  ╰─ /
    │     │     │     │     ╰─ {name}
    │     │     │     │        ╰─ /
    │     │     │     │           ╰─ {endpoint_identifier:51} [1034]
    │     │     │     │              ╰─ .
    │     │     │     │                 ╰─ {format} [1034]
    │     │     │     ╰─ _management [1816]
    │     │     │        ├─ .
    │     │     │        │  ╰─ {format} [1816]
    │     │     │        ╰─ /
    │     │     │           ├─ {*rest}
    │     │     │           │  ╰─ .
    │     │     │           │     ╰─ {format} [1816]
    │     │     │           ╰─ {*rest} [1816]
    │     │     ├─ b
    │     │     │  ├─ adges [1090]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [1090]
    │     │     │  │  ╰─ /
    │     │     │  │     ╰─ {*ref}
    │     │     │  │        ╰─ /
    │     │     │  │           ├─ coverage [1089]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format:48} [1089]
    │     │     │  │           ╰─ pipeline [1091]
    │     │     │  │              ╰─ .
    │     │     │  │                 ╰─ {format:48} [1091]
    │     │     │  ├─ uilds [1122]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [1122]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ artifacts/
    │     │     │  │     │  ╰─ {*ref_name_and_path} [1120]
    │     │     │  │     ├─ {build_id:3}
    │     │     │  │     │  ╰─ /artifacts/
    │     │     │  │     │     ├─ download [1118]
    │     │     │  │     │     │  ╰─ .
    │     │     │  │     │     │     ╰─ {format} [1118]
    │     │     │  │     │     ├─ browse [1117]
    │     │     │  │     │     │  ╰─ /
    │     │     │  │     │     │     ╰─ {*path} [1117]
    │     │     │  │     │     ├─ file/
    │     │     │  │     │     │  ╰─ {*path} [1119]
    │     │     │  │     │     ╰─ raw/
    │     │     │  │     │        ╰─ {*path} [1121]
    │     │     │  │     ╰─ {id:3} [1124]
    │     │     │  │        ├─ /raw [1123]
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [1123]
    │     │     │  │        ╰─ .
    │     │     │  │           ╰─ {format} [1124]
    │     │     │  ╰─ l
    │     │     │     ├─ ame/
    │     │     │     │  ╰─ {*id:46} [1095]
    │     │     │     ╰─ ob/
    │     │     │        ╰─ {*id:46} [1105]
    │     │     ├─ c
    │     │     │  ├─ ycle_analytics [1822]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [1822]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ {*rest}
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1822]
    │     │     │  │     ╰─ {*rest} [1822]
    │     │     │  ├─ lusters [1818]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [1818]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ {*rest}
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1818]
    │     │     │  │     ╰─ {*rest} [1818]
    │     │     │  ╰─ o
    │     │     │     ├─ ntainer_registry [1612]
    │     │     │     │  ╰─ .
    │     │     │     │     ╰─ {format} [1612]
    │     │     │     ╰─ m
    │     │     │        ├─ pare [1821]
    │     │     │        │  ├─ .
    │     │     │        │  │  ╰─ {format} [1821]
    │     │     │        │  ╰─ /
    │     │     │        │     ├─ {*rest}
    │     │     │        │     │  ╰─ .
    │     │     │        │     │     ╰─ {format} [1821]
    │     │     │        │     ╰─ {*rest} [1821]
    │     │     │        ╰─ mit [1819]
    │     │     │           ├─ s [1820]
    │     │     │           │  ├─ .
    │     │     │           │  │  ╰─ {format} [1820]
    │     │     │           │  ╰─ /
    │     │     │           │     ├─ {*rest}
    │     │     │           │     │  ╰─ .
    │     │     │           │     │     ╰─ {format} [1820]
    │     │     │           │     ╰─ {*rest} [1820]
    │     │     │           ├─ .
    │     │     │           │  ╰─ {format} [1819]
    │     │     │           ╰─ /
    │     │     │              ├─ {*rest}
    │     │     │              │  ╰─ .
    │     │     │              │     ╰─ {format} [1819]
    │     │     │              ╰─ {*rest} [1819]
    │     │     ├─ e
    │     │     │  ├─ rror_tracking [1825]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [1825]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ {*rest}
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1825]
    │     │     │  │     ╰─ {*rest} [1825]
    │     │     │  ├─ nvironments [1824]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [1824]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ {*rest}
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1824]
    │     │     │  │     ╰─ {*rest} [1824]
    │     │     │  ╰─ dit/
    │     │     │     ╰─ {*id:46} [1846]
    │     │     ├─ i
    │     │     │  ├─ de_terminals [1775]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format:37} [1775]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ check_config [1774]
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format:37} [1774]
    │     │     │  │     ╰─ {id:3} [1777]
    │     │     │  │        ├─ .
    │     │     │  │        │  ╰─ {format:37} [1777]
    │     │     │  │        ╰─ /
    │     │     │  │           ├─ cancel [1773]
    │     │     │  │           │  ╰─ .
    │     │     │  │           │     ╰─ {format:37} [1773]
    │     │     │  │           ╰─ retry [1776]
    │     │     │  │              ╰─ .
    │     │     │  │                 ╰─ {format:37} [1776]
    │     │     │  ├─ nsights [1287]
    │     │     │  │  ├─ /query [1286]
    │     │     │  │  │  ╰─ .
    │     │     │  │  │     ╰─ {format} [1286]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [1287]
    │     │     │  ╰─ ssues [1829]
    │     │     │     ├─ .
    │     │     │     │  ╰─ {format} [1829]
    │     │     │     ╰─ /
    │     │     │        ├─ {*rest}
    │     │     │        │  ╰─ .
    │     │     │        │     ╰─ {format} [1829]
    │     │     │        ╰─ {*rest} [1829]
    │     │     ├─ m
    │     │     │  ├─ erge_requests [1831]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [1831]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ {*rest}
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1831]
    │     │     │  │     ╰─ {*rest} [1831]
    │     │     │  ├─ attermost [1830]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [1830]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ {*rest}
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1830]
    │     │     │  │     ╰─ {*rest} [1830]
    │     │     │  ╰─ irror [1832]
    │     │     │     ├─ .
    │     │     │     │  ╰─ {format} [1832]
    │     │     │     ╰─ /
    │     │     │        ├─ {*rest}
    │     │     │        │  ╰─ .
    │     │     │        │     ╰─ {format} [1832]
    │     │     │        ╰─ {*rest} [1832]
    │     │     ├─ p
    │     │     │  ├─ ipeline
    │     │     │  │  ├─ _schedules [1833]
    │     │     │  │  │  ├─ .
    │     │     │  │  │  │  ╰─ {format} [1833]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ├─ {*rest}
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1833]
    │     │     │  │  │     ╰─ {*rest} [1833]
    │     │     │  │  ╰─ s [1834]
    │     │     │  │     ├─ .
    │     │     │  │     │  ╰─ {format} [1834]
    │     │     │  │     ╰─ /
    │     │     │  │        ├─ {*rest}
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [1834]
    │     │     │  │        ╰─ {*rest} [1834]
    │     │     │  ├─ ro
    │     │     │  │  ├─ tected_environments [1835]
    │     │     │  │  │  ├─ .
    │     │     │  │  │  │  ╰─ {format} [1835]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ├─ {*rest}
    │     │     │  │  │     │  ╰─ .
    │     │     │  │  │     │     ╰─ {format} [1835]
    │     │     │  │  │     ╰─ {*rest} [1835]
    │     │     │  │  ╰─ metheus/
    │     │     │  │     ├─ metrics/
    │     │     │  │     │  ├─ validate_query [1581]
    │     │     │  │     │  │  ╰─ .
    │     │     │  │     │  │     ╰─ {format} [1581]
    │     │     │  │     │  ├─ active_common [1573]
    │     │     │  │     │  │  ╰─ .
    │     │     │  │     │  │     ╰─ {format} [1573]
    │     │     │  │     │  ├─ new [1578]
    │     │     │  │     │  │  ╰─ .
    │     │     │  │     │  │     ╰─ {format} [1578]
    │     │     │  │     │  ╰─ {id:0} [1580]
    │     │     │  │     │     ├─ /edit [1576]
    │     │     │  │     │     │  ╰─ .
    │     │     │  │     │     │     ╰─ {format} [1576]
    │     │     │  │     │     ╰─ .
    │     │     │  │     │        ╰─ {format} [1580]
    │     │     │  │     ╰─ alerts/
    │     │     │  │        ├─ notify [1035]
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [1035]
    │     │     │  │        ╰─ {id:3}
    │     │     │  │           ╰─ /metrics_dashboard [1036]
    │     │     │  │              ╰─ .
    │     │     │  │                 ╰─ {format} [1036]
    │     │     │  ╰─ a
    │     │     │     ├─ th_locks [1527]
    │     │     │     │  ├─ .
    │     │     │     │  │  ╰─ {format} [1527]
    │     │     │     │  ╰─ /
    │     │     │     │     ├─ toggle [1528]
    │     │     │     │     │  ╰─ .
    │     │     │     │     │     ╰─ {format} [1528]
    │     │     │     │     ╰─ {id} [1526]
    │     │     │     │        ╰─ .
    │     │     │     │           ╰─ {format} [1526]
    │     │     │     ╰─ ges/
    │     │     │        ├─ new [1512]
    │     │     │        │  ╰─ .
    │     │     │        │     ╰─ {format} [1512]
    │     │     │        ╰─ domains [1517]
    │     │     │           ├─ .
    │     │     │           │  ╰─ {format} [1517]
    │     │     │           ╰─ /
    │     │     │              ├─ new [1520]
    │     │     │              │  ╰─ .
    │     │     │              │     ╰─ {format} [1520]
    │     │     │              ╰─ {id:0}
    │     │     │                 ╰─ /
    │     │     │                    ├─ clean_certificate [1516]
    │     │     │                    │  ╰─ .
    │     │     │                    │     ╰─ {format} [1516]
    │     │     │                    ├─ retry_auto_ssl [1521]
    │     │     │                    │  ╰─ .
    │     │     │                    │     ╰─ {format} [1521]
    │     │     │                    ├─ verify [1525]
    │     │     │                    │  ╰─ .
    │     │     │                    │     ╰─ {format} [1525]
    │     │     │                    ╰─ edit [1519]
    │     │     │                       ╰─ .
    │     │     │                          ╰─ {format} [1519]
    │     │     ├─ r
    │     │     │  ├─ unner
    │     │     │  │  ├─ _projects [1630]
    │     │     │  │  │  ├─ .
    │     │     │  │  │  │  ╰─ {format} [1630]
    │     │     │  │  │  ╰─ /
    │     │     │  │  │     ╰─ {id} [1631]
    │     │     │  │  │        ╰─ .
    │     │     │  │  │           ╰─ {format} [1631]
    │     │     │  │  ╰─ s [1836]
    │     │     │  │     ├─ .
    │     │     │  │     │  ╰─ {format} [1836]
    │     │     │  │     ╰─ /
    │     │     │  │        ├─ {*rest}
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [1836]
    │     │     │  │        ╰─ {*rest} [1836]
    │     │     │  ├─ aw/
    │     │     │  │  ╰─ {*id:46} [1605]
    │     │     │  ╰─ e
    │     │     │     ├─ pository [1626]
    │     │     │     │  ╰─ .
    │     │     │     │     ╰─ {format} [1626]
    │     │     │     ├─ store [1022]
    │     │     │     │  ╰─ .
    │     │     │     │     ╰─ {format} [1022]
    │     │     │     ├─ gistry/repository/
    │     │     │     │  ╰─ {repository_id}
    │     │     │     │     ╰─ /tags [1616]
    │     │     │     │        ╰─ /
    │     │     │     │           ├─ bulk_destroy [1614]
    │     │     │     │           ╰─ {id:52} [1615]
    │     │     │     ╰─ fs/
    │     │     │        ├─ switch [1850]
    │     │     │        ├─ {id:42}
    │     │     │        │  ╰─ /logs_tree [1849]
    │     │     │        ╰─ {id:43}
    │     │     │           ╰─ /logs_tree/
    │     │     │              ╰─ {*path:44} [1812]
    │     │     ├─ s
    │     │     │  ├─ e
    │     │     │  │  ├─ rv
    │     │     │  │  │  ├─ ice_ping/web_ide_pipelines_count [1681]
    │     │     │  │  │  │  ╰─ .
    │     │     │  │  │  │     ╰─ {format} [1681]
    │     │     │  │  │  ╰─ erless [1838]
    │     │     │  │  │     ├─ .
    │     │     │  │  │     │  ╰─ {format} [1838]
    │     │     │  │  │     ╰─ /
    │     │     │  │  │        ├─ {*rest}
    │     │     │  │  │        │  ╰─ .
    │     │     │  │  │        │     ╰─ {format} [1838]
    │     │     │  │  │        ╰─ {*rest} [1838]
    │     │     │  │  ╰─ curity [1837]
    │     │     │  │     ├─ .
    │     │     │  │     │  ╰─ {format} [1837]
    │     │     │  │     ╰─ /
    │     │     │  │        ├─ {*rest}
    │     │     │  │        │  ╰─ .
    │     │     │  │        │     ╰─ {format} [1837]
    │     │     │  │        ╰─ {*rest} [1837]
    │     │     │  ╰─ nippets [1839]
    │     │     │     ├─ .
    │     │     │     │  ╰─ {format} [1839]
    │     │     │     ╰─ /
    │     │     │        ├─ {id:3}
    │     │     │        │  ╰─ /raw [1729]
    │     │     │        ├─ {*rest}
    │     │     │        │  ╰─ .
    │     │     │        │     ╰─ {format} [1839]
    │     │     │        ╰─ {*rest} [1839]
    │     │     ├─ t
    │     │     │  ├─ odos [1748]
    │     │     │  │  ╰─ .
    │     │     │  │     ╰─ {format} [1748]
    │     │     │  ├─ ags [1840]
    │     │     │  │  ├─ .
    │     │     │  │  │  ╰─ {format} [1840]
    │     │     │  │  ╰─ /
    │     │     │  │     ├─ {*rest}
    │     │     │  │     │  ╰─ .
    │     │     │  │     │     ╰─ {format} [1840]
    │     │     │  │     ╰─ {*rest} [1840]
    │     │     │  ├─ emplates/
    │     │     │  │  ╰─ {template_type:50} [1744]
    │     │     │  │     ├─ .
    │     │     │  │     │  ╰─ {format:37} [1744]
    │     │     │  │     ╰─ /
    │     │     │  │        ╰─ {key:0} [1746]
    │     │     │  │           ╰─ .
    │     │     │  │              ╰─ {format:37} [1746]
    │     │     │  ╰─ r
    │     │     │     ├─ iggers [1841]
    │     │     │     │  ├─ .
    │     │     │     │  │  ╰─ {format} [1841]
    │     │     │     │  ╰─ /
    │     │     │     │     ├─ {*rest}
    │     │     │     │     │  ╰─ .
    │     │     │     │     │     ╰─ {format} [1841]
    │     │     │     │     ╰─ {*rest} [1841]
    │     │     │     ╰─ ee/
    │     │     │        ╰─ {*id:46} [1753]
    │     │     ╰─ v
    │     │        ├─ ulnerability_feedback [1843]
    │     │        │  ├─ .
    │     │        │  │  ╰─ {format} [1843]
    │     │        │  ╰─ /
    │     │        │     ├─ {*rest}
    │     │        │     │  ╰─ .
    │     │        │     │     ╰─ {format} [1843]
    │     │        │     ╰─ {*rest} [1843]
    │     │        ╰─ ariables [1842]
    │     │           ├─ .
    │     │           │  ╰─ {format} [1842]
    │     │           ╰─ /
    │     │              ├─ {*rest}
    │     │              │  ╰─ .
    │     │              │     ╰─ {format} [1842]
    │     │              ╰─ {*rest} [1842]
    │     ╰─ {id:4}
    │        ╰─ /
    │           ├─ new_issuable_address [1017]
    │           │  ╰─ .
    │           │     ╰─ {format} [1017]
    │           ├─ generate_new_export [1013]
    │           │  ╰─ .
    │           │     ╰─ {format} [1013]
    │           ├─ download_export [1010]
    │           │  ╰─ .
    │           │     ╰─ {format} [1010]
    │           ├─ housekeeping [1014]
    │           │  ╰─ .
    │           │     ╰─ {format} [1014]
    │           ├─ un
    │           │  ├─ foldered_environment_names [1027]
    │           │  │  ╰─ .
    │           │  │     ╰─ {format} [1027]
    │           │  ╰─ archive [1026]
    │           │     ╰─ .
    │           │        ╰─ {format} [1026]
    │           ├─ re
    │           │  ├─ move_
    │           │  │  ├─ export [1020]
    │           │  │  │  ╰─ .
    │           │  │  │     ╰─ {format} [1020]
    │           │  │  ╰─ fork [1021]
    │           │  │     ╰─ .
    │           │  │        ╰─ {format} [1021]
    │           │  ╰─ fs [1019]
    │           │     ╰─ .
    │           │        ╰─ {format} [1019]
    │           ├─ a
    │           │  ├─ ctivity [1006]
    │           │  │  ╰─ .
    │           │  │     ╰─ {format} [1006]
    │           │  ╰─ rchive [1007]
    │           │     ╰─ .
    │           │        ╰─ {format} [1007]
    │           ├─ e
    │           │  ├─ xport [1012]
    │           │  │  ╰─ .
    │           │  │     ╰─ {format} [1012]
    │           │  ╰─ dit [1011]
    │           │     ╰─ .
    │           │        ╰─ {format} [1011]
    │           ╰─ t
    │              ├─ oggle_star [1024]
    │              │  ╰─ .
    │              │     ╰─ {format} [1024]
    │              ╰─ ransfer [1025]
    │                 ╰─ .
    │                    ╰─ {format} [1025]
    ├─ {*namespace_id:53}
    │  ╰─ /
    │     ╰─ {project_id:53} [1802]
    │        ├─ /
    │        │  ├─ commit/
    │        │  │  ╰─ {id:47} [1803]
    │        │  │     ╰─ .
    │        │  │        ╰─ {format} [1803]
    │        │  ╰─ tree/
    │        │     ├─ {*id}
    │        │     │  ╰─ .
    │        │     │     ╰─ {format} [1804]
    │        │     ╰─ {*id} [1804]
    │        ╰─ .
    │           ╰─ {format} [1802]
    ├─ {*repository_path:8} [1813]
    ╰─ {*unmatched_route} [294]
    === Method
    (/-/jira)/{*namespace_id:53}/{project_id:53}(.{format})
    ╰─ GET [1793]

    (/-/jira)/{*namespace_id:53}/{project_id:53}/commit/{id:47}(.{format})
    ╰─ GET [1794]

    (/-/jira)/{*namespace_id:53}/{project_id:53}/tree/{*id}(.{format})
    ╰─ GET [1795]

    /
    ╰─ GET [1926]

    /-/abuse_reports(.{format})
    ╰─ POST [4]

    /-/abuse_reports/add_category(.{format})
    ╰─ POST [3]

    /-/acme-challenge(.{format})
    ╰─ GET [5]

    /-/arkose/data_exchange_payload(.{format})
    ╰─ GET [282]

    /-/autocomplete/award_emojis(.{format})
    ╰─ GET [292]

    /-/autocomplete/deploy_keys_with_owners(.{format})
    ╰─ GET [293]

    /-/autocomplete/group_subgroups(.{format})
    ╰─ GET [294]

    /-/autocomplete/merge_request_source_branches(.{format})
    ╰─ GET [295]

    /-/autocomplete/merge_request_target_branches(.{format})
    ╰─ GET [296]

    /-/autocomplete/namespace_routes(.{format})
    ╰─ GET [297]

    /-/autocomplete/project_groups(.{format})
    ╰─ GET [298]

    /-/autocomplete/project_routes(.{format})
    ╰─ GET [299]

    /-/autocomplete/projects(.{format})
    ╰─ GET [300]

    /-/autocomplete/users(.{format})
    ╰─ GET [302]

    /-/autocomplete/users/{id}(.{format})
    ╰─ GET [301]

    /-/chaos/cpu_spin(.{format})
    ╰─ GET [304]

    /-/chaos/db_spin(.{format})
    ╰─ GET [305]

    /-/chaos/gc(.{format})
    ╰─ POST [306]

    /-/chaos/kill(.{format})
    ╰─ GET [307]

    /-/chaos/leakmem(.{format})
    ╰─ GET [308]

    /-/chaos/quit(.{format})
    ╰─ GET [309]

    /-/chaos/sleep(.{format})
    ╰─ GET [310]

    /-/countries(.{format})
    ╰─ GET [320]

    /-/country_states(.{format})
    ╰─ GET [321]

    /-/customers_dot/proxy/graphql(.{format})
    ╰─ POST [322]

    /-/external_redirect(.{format})
    ╰─ GET [366]

    /-/g/{id}(.{format})
    ╰─ GET [634]

    /-/gitlab_subscriptions/hand_raise_leads(.{format})
    ╰─ POST [373]

    /-/google_api/auth/callback(.{format})
    ├─ GET [387]
    ╰─ POST [387]

    /-/graphql-explorer(.{format})
    ╰─ GET [0]

    /-/ide
    ╰─ GET [780]

    /-/ide/oauth_redirect
    ╰─ GET [796]

    /-/ide/project
    ╰─ GET [781]

    /-/ide/project/{project_id:2}
    ╰─ GET [782]

    /-/ide/project/{project_id:2}/blob
    ╰─ GET [783]

    /-/ide/project/{project_id:2}/blob/{*branch}
    ╰─ GET [784]

    /-/ide/project/{project_id:2}/blob/{*branch}/-
    ╰─ GET [785]

    /-/ide/project/{project_id:2}/blob/{*branch}/-/{*path}
    ╰─ GET [786]

    /-/ide/project/{project_id:2}/edit
    ╰─ GET [787]

    /-/ide/project/{project_id:2}/edit/{*branch}
    ╰─ GET [788]

    /-/ide/project/{project_id:2}/edit/{*branch}/-
    ╰─ GET [789]

    /-/ide/project/{project_id:2}/edit/{*branch}/-/{*path}
    ╰─ GET [790]

    /-/ide/project/{project_id:2}/merge_requests/{merge_request_id:3}
    ╰─ GET [791]

    /-/ide/project/{project_id:2}/tree
    ╰─ GET [792]

    /-/ide/project/{project_id:2}/tree/{*branch}
    ╰─ GET [793]

    /-/ide/project/{project_id:2}/tree/{*branch}/-
    ╰─ GET [794]

    /-/ide/project/{project_id:2}/tree/{*branch}/-/{*path}
    ╰─ GET [795]

    /-/ide/reset_oauth_application_settings
    ╰─ POST [63]

    /-/identity_verification(.{format})
    ╰─ GET [2042]

    /-/identity_verification/send_phone_verification_code(.{format})
    ╰─ POST [2041]

    /-/identity_verification/success(.{format})
    ╰─ GET [2043]

    /-/identity_verification/toggle_phone_exemption(.{format})
    ╰─ PATCH [2044]

    /-/identity_verification/verification_state(.{format})
    ╰─ GET [2045]

    /-/identity_verification/verify_credit_card(.{format})
    ╰─ GET [2046]

    /-/identity_verification/verify_credit_card_captcha(.{format})
    ╰─ POST [2047]

    /-/identity_verification/verify_phone_verification_code(.{format})
    ╰─ POST [2048]

    /-/invites/{id:10}(.{format})
    ╰─ GET [855]

    /-/invites/{id:10}/accept(.{format})
    ╰─ POST [853]

    /-/invites/{id:10}/decline(.{format})
    ├─ GET [854]
    ╰─ POST [854]

    /-/jira_connect(.{format})
    ╰─ GET [1]

    /-/jira_connect/app_descriptor(.{format})
    ╰─ GET [856]

    /-/jira_connect/branches/new(.{format})
    ╰─ GET [857]

    /-/jira_connect/branches/route(.{format})
    ╰─ GET [858]

    /-/jira_connect/events/installed(.{format})
    ╰─ POST [859]

    /-/jira_connect/events/uninstalled(.{format})
    ╰─ POST [860]

    /-/jira_connect/installations(.{format})
    ├─ GET [861]
    ╰─ PUT [862]

    /-/jira_connect/oauth_application_id(.{format})
    ├─ GET [863]
    ╰─ OPTIONS [864]

    /-/jira_connect/oauth_callbacks(.{format})
    ╰─ GET [865]

    /-/jira_connect/public_keys/{id}(.{format})
    ╰─ GET [866]

    /-/jira_connect/repositories/associate(.{format})
    ╰─ POST [867]

    /-/jira_connect/repositories/search(.{format})
    ╰─ GET [868]

    /-/jira_connect/subscriptions(.{format})
    ├─ GET [872]
    ├─ OPTIONS [873]
    ╰─ POST [869]

    /-/jira_connect/subscriptions/{id}(.{format})
    ├─ DELETE [871]
    ╰─ OPTIONS [870]

    /-/jira_connect/workspaces/search(.{format})
    ╰─ GET [874]

    /-/jwks(.{format})
    ╰─ GET [875]

    /-/kubernetes(.{format})
    ╰─ GET [311]

    /-/kubernetes/{agent_id}(/{*vueroute})(.{format})
    ╰─ GET [312]

    /-/liveness(.{format})
    ╰─ GET [771]

    /-/mailgun/webhooks(.{format})
    ╰─ POST [898]

    /-/manifest(.{format})
    ╰─ GET [1786]

    /-/members/mailgun/permanent_failures(.{format})
    ╰─ POST [899]

    /-/metrics(.{format})
    ╰─ GET [900]

    /-/metrics/system(.{format})
    ╰─ GET [901]

    /-/offline(.{format})
    ╰─ GET [1787]

    /-/operations(.{format})
    ├─ DELETE [934]
    ├─ GET [937]
    ╰─ POST [932]

    /-/operations/environments(.{format})
    ├─ DELETE [935]
    ├─ GET [936]
    ╰─ POST [933]

    /-/organizations(.{format})
    ╰─ GET [944]

    /-/organizations/new(.{format})
    ╰─ GET [945]

    /-/organizations/preview_markdown(.{format})
    ╰─ POST [946]

    /-/organizations/{organization_path}(.{format})
    ╰─ GET [947]

    /-/organizations/{organization_path}/activity(.{format})
    ╰─ GET [942]

    /-/organizations/{organization_path}/groups(.{format})
    ├─ DELETE [939]
    ╰─ POST [938]

    /-/organizations/{organization_path}/groups/new(.{format})
    ╰─ GET [941]

    /-/organizations/{organization_path}/groups/{*id}/edit(.{format})
    ╰─ GET [940]

    /-/organizations/{organization_path}/groups_and_projects(.{format})
    ╰─ GET [943]

    /-/organizations/{organization_path}/projects/{*namespace_id}/{id:4}/edit(.{format})
    ╰─ GET [949]

    /-/organizations/{organization_path}/settings/general(.{format})
    ╰─ GET [950]

    /-/organizations/{organization_path}/users(.{format})
    ╰─ GET [948]

    /-/p/{id}(.{format})
    ╰─ GET [1597]

    /-/phone_verification/telesign_callback(.{format})
    ╰─ POST [958]

    /-/profile/account(.{format})
    ╰─ GET [963]

    /-/profile/account/unlink(.{format})
    ╰─ DELETE [964]

    /-/profile/applications(.{format})
    ╰─ GET [1847]

    /-/profile/audit_log(.{format})
    ╰─ GET [1848]

    /-/profile/avatar(.{format})
    ╰─ DELETE [965]

    /-/profile/billings(.{format})
    ╰─ GET [966]

    /-/profile/chat_names(.{format})
    ├─ GET [970]
    ╰─ POST [967]

    /-/profile/chat_names/deny(.{format})
    ╰─ DELETE [968]

    /-/profile/chat_names/new(.{format})
    ╰─ GET [971]

    /-/profile/chat_names/{id}(.{format})
    ╰─ DELETE [969]

    /-/profile/comment_templates(.{format})
    ╰─ GET [972]

    /-/profile/comment_templates/{id}(.{format})
    ╰─ GET [973]

    /-/profile/emails(.{format})
    ├─ GET [976]
    ╰─ POST [974]

    /-/profile/emails/confirmation(.{format})
    ├─ GET [318]
    ╰─ POST [314]

    /-/profile/emails/confirmation/new(.{format})
    ╰─ GET [316]

    /-/profile/emails/{id}(.{format})
    ╰─ DELETE [975]

    /-/profile/emails/{id}/resend_confirmation_instructions(.{format})
    ╰─ PUT [977]

    /-/profile/groups/{*id:2}/notifications(.{format:13})
    ├─ PATCH [978]
    ╰─ PUT [979]

    /-/profile/notifications(.{format})
    ├─ GET [980]
    ├─ PATCH [981]
    ╰─ PUT [982]

    /-/profile/preferences(.{format})
    ├─ GET [983]
    ├─ PATCH [984]
    ╰─ PUT [985]

    /-/profile/reset_feed_token(.{format})
    ╰─ PUT [959]

    /-/profile/reset_incoming_email_token(.{format})
    ╰─ PUT [960]

    /-/profile/reset_static_object_token(.{format})
    ╰─ PUT [961]

    /-/profile/slack/edit(.{format})
    ╰─ GET [986]

    /-/profile/slack/slack_link(.{format})
    ╰─ GET [987]

    /-/profile/two_factor_auth(.{format})
    ├─ DELETE [991]
    ├─ GET [994]
    ╰─ POST [989]

    /-/profile/two_factor_auth/codes(.{format})
    ╰─ POST [988]

    /-/profile/two_factor_auth/create_webauthn(.{format})
    ╰─ POST [990]

    /-/profile/two_factor_auth/destroy_otp(.{format})
    ╰─ DELETE [992]

    /-/profile/two_factor_auth/destroy_webauthn/{id}(.{format})
    ╰─ DELETE [993]

    /-/profile/two_factor_auth/skip(.{format})
    ╰─ PATCH [995]

    /-/profile/update_username(.{format})
    ╰─ PUT [962]

    /-/profile/usage_quotas(.{format})
    ╰─ GET [996]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/git-receive-pack
    ╰─ POST [1884]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/git-upload-pack
    ╰─ POST [1886]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/gitlab-lfs/objects/{*oid:6}
    ╰─ GET [1920]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/gitlab-lfs/objects/{*oid:6}/{*size:7}
    ╰─ PUT [1924]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/gitlab-lfs/objects/{*oid:6}/{*size:7}/authorize
    ╰─ PUT [1922]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/info/lfs/locks
    ├─ GET [1906]
    ╰─ POST [1900]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/info/lfs/locks/new
    ╰─ GET [1908]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/info/lfs/locks/verify
    ╰─ POST [1918]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/info/lfs/locks/{id}
    ├─ DELETE [1902]
    ├─ GET [1910]
    ├─ PATCH [1914]
    ╰─ PUT [1916]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/info/lfs/locks/{id}/edit
    ╰─ GET [1904]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/info/lfs/locks/{id}/unlock
    ╰─ POST [1912]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/info/lfs/objects
    ╰─ POST [1898]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/info/lfs/objects/batch
    ╰─ POST [1894]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/info/lfs/objects/{*oid}
    ╰─ GET [1896]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/info/refs
    ╰─ GET [1888]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/ssh-receive-pack
    ╰─ POST [1890]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:5}/ssh-upload-pack
    ╰─ POST [1892]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:8}
    ╰─ GET [1796]

    /-/push_from_secondary/{geo_node_id}/{*repository_path:9}/info/refs
    ╰─ GET [1797]

    /-/readiness(.{format})
    ╰─ GET [772]

    /-/remote_development/workspaces(/{*vueroute})(.{format})
    ├─ GET [1876]
    ╰─ POST [1873]

    /-/remote_development/workspaces(/{*vueroute})/new(.{format})
    ╰─ GET [1879]

    /-/remote_development/workspaces(/{*vueroute})/{id}(.{format})
    ├─ DELETE [1874]
    ├─ GET [1880]
    ├─ PATCH [1881]
    ╰─ PUT [1882]

    /-/remote_development/workspaces(/{*vueroute})/{id}/edit(.{format})
    ╰─ GET [1875]

    /-/remote_development/workspaces(/{*vueroute})/{workspace_id}/workspaces(.{format})
    ╰─ GET [1877]

    /-/remote_development/workspaces(/{*vueroute})/{workspace_id}/workspaces/new(.{format})
    ╰─ GET [1878]

    /-/remote_development/workspaces_feature_flag(.{format})
    ╰─ GET [1883]

    /-/runner_setup/platforms(.{format})
    ╰─ GET [1927]

    /-/s/{username:12}(.{format})
    ╰─ GET [1858]

    /-/sandbox/mermaid(.{format})
    ╰─ GET [1928]

    /-/sandbox/swagger(.{format})
    ╰─ GET [1929]

    /-/security(.{format})
    ╰─ GET [1846]

    /-/security/dashboard(.{format})
    ╰─ GET [1937]

    /-/security/dashboard/settings(.{format})
    ╰─ GET [1936]

    /-/security/projects(.{format})
    ├─ GET [1940]
    ╰─ POST [1938]

    /-/security/projects/{id}(.{format})
    ╰─ DELETE [1939]

    /-/security/vulnerabilities(.{format})
    ╰─ GET [1941]

    /-/sent_notifications/{id:11}/unsubscribe(.{format})
    ├─ GET [1942]
    ╰─ POST [1942]

    /-/smartcard/auth(.{format})
    ╰─ POST [1953]

    /-/smartcard/extract_certificate(.{format})
    ╰─ GET [1954]

    /-/smartcard/verify_certificate(.{format})
    ╰─ GET [1955]

    /-/snippets(.{format})
    ╰─ GET [1957]

    /-/snippets/new(.{format})
    ╰─ GET [1959]

    /-/snippets/preview_markdown(.{format})
    ╰─ POST [1960]

    /-/snippets/{id:3}(.{format})
    ╰─ GET [1963]

    /-/snippets/{id:3}/edit(.{format})
    ╰─ GET [1956]

    /-/snippets/{id:3}/mark_as_spam(.{format})
    ╰─ POST [1958]

    /-/snippets/{id:3}/raw(.{format})
    ╰─ GET [1961]

    /-/snippets/{id:3}/toggle_award_emoji(.{format})
    ╰─ POST [1964]

    /-/snippets/{snippet_id:3}/notes(.{format})
    ├─ GET [1969]
    ╰─ POST [1966]

    /-/snippets/{snippet_id:3}/notes/{id:3}(.{format})
    ├─ DELETE [1968]
    ├─ PATCH [1971]
    ╰─ PUT [1972]

    /-/snippets/{snippet_id:3}/notes/{id:3}/delete_attachment(.{format})
    ╰─ DELETE [1967]

    /-/snippets/{snippet_id:3}/notes/{id:3}/toggle_award_emoji(.{format})
    ╰─ POST [1970]

    /-/snippets/{snippet_id:3}/raw/{ref}/{*path}
    ╰─ GET [1965]

    /-/subscriptions(.{format})
    ╰─ POST [376]

    /-/subscriptions/buy_minutes(.{format})
    ╰─ GET [374]

    /-/subscriptions/buy_storage(.{format})
    ╰─ GET [375]

    /-/subscriptions/groups(.{format})
    ╰─ POST [368]

    /-/subscriptions/groups/new(.{format})
    ╰─ GET [370]

    /-/subscriptions/groups/{id}(.{format})
    ├─ PATCH [371]
    ╰─ PUT [372]

    /-/subscriptions/groups/{id}/edit(.{format})
    ╰─ GET [369]

    /-/subscriptions/new(.{format})
    ╰─ GET [377]

    /-/subscriptions/payment_form(.{format})
    ╰─ GET [378]

    /-/subscriptions/payment_method(.{format})
    ╰─ GET [379]

    /-/subscriptions/validate_payment_method(.{format})
    ╰─ POST [380]

    /-/timelogs(.{format})
    ╰─ GET [1974]

    /-/track_namespace_visits(.{format})
    ╰─ POST [2049]

    /-/trial_registrations(.{format})
    ╰─ POST [1981]

    /-/trial_registrations/new(.{format})
    ╰─ GET [1982]

    /-/trials(.{format})
    ╰─ POST [381]

    /-/trials/duo_enterprise(.{format})
    ╰─ POST [383]

    /-/trials/duo_enterprise/new(.{format})
    ╰─ GET [384]

    /-/trials/duo_pro(.{format})
    ╰─ POST [385]

    /-/trials/duo_pro/new(.{format})
    ╰─ GET [386]

    /-/trials/new(.{format})
    ╰─ GET [382]

    /-/user_settings/active_sessions(.{format})
    ╰─ GET [1993]

    /-/user_settings/active_sessions/saml(.{format})
    ╰─ GET [1994]

    /-/user_settings/active_sessions/{id}(.{format})
    ╰─ DELETE [1992]

    /-/user_settings/applications(.{format})
    ╰─ GET [905]

    /-/user_settings/authentication_log(.{format})
    ╰─ GET [2019]

    /-/user_settings/gpg_keys(.{format})
    ├─ GET [1997]
    ╰─ POST [1995]

    /-/user_settings/gpg_keys/{id}(.{format})
    ╰─ DELETE [1996]

    /-/user_settings/gpg_keys/{id}/revoke(.{format})
    ╰─ PUT [1998]

    /-/user_settings/identities(.{format})
    ╰─ POST [1999]

    /-/user_settings/identities/new(.{format})
    ╰─ GET [2000]

    /-/user_settings/password(.{format})
    ├─ PATCH [2005]
    ├─ POST [2001]
    ╰─ PUT [2006]

    /-/user_settings/password/edit(.{format})
    ╰─ GET [2002]

    /-/user_settings/password/new(.{format})
    ╰─ GET [2003]

    /-/user_settings/password/reset(.{format})
    ╰─ PUT [2004]

    /-/user_settings/personal_access_tokens(.{format})
    ├─ GET [2008]
    ╰─ POST [2007]

    /-/user_settings/personal_access_tokens/{id}/revoke(.{format})
    ╰─ PUT [2009]

    /-/user_settings/personal_access_tokens/{id}/rotate(.{format})
    ╰─ PUT [2010]

    /-/user_settings/profile(.{format})
    ├─ GET [2011]
    ├─ PATCH [2012]
    ╰─ PUT [2013]

    /-/user_settings/ssh_keys(.{format})
    ├─ GET [2016]
    ╰─ POST [2014]

    /-/user_settings/ssh_keys/{id}(.{format})
    ├─ DELETE [2015]
    ╰─ GET [2018]

    /-/user_settings/ssh_keys/{id}/revoke(.{format})
    ╰─ DELETE [2017]

    /-/users/broadcast_message_dismissals(.{format})
    ╰─ POST [2038]

    /-/users/callouts(.{format})
    ╰─ POST [2039]

    /-/users/group_callouts(.{format})
    ╰─ POST [2040]

    /-/users/pins(.{format})
    ├─ PATCH [2050]
    ╰─ PUT [2051]

    /-/users/project_callouts(.{format})
    ╰─ POST [2052]

    /-/users/terms(.{format})
    ╰─ GET [2068]

    /-/users/terms/{id}/accept(.{format})
    ╰─ POST [2066]

    /-/users/terms/{id}/decline(.{format})
    ╰─ POST [2067]

    /-/whats_new(.{format})
    ╰─ GET [2072]

    /-/{model:1}/{model_id}/uploads/{secret}/{filename:0}(.{format})
    ╰─ GET [303]

    /.well-known/change-password(.{format})
    ╰─ GET [1849]

    /.well-known/oauth-authorization-server(.{format})
    ╰─ GET [878]

    /.well-known/openid-configuration(.{format})
    ├─ GET [879]
    ╰─ OPTIONS [880]

    /.well-known/security.txt(.{format})
    ╰─ GET [2071]

    /.well-known/terraform.json(.{format})
    ╰─ GET [1973]

    /.well-known/webfinger(.{format})
    ├─ GET [881]
    ╰─ OPTIONS [882]

    /admin(.{format})
    ╰─ GET [105]

    /admin/abuse_reports(.{format})
    ╰─ GET [10]

    /admin/abuse_reports/{id}(.{format})
    ├─ DELETE [9]
    ├─ GET [12]
    ├─ PATCH [13]
    ╰─ PUT [14]

    /admin/abuse_reports/{id}/moderate_user(.{format})
    ╰─ PUT [11]

    /admin/ai/self_hosted_models(/{*vueroute})(.{format})
    ╰─ GET [15]

    /admin/ai/self_hosted_models(/{*vueroute})/terms_and_conditions(.{format})
    ├─ GET [17]
    ╰─ POST [16]

    /admin/application_settings(.{format})
    ├─ PATCH [39]
    ╰─ PUT [40]

    /admin/application_settings/advanced_search(.{format})
    ├─ GET [18]
    ╰─ PATCH [18]

    /admin/application_settings/analytics(.{format})
    ├─ GET [19]
    ╰─ PATCH [19]

    /admin/application_settings/appearance(.{format})
    ├─ GET [49]
    ├─ PATCH [50]
    ├─ POST [43]
    ╰─ PUT [51]

    /admin/application_settings/appearance/favicon(.{format})
    ╰─ DELETE [44]

    /admin/application_settings/appearance/header_logos(.{format})
    ╰─ DELETE [45]

    /admin/application_settings/appearance/logo(.{format})
    ╰─ DELETE [46]

    /admin/application_settings/appearance/preview_sign_in(.{format})
    ╰─ GET [47]

    /admin/application_settings/appearance/pwa_icon(.{format})
    ╰─ DELETE [48]

    /admin/application_settings/ci_cd(.{format})
    ├─ GET [20]
    ╰─ PATCH [20]

    /admin/application_settings/clear_repository_check_states(.{format})
    ╰─ PUT [21]

    /admin/application_settings/general(.{format})
    ├─ GET [22]
    ╰─ PATCH [22]

    /admin/application_settings/geo(.{format})
    ╰─ GET [131]

    /admin/application_settings/integrations(.{format})
    ├─ GET [23]
    ╰─ PATCH [23]

    /admin/application_settings/integrations/{id}(.{format})
    ├─ PATCH [178]
    ╰─ PUT [179]

    /admin/application_settings/integrations/{id}/edit(.{format})
    ╰─ GET [174]

    /admin/application_settings/integrations/{id}/overrides(.{format})
    ╰─ GET [175]

    /admin/application_settings/integrations/{id}/reset(.{format})
    ╰─ POST [176]

    /admin/application_settings/integrations/{id}/test(.{format})
    ╰─ PUT [177]

    /admin/application_settings/lets_encrypt_terms_of_service(.{format})
    ╰─ GET [24]

    /admin/application_settings/metrics_and_profiling(.{format})
    ├─ GET [25]
    ╰─ PATCH [25]

    /admin/application_settings/namespace_storage(.{format})
    ├─ GET [26]
    ╰─ PATCH [26]

    /admin/application_settings/network(.{format})
    ├─ GET [27]
    ╰─ PATCH [27]

    /admin/application_settings/preferences(.{format})
    ├─ GET [28]
    ╰─ PATCH [28]

    /admin/application_settings/reporting(.{format})
    ├─ GET [29]
    ╰─ PATCH [29]

    /admin/application_settings/repository(.{format})
    ├─ GET [30]
    ╰─ PATCH [30]

    /admin/application_settings/reset_error_tracking_access_token(.{format})
    ╰─ PUT [31]

    /admin/application_settings/reset_health_check_token(.{format})
    ╰─ PUT [32]

    /admin/application_settings/reset_registration_token(.{format})
    ╰─ PUT [33]

    /admin/application_settings/roles_and_permissions(.{format})
    ╰─ GET [53]

    /admin/application_settings/roles_and_permissions/new(.{format})
    ╰─ GET [54]

    /admin/application_settings/roles_and_permissions/{id}(.{format})
    ╰─ GET [55]

    /admin/application_settings/roles_and_permissions/{id}/edit(.{format})
    ╰─ GET [52]

    /admin/application_settings/scim_oauth(.{format})
    ╰─ POST [56]

    /admin/application_settings/seat_link_payload(.{format})
    ╰─ GET [34]

    /admin/application_settings/security_and_compliance(.{format})
    ├─ GET [35]
    ╰─ PATCH [35]

    /admin/application_settings/slack(.{format})
    ╰─ DELETE [232]

    /admin/application_settings/slack/slack_auth(.{format})
    ╰─ GET [233]

    /admin/application_settings/slack_app_manifest_download(.{format})
    ╰─ GET [36]

    /admin/application_settings/slack_app_manifest_share(.{format})
    ╰─ GET [37]

    /admin/application_settings/templates(.{format})
    ├─ GET [38]
    ╰─ PATCH [38]

    /admin/application_settings/update_microsoft_application(.{format})
    ╰─ PUT [41]

    /admin/application_settings/usage_data(.{format})
    ╰─ GET [42]

    /admin/applications(.{format})
    ├─ GET [60]
    ╰─ POST [57]

    /admin/applications/new(.{format})
    ╰─ GET [61]

    /admin/applications/{id}(.{format})
    ├─ DELETE [58]
    ├─ GET [64]
    ├─ PATCH [65]
    ╰─ PUT [66]

    /admin/applications/{id}/edit(.{format})
    ╰─ GET [59]

    /admin/applications/{id}/renew(.{format})
    ╰─ PUT [62]

    /admin/audit_log_reports(.{format:14})
    ╰─ GET [67]

    /admin/audit_logs(.{format})
    ╰─ GET [68]

    /admin/background_jobs(.{format})
    ╰─ GET [69]

    /admin/background_migrations(.{format})
    ╰─ GET [70]

    /admin/background_migrations/{background_migration_id}/batched_jobs/{id}(.{format})
    ╰─ GET [75]

    /admin/background_migrations/{id}(.{format})
    ╰─ GET [74]

    /admin/background_migrations/{id}/pause(.{format})
    ╰─ POST [71]

    /admin/background_migrations/{id}/resume(.{format})
    ╰─ POST [72]

    /admin/background_migrations/{id}/retry(.{format})
    ╰─ POST [73]

    /admin/broadcast_messages(.{format})
    ├─ GET [79]
    ╰─ POST [76]

    /admin/broadcast_messages/preview(.{format})
    ╰─ POST [80]

    /admin/broadcast_messages/{id}(.{format})
    ├─ DELETE [77]
    ├─ PATCH [81]
    ╰─ PUT [82]

    /admin/broadcast_messages/{id}/edit(.{format})
    ╰─ GET [78]

    /admin/ci/variables(.{format})
    ├─ GET [83]
    ├─ PATCH [84]
    ╰─ PUT [85]

    /admin/clusters(.{format})
    ╰─ GET [92]

    /admin/clusters/connect(.{format})
    ╰─ GET [88]

    /admin/clusters/create_user(.{format})
    ╰─ POST [89]

    /admin/clusters/new_cluster_docs(.{format})
    ╰─ GET [95]

    /admin/clusters/{cluster_id}/integration/create_or_update(.{format})
    ╰─ POST [99]

    /admin/clusters/{id}(.{format})
    ├─ DELETE [90]
    ├─ GET [96]
    ├─ PATCH [97]
    ╰─ PUT [98]

    /admin/clusters/{id}/clear_cache(.{format})
    ╰─ DELETE [86]

    /admin/clusters/{id}/cluster_status(.{format})
    ╰─ GET [87]

    /admin/clusters/{id}/environments(.{format})
    ╰─ GET [91]

    /admin/clusters/{id}/metrics(.{format})
    ╰─ GET [93]

    /admin/clusters/{id}/metrics_dashboard(.{format})
    ╰─ GET [94]

    /admin/code_suggestions(.{format})
    ╰─ GET [1851]

    /admin/cohorts(.{format})
    ╰─ GET [100]

    /admin/credentials(.{format})
    ╰─ GET [102]

    /admin/credentials/{credential_id}/resources/{resource_id}/revoke(.{format})
    ╰─ PUT [103]

    /admin/credentials/{id}(.{format})
    ╰─ DELETE [101]

    /admin/credentials/{id}/revoke(.{format})
    ╰─ PUT [104]

    /admin/dashboard/stats(.{format})
    ╰─ GET [106]

    /admin/deploy_keys(.{format})
    ├─ GET [110]
    ╰─ POST [107]

    /admin/deploy_keys/new(.{format})
    ╰─ GET [111]

    /admin/deploy_keys/{id}(.{format})
    ├─ DELETE [108]
    ├─ PATCH [112]
    ╰─ PUT [113]

    /admin/deploy_keys/{id}/edit(.{format})
    ╰─ GET [109]

    /admin/dev_ops_report(.{format})
    ╰─ GET [1850]

    /admin/dev_ops_reports(.{format})
    ╰─ GET [114]

    /admin/elasticsearch/cancel_index_deletion(.{format})
    ╰─ POST [115]

    /admin/elasticsearch/enqueue_index(.{format})
    ╰─ POST [116]

    /admin/elasticsearch/retry_migration(.{format})
    ╰─ POST [117]

    /admin/elasticsearch/trigger_reindexing(.{format})
    ╰─ POST [118]

    /admin/email(.{format})
    ├─ GET [120]
    ╰─ POST [119]

    /admin/geo(.{format})
    ╰─ GET [123]

    /admin/geo/replication(.{format})
    ╰─ GET [1856]

    /admin/geo/replication/{replicable_name_plural}(.{format})
    ╰─ GET [129]

    /admin/geo/settings(.{format})
    ├─ GET [132]
    ├─ PATCH [133]
    ╰─ PUT [134]

    /admin/geo/sites(.{format})
    ├─ GET [124]
    ╰─ POST [121]

    /admin/geo/sites/new(.{format})
    ╰─ GET [126]

    /admin/geo/sites/{id}(.{format})
    ├─ PATCH [127]
    ╰─ PUT [128]

    /admin/geo/sites/{id}/edit(.{format})
    ╰─ GET [122]

    /admin/geo/sites/{id}/replication(.{format})
    ╰─ GET [125]

    /admin/geo/sites/{id}/replication/{replicable_name_plural}(.{format})
    ╰─ GET [130]

    /admin/gitaly_servers(.{format})
    ╰─ GET [135]

    /admin/gitlab_duo(.{format})
    ╰─ GET [136]

    /admin/gitlab_duo/configuration(.{format})
    ╰─ GET [137]

    /admin/gitlab_duo/seat_utilization(.{format})
    ╰─ GET [138]

    /admin/groups(.{format})
    ├─ GET [142]
    ╰─ POST [139]

    /admin/groups/new(.{format})
    ╰─ GET [144]

    /admin/groups/{*id}(.{format:18})
    ├─ DELETE [140]
    ├─ GET [146]
    ├─ PATCH [147]
    ╰─ PUT [148]

    /admin/groups/{*id}/edit(.{format:18})
    ╰─ GET [141]

    /admin/groups/{*id}/members_update(.{format:18})
    ╰─ PUT [143]

    /admin/groups/{*id}/reset_runners_minutes(.{format:18})
    ╰─ POST [145]

    /admin/health_check(.{format})
    ╰─ GET [149]

    /admin/hooks(.{format})
    ├─ GET [155]
    ╰─ POST [152]

    /admin/hooks/{hook_id}/hook_logs/{id}(.{format})
    ╰─ GET [151]

    /admin/hooks/{hook_id}/hook_logs/{id}/retry(.{format})
    ╰─ POST [150]

    /admin/hooks/{id}(.{format})
    ├─ DELETE [153]
    ├─ PATCH [157]
    ╰─ PUT [158]

    /admin/hooks/{id}/edit(.{format})
    ╰─ GET [154]

    /admin/hooks/{id}/test(.{format})
    ╰─ POST [156]

    /admin/impersonation(.{format})
    ╰─ DELETE [169]

    /admin/initial_setup(.{format})
    ├─ PATCH [171]
    ╰─ PUT [172]

    /admin/initial_setup/new(.{format})
    ╰─ GET [170]

    /admin/instance_review(.{format})
    ╰─ GET [173]

    /admin/jobs(.{format})
    ╰─ GET [181]

    /admin/jobs/cancel_all(.{format})
    ╰─ POST [180]

    /admin/labels(.{format})
    ├─ GET [187]
    ╰─ POST [184]

    /admin/labels/new(.{format})
    ╰─ GET [188]

    /admin/labels/{id}(.{format})
    ├─ DELETE [185]
    ├─ GET [189]
    ├─ PATCH [190]
    ╰─ PUT [191]

    /admin/labels/{id}/edit(.{format})
    ╰─ GET [186]

    /admin/license(.{format})
    ├─ DELETE [193]
    ├─ GET [195]
    ╰─ POST [192]

    /admin/license/download(.{format})
    ╰─ GET [194]

    /admin/license/sync_seat_link(.{format})
    ╰─ POST [196]

    /admin/license/usage_export(.{format})
    ╰─ GET [197]

    /admin/namespace_limits(.{format})
    ╰─ GET [199]

    /admin/namespace_limits/export_usage(.{format})
    ╰─ GET [198]

    /admin/organizations(.{format})
    ╰─ GET [200]

    /admin/plan_limits(.{format})
    ╰─ POST [201]

    /admin/projects(.{format})
    ╰─ GET [204]

    /admin/projects/{*namespace_id}/{id:4}(.{format})
    ├─ DELETE [202]
    ├─ GET [206]
    ├─ PATCH [208]
    ╰─ PUT [209]

    /admin/projects/{*namespace_id}/{id:4}/edit(.{format})
    ╰─ GET [203]

    /admin/projects/{*namespace_id}/{id:4}/repository_check(.{format})
    ╰─ POST [205]

    /admin/projects/{*namespace_id}/{id:4}/transfer(.{format})
    ╰─ PUT [207]

    /admin/projects/{*namespace_id}/{project_id:4}/runner_projects(.{format})
    ╰─ POST [214]

    /admin/projects/{*namespace_id}/{project_id:4}/runner_projects/{id:4}(.{format})
    ╰─ DELETE [215]

    /admin/push_rule(.{format})
    ├─ GET [210]
    ├─ PATCH [211]
    ╰─ PUT [212]

    /admin/role_promotion_requests(.{format})
    ╰─ GET [213]

    /admin/runners(.{format})
    ╰─ GET [219]

    /admin/runners/dashboard(.{format})
    ╰─ GET [216]

    /admin/runners/new(.{format})
    ╰─ GET [220]

    /admin/runners/runner_setup_scripts(.{format})
    ╰─ GET [224]

    /admin/runners/tag_list(.{format})
    ╰─ GET [226]

    /admin/runners/{id}(.{format})
    ├─ DELETE [217]
    ├─ GET [225]
    ├─ PATCH [227]
    ╰─ PUT [228]

    /admin/runners/{id}/edit(.{format})
    ╰─ GET [218]

    /admin/runners/{id}/pause(.{format})
    ╰─ POST [221]

    /admin/runners/{id}/register(.{format})
    ╰─ GET [222]

    /admin/runners/{id}/resume(.{format})
    ╰─ POST [223]

    /admin/session(.{format})
    ╰─ POST [229]

    /admin/session/destroy(.{format})
    ╰─ POST [230]

    /admin/session/new(.{format})
    ╰─ GET [231]

    /admin/spam_logs(.{format})
    ╰─ GET [235]

    /admin/spam_logs/{id}(.{format})
    ╰─ DELETE [234]

    /admin/spam_logs/{id}/mark_as_ham(.{format})
    ╰─ POST [236]

    /admin/subscription(.{format})
    ╰─ GET [237]

    /admin/system_info(.{format})
    ╰─ GET [238]

    /admin/topics(.{format})
    ├─ GET [242]
    ╰─ POST [239]

    /admin/topics/merge(.{format})
    ╰─ POST [243]

    /admin/topics/new(.{format})
    ╰─ GET [244]

    /admin/topics/preview_markdown(.{format})
    ╰─ POST [245]

    /admin/topics/{id}(.{format})
    ├─ DELETE [240]
    ├─ PATCH [246]
    ╰─ PUT [247]

    /admin/topics/{id}/edit(.{format})
    ╰─ GET [241]

    /admin/topics/{topic_id}/avatar(.{format})
    ╰─ DELETE [248]

    /admin/usage_trends(.{format})
    ╰─ GET [249]

    /admin/user_permission_exports(.{format})
    ╰─ GET [250]

    /admin/users(.{format})
    ├─ GET [265]
    ╰─ POST [257]

    /admin/users/new(.{format})
    ╰─ GET [267]

    /admin/users/{id:34}(.{format})
    ├─ DELETE [259]
    ├─ GET [273]
    ├─ PATCH [279]
    ╰─ PUT [280]

    /admin/users/{id:34}/activate(.{format})
    ╰─ PUT [251]

    /admin/users/{id:34}/approve(.{format})
    ╰─ PUT [252]

    /admin/users/{id:34}/ban(.{format})
    ╰─ PUT [253]

    /admin/users/{id:34}/block(.{format})
    ╰─ PUT [254]

    /admin/users/{id:34}/card_match(.{format})
    ╰─ GET [255]

    /admin/users/{id:34}/confirm(.{format})
    ╰─ PUT [256]

    /admin/users/{id:34}/deactivate(.{format})
    ╰─ PUT [258]

    /admin/users/{id:34}/destroy_identity_verification_exemption(.{format})
    ╰─ DELETE [260]

    /admin/users/{id:34}/disable_two_factor(.{format})
    ╰─ PATCH [261]

    /admin/users/{id:34}/edit(.{format})
    ╰─ GET [262]

    /admin/users/{id:34}/identity_verification_exemption(.{format})
    ╰─ POST [263]

    /admin/users/{id:34}/impersonate(.{format})
    ╰─ POST [264]

    /admin/users/{id:34}/keys(.{format})
    ╰─ GET [266]

    /admin/users/{id:34}/phone_match(.{format})
    ╰─ GET [268]

    /admin/users/{id:34}/projects(.{format})
    ╰─ GET [269]

    /admin/users/{id:34}/reject(.{format})
    ╰─ DELETE [270]

    /admin/users/{id:34}/remove/{email_id}(.{format})
    ╰─ DELETE [271]

    /admin/users/{id:34}/reset_runners_minutes(.{format})
    ╰─ POST [272]

    /admin/users/{id:34}/trust(.{format})
    ╰─ PUT [274]

    /admin/users/{id:34}/unban(.{format})
    ╰─ PUT [275]

    /admin/users/{id:34}/unblock(.{format})
    ╰─ PUT [276]

    /admin/users/{id:34}/unlock(.{format})
    ╰─ PUT [277]

    /admin/users/{id:34}/untrust(.{format})
    ╰─ PUT [278]

    /admin/users/{user_id:34}/identities(.{format})
    ├─ GET [162]
    ╰─ POST [159]

    /admin/users/{user_id:34}/identities/new(.{format})
    ╰─ GET [163]

    /admin/users/{user_id:34}/identities/{id:34}(.{format})
    ├─ DELETE [160]
    ├─ PATCH [164]
    ╰─ PUT [165]

    /admin/users/{user_id:34}/identities/{id:34}/edit(.{format})
    ╰─ GET [161]

    /admin/users/{user_id:34}/impersonation_tokens(.{format})
    ├─ GET [167]
    ╰─ POST [166]

    /admin/users/{user_id:34}/impersonation_tokens/{id:34}/revoke(.{format})
    ╰─ PUT [168]

    /admin/users/{user_id:34}/keys/{id:34}(.{format})
    ├─ DELETE [182]
    ╰─ GET [183]

    /admin/version_check(.{format})
    ╰─ GET [281]

    /api/graphql(.{format})
    ├─ GET [388]
    ╰─ POST [388]

    /api/v4/geo/graphql(.{format})
    ├─ GET [389]
    ╰─ POST [389]

    /dashboard(.{format})
    ╰─ GET [332]

    /dashboard/activity(.{format})
    ╰─ GET [323]

    /dashboard/groups(.{format})
    ╰─ GET [329]

    /dashboard/issues(.{format})
    ╰─ GET [324]

    /dashboard/issues.ics
    ╰─ GET [325]

    /dashboard/labels(.{format})
    ╰─ GET [330]

    /dashboard/merge_requests(.{format})
    ╰─ GET [326]

    /dashboard/merge_requests/following(.{format})
    ╰─ GET [327]

    /dashboard/merge_requests/search(.{format})
    ╰─ GET [328]

    /dashboard/milestones(.{format})
    ╰─ GET [331]

    /dashboard/projects(.{format})
    ╰─ GET [333]

    /dashboard/projects/contributed(.{format})
    ╰─ GET [334]

    /dashboard/projects/inactive(.{format})
    ╰─ GET [335]

    /dashboard/projects/member(.{format})
    ╰─ GET [336]

    /dashboard/projects/personal(.{format})
    ╰─ GET [337]

    /dashboard/projects/removed(.{format})
    ╰─ GET [338]

    /dashboard/projects/starred(.{format})
    ╰─ GET [339]

    /dashboard/snippets(.{format})
    ╰─ GET [340]

    /dashboard/todos(.{format})
    ╰─ GET [344]

    /dashboard/todos/bulk_restore(.{format})
    ╰─ PATCH [341]

    /dashboard/todos/destroy_all(.{format})
    ╰─ DELETE [343]

    /dashboard/todos/vue(.{format})
    ╰─ GET [346]

    /dashboard/todos/{id}(.{format})
    ╰─ DELETE [342]

    /dashboard/todos/{id}/restore(.{format})
    ╰─ PATCH [345]

    /explore(.{format})
    ╰─ GET [357]

    /explore/catalog(.{format})
    ╰─ GET [353]

    /explore/catalog/{*full_path}(.{format})
    ╰─ GET [354]

    /explore/dependencies(.{format})
    ╰─ GET [355]

    /explore/groups(.{format})
    ╰─ GET [356]

    /explore/projects(.{format})
    ╰─ GET [358]

    /explore/projects/starred(.{format})
    ╰─ GET [361]

    /explore/projects/topics(.{format})
    ╰─ GET [363]

    /explore/projects/topics/{topic_name:33}(.{format:32})
    ╰─ GET [362]

    /explore/projects/trending(.{format})
    ╰─ GET [364]

    /explore/snippets(.{format})
    ╰─ GET [365]

    /favicon.ico(.{format})
    ╰─ GET [1798]

    /favicon.png(.{format})
    ╰─ GET [1799]

    /files/note/{id}/{filename:0}(.{format})
    ╰─ GET [1857]

    /gitlab_experiment_engine/{id}(.{format})
    ╰─ GET [367]

    /groups(.{format})
    ├─ GET [397]
    ╰─ POST [391]

    /groups/new(.{format})
    ╰─ GET [401]

    /groups/{*group_id:2}/-/analytics/dashboards(/{*vueroute})
    ╰─ GET [439]

    /groups/{*group_id:2}/-/uploads/{secret}/{filename:0}
    ╰─ GET [747]

    /groups/{*group_id:2}/-/wikis/{*id}
    ├─ DELETE [755]
    ├─ GET [764]
    ╰─ PUT [766]

    /groups/{*group_id:2}/-/wikis/{*id}/diff
    ╰─ GET [756]

    /groups/{*group_id:2}/-/wikis/{*id}/edit
    ╰─ GET [757]

    /groups/{*group_id:2}/-/wikis/{*id}/history
    ╰─ GET [759]

    /groups/{*group_id:2}/-/wikis/{*id}/preview_markdown
    ╰─ POST [762]

    /groups/{*group_id:2}/-/wikis/{*id}/raw
    ╰─ GET [763]

    /groups/{*group_id}/-/achievements(.{format})
    ╰─ GET [414]

    /groups/{*group_id}/-/achievements/new(.{format})
    ╰─ GET [415]

    /groups/{*group_id}/-/achievements/{id}/edit(.{format})
    ╰─ GET [413]

    /groups/{*group_id}/-/add_ons/discover_duo_enterprise(.{format})
    ╰─ GET [416]

    /groups/{*group_id}/-/add_ons/discover_duo_pro(.{format})
    ╰─ GET [417]

    /groups/{*group_id}/-/analytics(.{format})
    ╰─ GET [1852]

    /groups/{*group_id}/-/analytics/ci_cd(.{format})
    ╰─ GET [418]

    /groups/{*group_id}/-/analytics/coverage_reports(.{format})
    ╰─ GET [419]

    /groups/{*group_id}/-/analytics/cycle_analytics(.{format})
    ╰─ GET [1845]

    /groups/{*group_id}/-/analytics/devops_adoption(.{format})
    ╰─ GET [440]

    /groups/{*group_id}/-/analytics/merge_request_analytics(.{format})
    ╰─ GET [441]

    /groups/{*group_id}/-/analytics/productivity_analytics(.{format})
    ╰─ GET [442]

    /groups/{*group_id}/-/analytics/repository_analytics(.{format})
    ╰─ GET [443]

    /groups/{*group_id}/-/analytics/type_of_work/tasks_by_type(.{format})
    ╰─ GET [444]

    /groups/{*group_id}/-/analytics/type_of_work/tasks_by_type/top_labels(.{format})
    ╰─ GET [445]

    /groups/{*group_id}/-/analytics/value_stream_analytics(.{format})
    ╰─ GET [420]

    /groups/{*group_id}/-/analytics/value_stream_analytics/cycle_times(.{format})
    ╰─ GET [427]

    /groups/{*group_id}/-/analytics/value_stream_analytics/lead_times(.{format})
    ╰─ GET [428]

    /groups/{*group_id}/-/analytics/value_stream_analytics/summary(.{format})
    ╰─ GET [429]

    /groups/{*group_id}/-/analytics/value_stream_analytics/time_summary(.{format})
    ╰─ GET [430]

    /groups/{*group_id}/-/analytics/value_stream_analytics/value_streams(.{format})
    ├─ GET [434]
    ╰─ POST [431]

    /groups/{*group_id}/-/analytics/value_stream_analytics/value_streams/new(.{format})
    ╰─ GET [435]

    /groups/{*group_id}/-/analytics/value_stream_analytics/value_streams/{id}(.{format})
    ├─ DELETE [432]
    ├─ GET [436]
    ├─ PATCH [437]
    ╰─ PUT [438]

    /groups/{*group_id}/-/analytics/value_stream_analytics/value_streams/{id}/edit(.{format})
    ╰─ GET [433]

    /groups/{*group_id}/-/analytics/value_stream_analytics/value_streams/{value_stream_id}/stages(.{format})
    ╰─ GET [424]

    /groups/{*group_id}/-/analytics/value_stream_analytics/value_streams/{value_stream_id}/stages/{id}/average(.{format})
    ╰─ GET [421]

    /groups/{*group_id}/-/analytics/value_stream_analytics/value_streams/{value_stream_id}/stages/{id}/average_duration_chart(.{format})
    ╰─ GET [422]

    /groups/{*group_id}/-/analytics/value_stream_analytics/value_streams/{value_stream_id}/stages/{id}/count(.{format})
    ╰─ GET [423]

    /groups/{*group_id}/-/analytics/value_stream_analytics/value_streams/{value_stream_id}/stages/{id}/median(.{format})
    ╰─ GET [425]

    /groups/{*group_id}/-/analytics/value_stream_analytics/value_streams/{value_stream_id}/stages/{id}/records(.{format})
    ╰─ GET [426]

    /groups/{*group_id}/-/audit_events(.{format})
    ╰─ GET [446]

    /groups/{*group_id}/-/autocomplete_sources/commands(.{format})
    ╰─ GET [447]

    /groups/{*group_id}/-/autocomplete_sources/epics(.{format})
    ╰─ GET [448]

    /groups/{*group_id}/-/autocomplete_sources/issues(.{format})
    ╰─ GET [449]

    /groups/{*group_id}/-/autocomplete_sources/iterations(.{format})
    ╰─ GET [450]

    /groups/{*group_id}/-/autocomplete_sources/labels(.{format})
    ╰─ GET [451]

    /groups/{*group_id}/-/autocomplete_sources/members(.{format})
    ╰─ GET [452]

    /groups/{*group_id}/-/autocomplete_sources/merge_requests(.{format})
    ╰─ GET [453]

    /groups/{*group_id}/-/autocomplete_sources/milestones(.{format})
    ╰─ GET [454]

    /groups/{*group_id}/-/autocomplete_sources/vulnerabilities(.{format})
    ╰─ GET [455]

    /groups/{*group_id}/-/autocomplete_sources/wikis(.{format})
    ╰─ GET [456]

    /groups/{*group_id}/-/avatar(.{format})
    ╰─ DELETE [457]

    /groups/{*group_id}/-/billings(.{format})
    ╰─ GET [458]

    /groups/{*group_id}/-/billings/refresh_seats(.{format})
    ╰─ POST [459]

    /groups/{*group_id}/-/boards(.{format})
    ╰─ GET [460]

    /groups/{*group_id}/-/boards/{id:3}(.{format})
    ╰─ GET [461]

    /groups/{*group_id}/-/cadences(/{*vueroute})(.{format})
    ├─ GET [579]
    ╰─ POST [588]

    /groups/{*group_id}/-/cadences(/{*vueroute})/new(.{format})
    ╰─ GET [580]

    /groups/{*group_id}/-/cadences(/{*vueroute})/{id}(.{format})
    ├─ DELETE [578]
    ├─ GET [581]
    ├─ PATCH [587]
    ╰─ PUT [589]

    /groups/{*group_id}/-/cadences(/{*vueroute})/{id}/edit(.{format})
    ╰─ GET [582]

    /groups/{*group_id}/-/cadences(/{*vueroute})/{iteration_cadence_id}/iterations(.{format})
    ╰─ GET [583]

    /groups/{*group_id}/-/cadences(/{*vueroute})/{iteration_cadence_id}/iterations/new(.{format})
    ╰─ GET [584]

    /groups/{*group_id}/-/cadences(/{*vueroute})/{iteration_cadence_id}/iterations/{id:3}(.{format})
    ╰─ GET [585]

    /groups/{*group_id}/-/cadences(/{*vueroute})/{iteration_cadence_id}/iterations/{id:3}/edit(.{format})
    ╰─ GET [586]

    /groups/{*group_id}/-/children(.{format})
    ╰─ GET [462]

    /groups/{*group_id}/-/clusters(.{format})
    ╰─ GET [469]

    /groups/{*group_id}/-/clusters/connect(.{format})
    ╰─ GET [465]

    /groups/{*group_id}/-/clusters/create_user(.{format})
    ╰─ POST [466]

    /groups/{*group_id}/-/clusters/new_cluster_docs(.{format})
    ╰─ GET [472]

    /groups/{*group_id}/-/clusters/{cluster_id}/integration/create_or_update(.{format})
    ╰─ POST [476]

    /groups/{*group_id}/-/clusters/{id}(.{format})
    ├─ DELETE [467]
    ├─ GET [473]
    ├─ PATCH [474]
    ╰─ PUT [475]

    /groups/{*group_id}/-/clusters/{id}/clear_cache(.{format})
    ╰─ DELETE [463]

    /groups/{*group_id}/-/clusters/{id}/cluster_status(.{format})
    ╰─ GET [464]

    /groups/{*group_id}/-/clusters/{id}/environments(.{format})
    ╰─ GET [468]

    /groups/{*group_id}/-/clusters/{id}/metrics(.{format})
    ╰─ GET [470]

    /groups/{*group_id}/-/clusters/{id}/metrics_dashboard(.{format})
    ╰─ GET [471]

    /groups/{*group_id}/-/comment_templates(.{format})
    ╰─ GET [477]

    /groups/{*group_id}/-/comment_templates/{id}(.{format})
    ╰─ GET [478]

    /groups/{*group_id}/-/container_registries(.{format})
    ╰─ GET [635]

    /groups/{*group_id}/-/container_registries/{id}(.{format})
    ╰─ GET [636]

    /groups/{*group_id}/-/contribution_analytics(.{format})
    ╰─ GET [480]

    /groups/{*group_id}/-/crm/contacts(.{format})
    ╰─ GET [482]

    /groups/{*group_id}/-/crm/contacts/new(.{format})
    ╰─ GET [483]

    /groups/{*group_id}/-/crm/contacts/{id}/edit(.{format})
    ╰─ GET [481]

    /groups/{*group_id}/-/crm/organizations(.{format})
    ╰─ GET [485]

    /groups/{*group_id}/-/crm/organizations/new(.{format})
    ╰─ GET [486]

    /groups/{*group_id}/-/crm/organizations/{id}/edit(.{format})
    ╰─ GET [484]

    /groups/{*group_id}/-/custom_emoji(.{format})
    ╰─ GET [487]

    /groups/{*group_id}/-/custom_emoji/new(.{format})
    ╰─ GET [488]

    /groups/{*group_id}/-/dependencies(.{format})
    ╰─ GET [489]

    /groups/{*group_id}/-/dependencies/licenses(.{format})
    ╰─ GET [490]

    /groups/{*group_id}/-/dependencies/locations(.{format})
    ╰─ GET [491]

    /groups/{*group_id}/-/dependency_proxy(.{format})
    ├─ GET [492]
    ├─ PATCH [493]
    ╰─ PUT [494]

    /groups/{*group_id}/-/deploy_tokens/{id:3}/revoke(.{format})
    ╰─ PUT [502]

    /groups/{*group_id}/-/discover(.{format})
    ╰─ GET [503]

    /groups/{*group_id}/-/early_access_opt_in(.{format})
    ├─ GET [505]
    ╰─ POST [504]

    /groups/{*group_id}/-/epic_boards(.{format})
    ╰─ GET [506]

    /groups/{*group_id}/-/epic_boards/{id}(.{format})
    ╰─ GET [507]

    /groups/{*group_id}/-/epics(.{format})
    ├─ GET [520]
    ╰─ POST [514]

    /groups/{*group_id}/-/epics/bulk_update(.{format})
    ╰─ POST [513]

    /groups/{*group_id}/-/epics/new(.{format})
    ╰─ GET [521]

    /groups/{*group_id}/-/epics/{epic_id:3}/issues(.{format})
    ├─ GET [510]
    ╰─ POST [508]

    /groups/{*group_id}/-/epics/{epic_id:3}/issues/{id:3}(.{format})
    ├─ DELETE [509]
    ├─ PATCH [511]
    ╰─ PUT [512]

    /groups/{*group_id}/-/epics/{epic_id:3}/links(.{format})
    ├─ GET [530]
    ╰─ POST [528]

    /groups/{*group_id}/-/epics/{epic_id:3}/links/{id:3}(.{format})
    ├─ DELETE [529]
    ├─ PATCH [531]
    ╰─ PUT [532]

    /groups/{*group_id}/-/epics/{epic_id:3}/notes(.{format})
    ├─ GET [535]
    ╰─ POST [533]

    /groups/{*group_id}/-/epics/{epic_id:3}/notes/{id:3}(.{format})
    ├─ DELETE [534]
    ├─ PATCH [537]
    ╰─ PUT [538]

    /groups/{*group_id}/-/epics/{epic_id:3}/notes/{id:3}/toggle_award_emoji(.{format})
    ╰─ POST [536]

    /groups/{*group_id}/-/epics/{epic_id:3}/related_epic_links(.{format})
    ├─ GET [541]
    ╰─ POST [539]

    /groups/{*group_id}/-/epics/{epic_id:3}/related_epic_links/{id:3}(.{format})
    ╰─ DELETE [540]

    /groups/{*group_id}/-/epics/{id:3}(.{format})
    ├─ DELETE [517]
    ├─ GET [523]
    ├─ PATCH [526]
    ╰─ PUT [527]

    /groups/{*group_id}/-/epics/{id:3}/descriptions/{version_id}(.{format})
    ╰─ DELETE [515]

    /groups/{*group_id}/-/epics/{id:3}/descriptions/{version_id}/diff(.{format})
    ╰─ GET [516]

    /groups/{*group_id}/-/epics/{id:3}/discussions(.{format})
    ╰─ GET [518]

    /groups/{*group_id}/-/epics/{id:3}/edit(.{format})
    ╰─ GET [519]

    /groups/{*group_id}/-/epics/{id:3}/realtime_changes(.{format})
    ╰─ GET [522]

    /groups/{*group_id}/-/epics/{id:3}/toggle_award_emoji(.{format})
    ╰─ POST [524]

    /groups/{*group_id}/-/epics/{id:3}/toggle_subscription(.{format})
    ╰─ POST [525]

    /groups/{*group_id}/-/group_links/{id:16}(.{format})
    ├─ DELETE [542]
    ├─ PATCH [543]
    ╰─ PUT [544]

    /groups/{*group_id}/-/group_members(.{format})
    ╰─ GET [550]

    /groups/{*group_id}/-/group_members/bulk_reassignment_file(.{format})
    ╰─ GET [547]

    /groups/{*group_id}/-/group_members/export_csv(.{format})
    ╰─ GET [549]

    /groups/{*group_id}/-/group_members/leave(.{format})
    ╰─ DELETE [551]

    /groups/{*group_id}/-/group_members/request_access(.{format})
    ├─ GET [553]
    ╰─ POST [554]

    /groups/{*group_id}/-/group_members/{id}(.{format})
    ├─ DELETE [548]
    ├─ PATCH [557]
    ╰─ PUT [558]

    /groups/{*group_id}/-/group_members/{id}/approve_access_request(.{format})
    ╰─ POST [545]

    /groups/{*group_id}/-/group_members/{id}/ban(.{format})
    ╰─ PUT [546]

    /groups/{*group_id}/-/group_members/{id}/override(.{format})
    ╰─ PATCH [552]

    /groups/{*group_id}/-/group_members/{id}/resend_invite(.{format})
    ╰─ POST [555]

    /groups/{*group_id}/-/group_members/{id}/unban(.{format})
    ╰─ PUT [556]

    /groups/{*group_id}/-/harbor/repositories(.{format})
    ╰─ GET [560]

    /groups/{*group_id}/-/harbor/repositories/{id:17}(.{format})
    ╰─ GET [561]

    /groups/{*group_id}/-/harbor/repositories/{repository_id:17}/artifacts(.{format})
    ╰─ GET [559]

    /groups/{*group_id}/-/harbor/repositories/{repository_id:17}/artifacts/{artifact_id:17}/tags(.{format})
    ╰─ GET [562]

    /groups/{*group_id}/-/hooks(.{format})
    ├─ GET [568]
    ╰─ POST [565]

    /groups/{*group_id}/-/hooks/{hook_id:3}/hook_logs/{id:3}(.{format})
    ╰─ GET [564]

    /groups/{*group_id}/-/hooks/{hook_id:3}/hook_logs/{id:3}/retry(.{format})
    ╰─ POST [563]

    /groups/{*group_id}/-/hooks/{id:3}(.{format})
    ├─ DELETE [566]
    ├─ PATCH [570]
    ╰─ PUT [571]

    /groups/{*group_id}/-/hooks/{id:3}/edit(.{format})
    ╰─ GET [567]

    /groups/{*group_id}/-/hooks/{id:3}/test(.{format})
    ╰─ POST [569]

    /groups/{*group_id}/-/import(.{format})
    ╰─ GET [572]

    /groups/{*group_id}/-/infrastructure_registry(.{format})
    ╰─ GET [1854]

    /groups/{*group_id}/-/insights(.{format})
    ╰─ GET [575]

    /groups/{*group_id}/-/insights/query(.{format})
    ╰─ POST [574]

    /groups/{*group_id}/-/issues/bulk_update(.{format})
    ╰─ POST [576]

    /groups/{*group_id}/-/issues_analytics(.{format})
    ╰─ GET [577]

    /groups/{*group_id}/-/iterations(.{format})
    ╰─ GET [591]

    /groups/{*group_id}/-/iterations/new(.{format})
    ╰─ GET [592]

    /groups/{*group_id}/-/iterations/{id:3}(.{format})
    ╰─ GET [593]

    /groups/{*group_id}/-/iterations/{id:3}/edit(.{format})
    ╰─ GET [590]

    /groups/{*group_id}/-/labels(.{format})
    ├─ GET [597]
    ╰─ POST [594]

    /groups/{*group_id}/-/labels/new(.{format})
    ╰─ GET [598]

    /groups/{*group_id}/-/labels/{id}(.{format})
    ├─ DELETE [595]
    ├─ PATCH [600]
    ╰─ PUT [601]

    /groups/{*group_id}/-/labels/{id}/edit(.{format})
    ╰─ GET [596]

    /groups/{*group_id}/-/labels/{id}/toggle_subscription(.{format})
    ╰─ POST [599]

    /groups/{*group_id}/-/ldap/sync(.{format})
    ╰─ PUT [605]

    /groups/{*group_id}/-/ldap_group_links(.{format})
    ├─ GET [604]
    ╰─ POST [602]

    /groups/{*group_id}/-/ldap_group_links/{id}(.{format})
    ╰─ DELETE [603]

    /groups/{*group_id}/-/merge_requests/bulk_update(.{format})
    ╰─ POST [606]

    /groups/{*group_id}/-/milestones(.{format})
    ├─ GET [610]
    ╰─ POST [607]

    /groups/{*group_id}/-/milestones/new(.{format})
    ╰─ GET [614]

    /groups/{*group_id}/-/milestones/{id:0}(.{format})
    ├─ DELETE [608]
    ├─ GET [616]
    ├─ PATCH [617]
    ╰─ PUT [618]

    /groups/{*group_id}/-/milestones/{id:0}/edit(.{format})
    ╰─ GET [609]

    /groups/{*group_id}/-/milestones/{id:0}/issues(.{format})
    ╰─ GET [611]

    /groups/{*group_id}/-/milestones/{id:0}/labels(.{format})
    ╰─ GET [612]

    /groups/{*group_id}/-/milestones/{id:0}/merge_requests(.{format})
    ╰─ GET [613]

    /groups/{*group_id}/-/milestones/{id:0}/participants(.{format})
    ╰─ GET [615]

    /groups/{*group_id}/-/notification_setting(.{format})
    ├─ PATCH [619]
    ╰─ PUT [620]

    /groups/{*group_id}/-/packages(.{format})
    ╰─ GET [622]

    /groups/{*group_id}/-/packages/{id}(.{format})
    ╰─ GET [623]

    /groups/{*group_id}/-/preview_markdown(.{format})
    ╰─ POST [402]

    /groups/{*group_id}/-/protected_branches(.{format})
    ╰─ POST [624]

    /groups/{*group_id}/-/protected_branches/{id}(.{format})
    ├─ DELETE [625]
    ├─ PATCH [626]
    ╰─ PUT [627]

    /groups/{*group_id}/-/protected_environments(.{format})
    ╰─ POST [628]

    /groups/{*group_id}/-/protected_environments/{id}(.{format})
    ├─ DELETE [629]
    ├─ PATCH [630]
    ╰─ PUT [631]

    /groups/{*group_id}/-/push_rules(.{format})
    ├─ PATCH [632]
    ╰─ PUT [633]

    /groups/{*group_id}/-/releases(.{format})
    ╰─ GET [637]

    /groups/{*group_id}/-/restore(.{format})
    ╰─ POST [404]

    /groups/{*group_id}/-/roadmap(.{format})
    ╰─ GET [638]

    /groups/{*group_id}/-/runners(.{format})
    ╰─ GET [642]

    /groups/{*group_id}/-/runners/dashboard(.{format})
    ╰─ GET [639]

    /groups/{*group_id}/-/runners/new(.{format})
    ╰─ GET [643]

    /groups/{*group_id}/-/runners/{id}(.{format})
    ├─ DELETE [640]
    ├─ GET [647]
    ├─ PATCH [648]
    ╰─ PUT [649]

    /groups/{*group_id}/-/runners/{id}/edit(.{format})
    ╰─ GET [641]

    /groups/{*group_id}/-/runners/{id}/pause(.{format})
    ╰─ POST [644]

    /groups/{*group_id}/-/runners/{id}/register(.{format})
    ╰─ GET [645]

    /groups/{*group_id}/-/runners/{id}/resume(.{format})
    ╰─ POST [646]

    /groups/{*group_id}/-/saml(.{format})
    ├─ GET [654]
    ├─ PATCH [655]
    ├─ POST [653]
    ╰─ PUT [656]

    /groups/{*group_id}/-/saml/callback(.{format})
    ╰─ POST [621]

    /groups/{*group_id}/-/saml/sso(.{format})
    ├─ GET [740]
    ╰─ POST [741]

    /groups/{*group_id}/-/saml/unlink(.{format})
    ╰─ DELETE [742]

    /groups/{*group_id}/-/saml/update_microsoft_application(.{format})
    ╰─ PUT [657]

    /groups/{*group_id}/-/saml_group_links(.{format})
    ├─ GET [652]
    ╰─ POST [650]

    /groups/{*group_id}/-/saml_group_links/{id}(.{format})
    ╰─ DELETE [651]

    /groups/{*group_id}/-/scim_oauth(.{format})
    ╰─ POST [658]

    /groups/{*group_id}/-/seat_usage(.{format})
    ╰─ GET [659]

    /groups/{*group_id}/-/security/compliance_dashboard(/{*vueroute})(.{format})
    ╰─ GET [660]

    /groups/{*group_id}/-/security/compliance_framework_reports(.{format:14})
    ╰─ GET [661]

    /groups/{*group_id}/-/security/compliance_project_framework_reports(.{format:14})
    ╰─ GET [662]

    /groups/{*group_id}/-/security/compliance_standards_adherence_reports(.{format:14})
    ╰─ GET [663]

    /groups/{*group_id}/-/security/compliance_violation_reports(.{format:14})
    ╰─ GET [664]

    /groups/{*group_id}/-/security/credentials(.{format})
    ╰─ GET [666]

    /groups/{*group_id}/-/security/credentials/{id}(.{format})
    ╰─ DELETE [665]

    /groups/{*group_id}/-/security/credentials/{id}/revoke(.{format})
    ╰─ PUT [667]

    /groups/{*group_id}/-/security/dashboard(.{format})
    ╰─ GET [668]

    /groups/{*group_id}/-/security/discover(.{format})
    ╰─ GET [669]

    /groups/{*group_id}/-/security/merge_commit_reports(.{format:14})
    ╰─ GET [670]

    /groups/{*group_id}/-/security/policies(.{format})
    ╰─ GET [672]

    /groups/{*group_id}/-/security/policies/new(.{format})
    ╰─ GET [673]

    /groups/{*group_id}/-/security/policies/schema(.{format})
    ╰─ GET [674]

    /groups/{*group_id}/-/security/policies/{id:0}/edit(.{format})
    ╰─ GET [671]

    /groups/{*group_id}/-/security/vulnerabilities(.{format})
    ╰─ GET [675]

    /groups/{*group_id}/-/service_accounts(/{*vueroute})(.{format})
    ├─ GET [677]
    ╰─ POST [682]

    /groups/{*group_id}/-/service_accounts(/{*vueroute})/new(.{format})
    ╰─ GET [678]

    /groups/{*group_id}/-/service_accounts(/{*vueroute})/{id}(.{format})
    ├─ DELETE [676]
    ├─ GET [679]
    ├─ PATCH [681]
    ╰─ PUT [683]

    /groups/{*group_id}/-/service_accounts(/{*vueroute})/{id}/edit(.{format})
    ╰─ GET [680]

    /groups/{*group_id}/-/settings/access_tokens(.{format})
    ├─ GET [685]
    ╰─ POST [684]

    /groups/{*group_id}/-/settings/access_tokens/{id}/revoke(.{format})
    ╰─ PUT [686]

    /groups/{*group_id}/-/settings/analytics(.{format})
    ├─ GET [687]
    ├─ PATCH [688]
    ╰─ PUT [689]

    /groups/{*group_id}/-/settings/applications(.{format})
    ├─ GET [693]
    ╰─ POST [690]

    /groups/{*group_id}/-/settings/applications/new(.{format})
    ╰─ GET [694]

    /groups/{*group_id}/-/settings/applications/{id}(.{format})
    ├─ DELETE [691]
    ├─ GET [696]
    ├─ PATCH [697]
    ╰─ PUT [698]

    /groups/{*group_id}/-/settings/applications/{id}/edit(.{format})
    ╰─ GET [692]

    /groups/{*group_id}/-/settings/applications/{id}/renew(.{format})
    ╰─ PUT [695]

    /groups/{*group_id}/-/settings/ci_cd(.{format})
    ├─ GET [701]
    ├─ PATCH [702]
    ╰─ PUT [703]

    /groups/{*group_id}/-/settings/ci_cd/deploy_token/create(.{format})
    ╰─ POST [729]

    /groups/{*group_id}/-/settings/ci_cd/reset_registration_token(.{format})
    ╰─ PUT [699]

    /groups/{*group_id}/-/settings/ci_cd/runner_setup_scripts(.{format})
    ╰─ GET [700]

    /groups/{*group_id}/-/settings/ci_cd/update_auto_devops(.{format})
    ╰─ PATCH [704]

    /groups/{*group_id}/-/settings/domain_verification(.{format})
    ├─ GET [708]
    ╰─ POST [706]

    /groups/{*group_id}/-/settings/domain_verification/new(.{format})
    ╰─ GET [709]

    /groups/{*group_id}/-/settings/domain_verification/{id:0}(.{format})
    ├─ DELETE [707]
    ├─ GET [711]
    ├─ PATCH [712]
    ╰─ PUT [713]

    /groups/{*group_id}/-/settings/domain_verification/{id:0}/clean_certificate(.{format})
    ╰─ DELETE [705]

    /groups/{*group_id}/-/settings/domain_verification/{id:0}/retry_auto_ssl(.{format})
    ╰─ POST [710]

    /groups/{*group_id}/-/settings/domain_verification/{id:0}/verify(.{format})
    ╰─ POST [714]

    /groups/{*group_id}/-/settings/gitlab_duo(.{format})
    ╰─ GET [715]

    /groups/{*group_id}/-/settings/gitlab_duo/configuration(.{format})
    ╰─ GET [716]

    /groups/{*group_id}/-/settings/gitlab_duo/seat_utilization(.{format})
    ╰─ GET [717]

    /groups/{*group_id}/-/settings/gitlab_duo_usage(.{format})
    ╰─ GET [1853]

    /groups/{*group_id}/-/settings/integrations(.{format})
    ╰─ GET [719]

    /groups/{*group_id}/-/settings/integrations/{id}(.{format})
    ├─ PATCH [722]
    ╰─ PUT [723]

    /groups/{*group_id}/-/settings/integrations/{id}/edit(.{format})
    ╰─ GET [718]

    /groups/{*group_id}/-/settings/integrations/{id}/reset(.{format})
    ╰─ POST [720]

    /groups/{*group_id}/-/settings/integrations/{id}/test(.{format})
    ╰─ PUT [721]

    /groups/{*group_id}/-/settings/issues(.{format})
    ╰─ GET [738]

    /groups/{*group_id}/-/settings/merge_requests(.{format})
    ├─ PATCH [724]
    ╰─ PUT [725]

    /groups/{*group_id}/-/settings/packages_and_registries(.{format})
    ╰─ GET [726]

    /groups/{*group_id}/-/settings/reporting(.{format})
    ╰─ GET [728]

    /groups/{*group_id}/-/settings/repository(.{format})
    ╰─ GET [731]

    /groups/{*group_id}/-/settings/repository/deploy_token/create(.{format})
    ╰─ POST [730]

    /groups/{*group_id}/-/settings/roles_and_permissions(.{format})
    ╰─ GET [733]

    /groups/{*group_id}/-/settings/roles_and_permissions/new(.{format})
    ╰─ GET [734]

    /groups/{*group_id}/-/settings/roles_and_permissions/{id}(.{format})
    ╰─ GET [735]

    /groups/{*group_id}/-/settings/roles_and_permissions/{id}/edit(.{format})
    ╰─ GET [732]

    /groups/{*group_id}/-/settings/slack(.{format})
    ╰─ DELETE [736]

    /groups/{*group_id}/-/settings/slack/slack_auth(.{format})
    ╰─ GET [737]

    /groups/{*group_id}/-/settings/workspaces(.{format})
    ╰─ GET [727]

    /groups/{*group_id}/-/shared_projects(.{format})
    ╰─ GET [739]

    /groups/{*group_id}/-/terraform_module_registry(.{format})
    ╰─ GET [573]

    /groups/{*group_id}/-/todos(.{format})
    ╰─ POST [743]

    /groups/{*group_id}/-/two_factor_auth(.{format})
    ╰─ DELETE [744]

    /groups/{*group_id}/-/uploads(.{format})
    ╰─ POST [746]

    /groups/{*group_id}/-/uploads/authorize(.{format})
    ╰─ POST [745]

    /groups/{*group_id}/-/usage_quotas(.{format})
    ╰─ GET [748]

    /groups/{*group_id}/-/usage_quotas/pending_members(.{format})
    ╰─ GET [749]

    /groups/{*group_id}/-/usage_quotas/subscription_history(.{format:14})
    ╰─ GET [750]

    /groups/{*group_id}/-/variables(.{format})
    ├─ GET [751]
    ├─ PATCH [752]
    ╰─ PUT [753]

    /groups/{*group_id}/-/wikis(.{format})
    ├─ GET [1800]
    ╰─ POST [754]

    /groups/{*group_id}/-/wikis/-/confluence(.{format})
    ╰─ GET [479]

    /groups/{*group_id}/-/wikis/git_access(.{format})
    ╰─ GET [758]

    /groups/{*group_id}/-/wikis/new(.{format})
    ╰─ GET [760]

    /groups/{*group_id}/-/wikis/pages(.{format})
    ╰─ GET [761]

    /groups/{*group_id}/-/wikis/templates(.{format})
    ╰─ GET [765]

    /groups/{*group_id}/-/work_items(.{format})
    ╰─ GET [769]

    /groups/{*group_id}/-/work_items/{iid}(.{format})
    ╰─ GET [770]

    /groups/{*group_id}/-/work_items/{iid}/descriptions/{version_id}(.{format})
    ╰─ DELETE [767]

    /groups/{*group_id}/-/work_items/{iid}/descriptions/{version_id}/diff(.{format})
    ╰─ GET [768]

    /groups/{*id}(.{format:15})
    ╰─ GET [405]

    /groups/{*id}/-/activity(.{format:15})
    ╰─ GET [390]

    /groups/{*id}/-/archived(.{format:15})
    ╰─ GET [1855]

    /groups/{*id}/-/details(.{format:15})
    ╰─ GET [393]

    /groups/{*id}/-/download_export(.{format:15})
    ╰─ GET [394]

    /groups/{*id}/-/edit(.{format:15})
    ╰─ GET [395]

    /groups/{*id}/-/export(.{format:15})
    ╰─ POST [396]

    /groups/{*id}/-/inactive(.{format:15})
    ╰─ GET [406]

    /groups/{*id}/-/issues(.{format:15})
    ╰─ GET [398]

    /groups/{*id}/-/issues.ics
    ╰─ GET [399]

    /groups/{*id}/-/merge_requests(.{format:15})
    ╰─ GET [400]

    /groups/{*id}/-/projects(.{format:15})
    ╰─ GET [403]

    /groups/{*id}/-/shared(.{format:15})
    ╰─ GET [407]

    /groups/{*id}/-/transfer(.{format:15})
    ╰─ PUT [409]

    /groups/{*id}/-/unfoldered_environment_names(.{format:15})
    ╰─ GET [410]

    /health_check(/{checks})(.{format})
    ╰─ GET [773]

    /help(.{format})
    ╰─ GET [775]

    /help/docs(.{format})
    ╰─ GET [777]

    /help/drawers/{*markdown_file}(.{format})
    ╰─ GET [774]

    /help/instance_configuration(.{format})
    ╰─ GET [776]

    /help/shortcuts(.{format})
    ╰─ GET [778]

    /help/{*path}(.{format})
    ╰─ GET [779]

    /import/bitbucket(.{format})
    ╰─ POST [798]

    /import/bitbucket/callback(.{format})
    ╰─ GET [797]

    /import/bitbucket/realtime_changes(.{format})
    ╰─ GET [799]

    /import/bitbucket/status(.{format})
    ╰─ GET [800]

    /import/bitbucket_server(.{format})
    ╰─ POST [803]

    /import/bitbucket_server/callback(.{format})
    ╰─ GET [801]

    /import/bitbucket_server/configure(.{format})
    ╰─ POST [802]

    /import/bitbucket_server/new(.{format})
    ╰─ GET [804]

    /import/bitbucket_server/realtime_changes(.{format})
    ╰─ GET [805]

    /import/bitbucket_server/status(.{format})
    ╰─ GET [806]

    /import/bulk_imports(.{format})
    ╰─ POST [808]

    /import/bulk_imports/configure(.{format})
    ╰─ POST [807]

    /import/bulk_imports/history(.{format})
    ╰─ GET [810]

    /import/bulk_imports/realtime_changes(.{format})
    ╰─ GET [812]

    /import/bulk_imports/status(.{format})
    ╰─ GET [813]

    /import/bulk_imports/{id}/history(.{format})
    ╰─ GET [811]

    /import/bulk_imports/{id}/history/{entity_id}/failures(.{format})
    ╰─ GET [809]

    /import/fogbugz(.{format})
    ╰─ POST [815]

    /import/fogbugz/callback(.{format})
    ╰─ POST [814]

    /import/fogbugz/new(.{format})
    ╰─ GET [817]

    /import/fogbugz/realtime_changes(.{format})
    ╰─ GET [819]

    /import/fogbugz/status(.{format})
    ╰─ GET [820]

    /import/fogbugz/user_map(.{format})
    ├─ GET [818]
    ╰─ POST [816]

    /import/gitea(.{format})
    ╰─ POST [821]

    /import/gitea/new(.{format})
    ╰─ GET [822]

    /import/gitea/personal_access_token(.{format})
    ╰─ POST [823]

    /import/gitea/realtime_changes(.{format})
    ╰─ GET [824]

    /import/gitea/status(.{format})
    ╰─ GET [825]

    /import/github(.{format})
    ╰─ POST [830]

    /import/github/callback(.{format})
    ╰─ GET [826]

    /import/github/cancel(.{format})
    ╰─ POST [827]

    /import/github/cancel_all(.{format})
    ╰─ POST [828]

    /import/github/counts(.{format})
    ╰─ GET [829]

    /import/github/details(.{format})
    ╰─ GET [831]

    /import/github/failures(.{format})
    ╰─ GET [832]

    /import/github/new(.{format})
    ╰─ GET [833]

    /import/github/personal_access_token(.{format})
    ╰─ POST [834]

    /import/github/realtime_changes(.{format})
    ╰─ GET [835]

    /import/github/status(.{format})
    ╰─ GET [836]

    /import/github_group/status(.{format})
    ╰─ GET [837]

    /import/gitlab_group(.{format})
    ╰─ POST [839]

    /import/gitlab_group/authorize(.{format})
    ╰─ POST [838]

    /import/gitlab_project(.{format})
    ╰─ POST [841]

    /import/gitlab_project/authorize(.{format})
    ╰─ POST [840]

    /import/gitlab_project/new(.{format})
    ╰─ GET [842]

    /import/history(.{format})
    ╰─ GET [843]

    /import/manifest(.{format})
    ╰─ POST [844]

    /import/manifest/new(.{format})
    ╰─ GET [845]

    /import/manifest/realtime_changes(.{format})
    ╰─ GET [846]

    /import/manifest/status(.{format})
    ╰─ GET [847]

    /import/manifest/upload(.{format})
    ╰─ POST [848]

    /import/source_users/{reassignment_token}(.{format})
    ╰─ GET [851]

    /import/source_users/{reassignment_token}/accept(.{format})
    ╰─ POST [849]

    /import/source_users/{reassignment_token}/decline(.{format})
    ╰─ POST [850]

    /import/url/validate(.{format})
    ╰─ POST [852]

    /jwt/auth(.{format})
    ├─ GET [883]
    ╰─ POST [2]

    /letteropenerweb_engine
    ╰─ GET [887]

    /letteropenerweb_engine/clear(.{format})
    ╰─ POST [885]

    /letteropenerweb_engine/{id}(/{style})(.{format})
    ╰─ GET [888]

    /letteropenerweb_engine/{id}/attachments/{file:0}(.{format})
    ╰─ GET [884]

    /letteropenerweb_engine/{id}/delete(.{format})
    ╰─ POST [886]

    /lookbook_engine
    ╰─ GET [889]

    /lookbook_engine/embed(.{format})
    ╰─ GET [891]

    /lookbook_engine/embed/{*path}(.{format})
    ╰─ GET [892]

    /lookbook_engine/inspect/{*path}(.{format})
    ╰─ GET [893]

    /lookbook_engine/pages(.{format})
    ╰─ GET [894]

    /lookbook_engine/pages/{*path}(.{format})
    ╰─ GET [895]

    /lookbook_engine/preview/{*path}(.{format})
    ╰─ GET [897]

    /lookbook_engine/previews(.{format})
    ╰─ GET [896]

    /lookbook_engine/{*path}(.{format})
    ╰─ GET [890]

    /oauth/applications(.{format})
    ├─ GET [906]
    ╰─ POST [902]

    /oauth/applications/new(.{format})
    ╰─ GET [907]

    /oauth/applications/{id}(.{format})
    ├─ DELETE [903]
    ├─ GET [909]
    ├─ PATCH [910]
    ╰─ PUT [911]

    /oauth/applications/{id}/edit(.{format})
    ╰─ GET [904]

    /oauth/applications/{id}/renew(.{format})
    ╰─ PUT [908]

    /oauth/authorize(.{format})
    ├─ DELETE [913]
    ├─ GET [914]
    ╰─ POST [912]

    /oauth/authorize/native(.{format})
    ╰─ GET [915]

    /oauth/authorize_device(.{format})
    ╰─ POST [921]

    /oauth/authorized_applications(.{format})
    ╰─ GET [917]

    /oauth/authorized_applications/{id}(.{format})
    ╰─ DELETE [916]

    /oauth/device(.{format})
    ├─ GET [920]
    ╰─ POST [918]

    /oauth/device/confirm(.{format})
    ╰─ POST [919]

    /oauth/discovery/keys(.{format})
    ├─ GET [876]
    ╰─ OPTIONS [877]

    /oauth/geo/auth(.{format})
    ╰─ GET [922]

    /oauth/geo/callback(.{format})
    ╰─ GET [923]

    /oauth/geo/logout(.{format})
    ╰─ GET [924]

    /oauth/introspect(.{format})
    ╰─ POST [928]

    /oauth/revoke(.{format})
    ├─ OPTIONS [929]
    ╰─ POST [930]

    /oauth/token(.{format})
    ├─ OPTIONS [926]
    ╰─ POST [927]

    /oauth/token/info(.{format})
    ╰─ GET [925]

    /oauth/userinfo(.{format})
    ├─ GET [350]
    ├─ OPTIONS [351]
    ╰─ POST [352]

    /peek_railtie/results(.{format})
    ╰─ GET [957]

    /projects(.{format})
    ├─ GET [1006]
    ╰─ POST [999]

    /projects/new(.{format})
    ╰─ GET [1007]

    /projects/{id}(.{format})
    ╰─ GET [1598]

    /public(.{format})
    ╰─ GET [359]

    /public/projects(.{format})
    ╰─ GET [360]

    /rails/info(.{format})
    ╰─ GET [1788]

    /rails/info/properties(.{format})
    ╰─ GET [1789]

    /rails/info/routes(.{format})
    ╰─ GET [1790]

    /rails/mailers(.{format})
    ╰─ GET [1791]

    /rails/mailers/{path}(.{format})
    ╰─ GET [1792]

    /search(.{format})
    ╰─ GET [1935]

    /search/aggregations(.{format})
    ╰─ GET [1930]

    /search/autocomplete(.{format})
    ╰─ GET [1931]

    /search/count(.{format})
    ╰─ GET [1932]

    /search/opensearch(.{format})
    ╰─ GET [1933]

    /search/settings(.{format})
    ╰─ GET [1934]

    /sitemap(.{format})
    ╰─ GET [1952]

    /snippets(/{*rest})(.{format})
    ├─ DELETE [1806]
    ├─ GET [1806]
    ├─ PATCH [1806]
    ╰─ POST [1806]

    /snippets/{id:3}/raw
    ╰─ GET [1962]

    /toogle_engine
    ╰─ GET [1977]

    /toogle_engine/definitions(.{format})
    ╰─ GET [1975]

    /toogle_engine/{id}(.{format})
    ├─ DELETE [1976]
    ├─ GET [1978]
    ├─ PATCH [1979]
    ╰─ PUT [1980]

    /unsubscribes/{email}(.{format})
    ├─ GET [2070]
    ╰─ POST [2069]

    /uploads/-/system/temp/{secret}/{filename:0}(.{format})
    ╰─ GET [1985]

    /uploads/-/system/{model:21}/{mounted_as:22}/{id}/{filename:0}(.{format})
    ╰─ GET [1986]

    /uploads/-/system/{model:23}/{mounted_as:24}/{id}/{filename:0}(.{format})
    ╰─ GET [1987]

    /uploads/-/system/{model:25}/{id:3}/{secret}/{filename:0}(.{format})
    ╰─ GET [1988]

    /uploads/-/system/{model:27}/{mounted_as:28}/{id}/{filename:26}(.{format})
    ╰─ GET [1989]

    /uploads/-/system/{model:29}/{mounted_as:22}/{id}/{filename:0}(.{format})
    ╰─ GET [1990]

    /uploads/-/system/{model:30}/{mounted_as:31}/{id}/{filename:0}(.{format})
    ╰─ GET [1991]

    /uploads/{model:25}(.{format})
    ╰─ POST [1984]

    /uploads/{model:25}/authorize(.{format})
    ╰─ POST [1983]

    /users(.{format})
    ├─ DELETE [1861]
    ├─ PATCH [1864]
    ├─ POST [1860]
    ╰─ PUT [1865]

    /users/almost_there(.{format})
    ╰─ GET [313]

    /users/auth(.{format})
    ╰─ GET [1801]

    /users/auth/geo/sign_in(.{format})
    ├─ GET [1947]
    ╰─ POST [1943]

    /users/auth/geo/sign_out(.{format})
    ╰─ POST [1945]

    /users/auth/kerberos/negotiate(.{format})
    ╰─ GET [931]

    /users/cancel(.{format})
    ╰─ GET [1859]

    /users/confirmation(.{format})
    ├─ GET [319]
    ╰─ POST [315]

    /users/confirmation/new(.{format})
    ╰─ GET [317]

    /users/edit(.{format})
    ╰─ GET [1862]

    /users/identity_verification(.{format})
    ╰─ GET [2057]

    /users/identity_verification/arkose_labs_challenge(.{format})
    ╰─ GET [2053]

    /users/identity_verification/resend_email_code(.{format})
    ╰─ POST [2054]

    /users/identity_verification/restricted(.{format})
    ╰─ GET [2055]

    /users/identity_verification/send_phone_verification_code(.{format})
    ╰─ POST [2056]

    /users/identity_verification/success(.{format})
    ╰─ GET [2058]

    /users/identity_verification/toggle_phone_exemption(.{format})
    ╰─ PATCH [2059]

    /users/identity_verification/verification_state(.{format})
    ╰─ GET [2060]

    /users/identity_verification/verify_arkose_labs_session(.{format})
    ╰─ POST [2061]

    /users/identity_verification/verify_credit_card(.{format})
    ╰─ GET [2062]

    /users/identity_verification/verify_credit_card_captcha(.{format})
    ╰─ POST [2063]

    /users/identity_verification/verify_email_code(.{format})
    ╰─ POST [2064]

    /users/identity_verification/verify_phone_verification_code(.{format})
    ╰─ POST [2065]

    /users/password(.{format})
    ├─ PATCH [955]
    ├─ POST [952]
    ╰─ PUT [956]

    /users/password/complexity(.{format})
    ╰─ POST [951]

    /users/password/edit(.{format})
    ╰─ GET [953]

    /users/password/new(.{format})
    ╰─ GET [954]

    /users/resend_verification_code(.{format})
    ╰─ POST [1949]

    /users/sign_in(.{format})
    ├─ GET [1948]
    ╰─ POST [1944]

    /users/sign_out(.{format})
    ╰─ POST [1946]

    /users/sign_up(.{format})
    ╰─ GET [1863]

    /users/sign_up/company(.{format})
    ╰─ POST [1866]

    /users/sign_up/company/new(.{format})
    ╰─ GET [1867]

    /users/sign_up/groups(.{format})
    ╰─ POST [1868]

    /users/sign_up/groups/new(.{format})
    ╰─ GET [1869]

    /users/sign_up/welcome(.{format})
    ├─ GET [1870]
    ├─ PATCH [1871]
    ╰─ PUT [1872]

    /users/successful_verification(.{format})
    ╰─ GET [1950]

    /users/unlock(.{format})
    ├─ GET [349]
    ╰─ POST [347]

    /users/unlock/new(.{format})
    ╰─ GET [348]

    /users/update_email(.{format})
    ╰─ PATCH [1951]

    /users/{username:35}(.{format})
    ╰─ GET [1844]

    /users/{username:35}/activity(.{format})
    ╰─ GET [2020]

    /users/{username:35}/available_group_templates(.{format})
    ╰─ GET [2021]

    /users/{username:35}/available_project_templates(.{format})
    ╰─ GET [2022]

    /users/{username:35}/calendar(.{format})
    ╰─ GET [2023]

    /users/{username:35}/calendar_activities(.{format})
    ╰─ GET [2024]

    /users/{username:35}/contributed(.{format})
    ╰─ GET [2025]

    /users/{username:35}/exists(.{format})
    ╰─ GET [2026]

    /users/{username:35}/follow(.{format})
    ╰─ POST [2027]

    /users/{username:35}/followers(.{format})
    ╰─ GET [2028]

    /users/{username:35}/following(.{format})
    ╰─ GET [2029]

    /users/{username:35}/groups(.{format})
    ╰─ GET [2031]

    /users/{username:35}/projects(.{format})
    ╰─ GET [2032]

    /users/{username:35}/snippets(.{format})
    ╰─ GET [2034]

    /users/{username:35}/starred(.{format})
    ╰─ GET [2036]

    /users/{username:35}/unfollow(.{format})
    ╰─ POST [2037]

    /v2
    ╰─ GET [495]

    /v2/{*group_id}/dependency_proxy/containers/{*image:19}/blobs/{sha:20}
    ╰─ GET [498]

    /v2/{*group_id}/dependency_proxy/containers/{*image:19}/blobs/{sha:20}/upload
    ╰─ POST [500]

    /v2/{*group_id}/dependency_proxy/containers/{*image:19}/blobs/{sha:20}/upload/authorize
    ╰─ POST [496]

    /v2/{*group_id}/dependency_proxy/containers/{*image:19}/manifests/{*tag}
    ╰─ GET [499]

    /v2/{*group_id}/dependency_proxy/containers/{*image:19}/manifests/{*tag}/upload
    ╰─ POST [501]

    /v2/{*group_id}/dependency_proxy/containers/{*image:19}/manifests/{*tag}/upload/authorize
    ╰─ POST [497]

    /{*id}(.{format:18})
    ├─ DELETE [392]
    ├─ GET [408]
    ├─ PATCH [411]
    ╰─ PUT [412]

    /{*namespace_id:2}/{id:4}(.{format})
    ├─ DELETE [1000]
    ├─ GET [1014]
    ├─ PATCH [1019]
    ╰─ PUT [1020]

    /{*namespace_id:2}/{id:4}/activity(.{format})
    ╰─ GET [997]

    /{*namespace_id:2}/{id:4}/archive(.{format})
    ╰─ POST [998]

    /{*namespace_id:2}/{id:4}/download_export(.{format})
    ╰─ GET [1001]

    /{*namespace_id:2}/{id:4}/edit(.{format})
    ╰─ GET [1002]

    /{*namespace_id:2}/{id:4}/export(.{format})
    ╰─ POST [1003]

    /{*namespace_id:2}/{id:4}/generate_new_export(.{format})
    ╰─ POST [1004]

    /{*namespace_id:2}/{id:4}/housekeeping(.{format})
    ╰─ POST [1005]

    /{*namespace_id:2}/{id:4}/new_issuable_address(.{format})
    ╰─ PUT [1008]

    /{*namespace_id:2}/{id:4}/refs(.{format})
    ╰─ GET [1010]

    /{*namespace_id:2}/{id:4}/remove_export(.{format})
    ╰─ POST [1011]

    /{*namespace_id:2}/{id:4}/remove_fork(.{format})
    ╰─ DELETE [1012]

    /{*namespace_id:2}/{id:4}/toggle_star(.{format})
    ╰─ POST [1015]

    /{*namespace_id:2}/{id:4}/transfer(.{format})
    ╰─ PUT [1016]

    /{*namespace_id:2}/{id:4}/unarchive(.{format})
    ╰─ POST [1017]

    /{*namespace_id:2}/{id:4}/unfoldered_environment_names(.{format})
    ╰─ GET [1018]

    /{*namespace_id:2}/{project_id:4}(.{format})
    ├─ DELETE [283]
    ├─ PATCH [286]
    ├─ POST [288]
    ╰─ PUT [290]

    /{*namespace_id:2}/{project_id:4}/-/alert_management(.{format})
    ╰─ GET [1023]

    /{*namespace_id:2}/{project_id:4}/-/alert_management/{id}(.{format})
    ╰─ GET [1021]

    /{*namespace_id:2}/{project_id:4}/-/alert_management/{id}/details(/{*page})(.{format})
    ╰─ GET [1022]

    /{*namespace_id:2}/{project_id:4}/-/analytics/code_reviews(.{format})
    ╰─ GET [1028]

    /{*namespace_id:2}/{project_id:4}/-/analytics/dashboards(/{*vueroute})
    ╰─ GET [1046]

    /{*namespace_id:2}/{project_id:4}/-/analytics/issues_analytics(.{format})
    ╰─ GET [1047]

    /{*namespace_id:2}/{project_id:4}/-/analytics/merge_request_analytics(.{format})
    ╰─ GET [1048]

    /{*namespace_id:2}/{project_id:4}/-/analytics/value_stream_analytics(.{format})
    ╰─ GET [1029]

    /{*namespace_id:2}/{project_id:4}/-/analytics/value_stream_analytics/summary(.{format})
    ╰─ GET [1036]

    /{*namespace_id:2}/{project_id:4}/-/analytics/value_stream_analytics/time_summary(.{format})
    ╰─ GET [1037]

    /{*namespace_id:2}/{project_id:4}/-/analytics/value_stream_analytics/value_streams(.{format})
    ├─ GET [1041]
    ╰─ POST [1038]

    /{*namespace_id:2}/{project_id:4}/-/analytics/value_stream_analytics/value_streams/new(.{format})
    ╰─ GET [1042]

    /{*namespace_id:2}/{project_id:4}/-/analytics/value_stream_analytics/value_streams/{id}(.{format})
    ├─ DELETE [1039]
    ├─ GET [1043]
    ├─ PATCH [1044]
    ╰─ PUT [1045]

    /{*namespace_id:2}/{project_id:4}/-/analytics/value_stream_analytics/value_streams/{id}/edit(.{format})
    ╰─ GET [1040]

    /{*namespace_id:2}/{project_id:4}/-/analytics/value_stream_analytics/value_streams/{value_stream_id}/stages(.{format})
    ╰─ GET [1033]

    /{*namespace_id:2}/{project_id:4}/-/analytics/value_stream_analytics/value_streams/{value_stream_id}/stages/{id}/average(.{format})
    ╰─ GET [1030]

    /{*namespace_id:2}/{project_id:4}/-/analytics/value_stream_analytics/value_streams/{value_stream_id}/stages/{id}/average_duration_chart(.{format})
    ╰─ GET [1031]

    /{*namespace_id:2}/{project_id:4}/-/analytics/value_stream_analytics/value_streams/{value_stream_id}/stages/{id}/count(.{format})
    ╰─ GET [1032]

    /{*namespace_id:2}/{project_id:4}/-/analytics/value_stream_analytics/value_streams/{value_stream_id}/stages/{id}/median(.{format})
    ╰─ GET [1034]

    /{*namespace_id:2}/{project_id:4}/-/analytics/value_stream_analytics/value_streams/{value_stream_id}/stages/{id}/records(.{format})
    ╰─ GET [1035]

    /{*namespace_id:2}/{project_id:4}/-/approver_groups/{id}(.{format})
    ╰─ DELETE [1049]

    /{*namespace_id:2}/{project_id:4}/-/approvers/{id}(.{format})
    ╰─ DELETE [1051]

    /{*namespace_id:2}/{project_id:4}/-/archive/{*id:33}.{format:36}
    ╰─ GET [1615]

    /{*namespace_id:2}/{project_id:4}/-/artifacts(.{format})
    ╰─ GET [1059]

    /{*namespace_id:2}/{project_id:4}/-/artifacts/{id}(.{format})
    ╰─ DELETE [1055]

    /{*namespace_id:2}/{project_id:4}/-/audit_events(.{format})
    ╰─ GET [1063]

    /{*namespace_id:2}/{project_id:4}/-/autocomplete_sources/commands(.{format})
    ╰─ GET [1064]

    /{*namespace_id:2}/{project_id:4}/-/autocomplete_sources/contacts(.{format})
    ╰─ GET [1065]

    /{*namespace_id:2}/{project_id:4}/-/autocomplete_sources/epics(.{format})
    ╰─ GET [1066]

    /{*namespace_id:2}/{project_id:4}/-/autocomplete_sources/issues(.{format})
    ╰─ GET [1067]

    /{*namespace_id:2}/{project_id:4}/-/autocomplete_sources/iterations(.{format})
    ╰─ GET [1068]

    /{*namespace_id:2}/{project_id:4}/-/autocomplete_sources/labels(.{format})
    ╰─ GET [1069]

    /{*namespace_id:2}/{project_id:4}/-/autocomplete_sources/members(.{format})
    ╰─ GET [1070]

    /{*namespace_id:2}/{project_id:4}/-/autocomplete_sources/merge_requests(.{format})
    ╰─ GET [1071]

    /{*namespace_id:2}/{project_id:4}/-/autocomplete_sources/milestones(.{format})
    ╰─ GET [1072]

    /{*namespace_id:2}/{project_id:4}/-/autocomplete_sources/snippets(.{format})
    ╰─ GET [1073]

    /{*namespace_id:2}/{project_id:4}/-/autocomplete_sources/vulnerabilities(.{format})
    ╰─ GET [1074]

    /{*namespace_id:2}/{project_id:4}/-/autocomplete_sources/wikis(.{format})
    ╰─ GET [1075]

    /{*namespace_id:2}/{project_id:4}/-/automations(.{format})
    ╰─ GET [1076]

    /{*namespace_id:2}/{project_id:4}/-/avatar(.{format})
    ├─ DELETE [1077]
    ╰─ GET [1078]

    /{*namespace_id:2}/{project_id:4}/-/aws(.{format})
    ╰─ GET [1836]

    /{*namespace_id:2}/{project_id:4}/-/aws/configuration(.{format})
    ╰─ GET [1079]

    /{*namespace_id:2}/{project_id:4}/-/badges/release(.{format:48})
    ╰─ GET [1083]

    /{*namespace_id:2}/{project_id:4}/-/blame/{*id:46}
    ╰─ GET [1085]

    /{*namespace_id:2}/{project_id:4}/-/blame/{*id:46}/streaming
    ╰─ GET [1087]

    /{*namespace_id:2}/{project_id:4}/-/blame_page/{*id:46}
    ╰─ GET [1084]

    /{*namespace_id:2}/{project_id:4}/-/blob/{*id:46}
    ├─ DELETE [1090]
    ├─ GET [1095]
    ├─ POST [1088]
    ╰─ PUT [1097]

    /{*namespace_id:2}/{project_id:4}/-/blob/{*id:46}/diff
    ╰─ GET [1091]

    /{*namespace_id:2}/{project_id:4}/-/boards(.{format})
    ╰─ GET [1099]

    /{*namespace_id:2}/{project_id:4}/-/boards/{id:3}(.{format})
    ╰─ GET [1100]

    /{*namespace_id:2}/{project_id:4}/-/branches
    ├─ GET [1105]
    ╰─ POST [1101]

    /{*namespace_id:2}/{project_id:4}/-/branches/diverging_commit_counts
    ╰─ GET [1104]

    /{*namespace_id:2}/{project_id:4}/-/branches/new
    ╰─ GET [1107]

    /{*namespace_id:2}/{project_id:4}/-/branches/{id:42}
    ╰─ DELETE [1102]

    /{*namespace_id:2}/{project_id:4}/-/branches/{state:45}
    ╰─ GET [1106]

    /{*namespace_id:2}/{project_id:4}/-/cadences(/{*vueroute})(.{format})
    ├─ GET [1318]
    ╰─ POST [1325]

    /{*namespace_id:2}/{project_id:4}/-/cadences(/{*vueroute})/new(.{format})
    ╰─ GET [1319]

    /{*namespace_id:2}/{project_id:4}/-/cadences(/{*vueroute})/{id}(.{format})
    ├─ DELETE [1317]
    ├─ GET [1320]
    ├─ PATCH [1324]
    ╰─ PUT [1326]

    /{*namespace_id:2}/{project_id:4}/-/cadences(/{*vueroute})/{id}/edit(.{format})
    ╰─ GET [1321]

    /{*namespace_id:2}/{project_id:4}/-/cadences(/{*vueroute})/{iteration_cadence_id}/iterations(.{format})
    ╰─ GET [1322]

    /{*namespace_id:2}/{project_id:4}/-/cadences(/{*vueroute})/{iteration_cadence_id}/iterations/{id:3}(.{format})
    ╰─ GET [1323]

    /{*namespace_id:2}/{project_id:4}/-/ci/daily_build_group_report_results(.{format:38})
    ╰─ GET [1116]

    /{*namespace_id:2}/{project_id:4}/-/ci/editor(.{format})
    ╰─ GET [1119]

    /{*namespace_id:2}/{project_id:4}/-/ci/lint(.{format})
    ├─ GET [1118]
    ╰─ POST [1117]

    /{*namespace_id:2}/{project_id:4}/-/ci/prometheus_metrics/histograms(.{format:37})
    ╰─ POST [1120]

    /{*namespace_id:2}/{project_id:4}/-/cluster_agents/{name}(.{format})
    ╰─ GET [1121]

    /{*namespace_id:2}/{project_id:4}/-/clusters(.{format})
    ╰─ GET [1128]

    /{*namespace_id:2}/{project_id:4}/-/clusters/connect(.{format})
    ╰─ GET [1124]

    /{*namespace_id:2}/{project_id:4}/-/clusters/create_user(.{format})
    ╰─ POST [1125]

    /{*namespace_id:2}/{project_id:4}/-/clusters/new_cluster_docs(.{format})
    ╰─ GET [1131]

    /{*namespace_id:2}/{project_id:4}/-/clusters/{cluster_id}/integration/create_or_update(.{format})
    ╰─ POST [1135]

    /{*namespace_id:2}/{project_id:4}/-/clusters/{id}(.{format})
    ├─ DELETE [1126]
    ├─ GET [1132]
    ├─ PATCH [1133]
    ╰─ PUT [1134]

    /{*namespace_id:2}/{project_id:4}/-/clusters/{id}/clear_cache(.{format})
    ╰─ DELETE [1122]

    /{*namespace_id:2}/{project_id:4}/-/clusters/{id}/cluster_status(.{format})
    ╰─ GET [1123]

    /{*namespace_id:2}/{project_id:4}/-/clusters/{id}/environments(.{format})
    ╰─ GET [1127]

    /{*namespace_id:2}/{project_id:4}/-/clusters/{id}/metrics(.{format})
    ╰─ GET [1129]

    /{*namespace_id:2}/{project_id:4}/-/clusters/{id}/metrics_dashboard(.{format})
    ╰─ GET [1130]

    /{*namespace_id:2}/{project_id:4}/-/comment_templates(.{format})
    ╰─ GET [1136]

    /{*namespace_id:2}/{project_id:4}/-/comment_templates/{id}(.{format})
    ╰─ GET [1137]

    /{*namespace_id:2}/{project_id:4}/-/commit/{id:47}(.{format})
    ╰─ GET [1145]

    /{*namespace_id:2}/{project_id:4}/-/commit/{id:47}/branches(.{format})
    ╰─ GET [1138]

    /{*namespace_id:2}/{project_id:4}/-/commit/{id:47}/cherry_pick(.{format})
    ╰─ POST [1139]

    /{*namespace_id:2}/{project_id:4}/-/commit/{id:47}/diff_files(.{format})
    ╰─ GET [1140]

    /{*namespace_id:2}/{project_id:4}/-/commit/{id:47}/diff_for_path(.{format})
    ╰─ GET [1141]

    /{*namespace_id:2}/{project_id:4}/-/commit/{id:47}/diffs_stream(.{format})
    ╰─ GET [1146]

    /{*namespace_id:2}/{project_id:4}/-/commit/{id:47}/merge_requests(.{format})
    ╰─ GET [1142]

    /{*namespace_id:2}/{project_id:4}/-/commit/{id:47}/pipelines(.{format})
    ╰─ GET [1143]

    /{*namespace_id:2}/{project_id:4}/-/commit/{id:47}/revert(.{format})
    ╰─ POST [1144]

    /{*namespace_id:2}/{project_id:4}/-/commits
    ╰─ GET [1147]

    /{*namespace_id:2}/{project_id:4}/-/commits/{*id:46}
    ╰─ GET [1148]

    /{*namespace_id:2}/{project_id:4}/-/commits/{*id:46}/signatures
    ╰─ GET [1149]

    /{*namespace_id:2}/{project_id:4}/-/compare
    ├─ GET [1152]
    ╰─ POST [1150]

    /{*namespace_id:2}/{project_id:4}/-/compare/diff_for_path
    ╰─ GET [1151]

    /{*namespace_id:2}/{project_id:4}/-/compare/diffs_stream
    ╰─ GET [1158]

    /{*namespace_id:2}/{project_id:4}/-/compare/signatures
    ╰─ GET [1157]

    /{*namespace_id:2}/{project_id:4}/-/compare/{from:26}...{to:26}
    ╰─ GET [1155]

    /{*namespace_id:2}/{project_id:4}/-/compare/{from:26}..{to:26}
    ╰─ GET [1156]

    /{*namespace_id:2}/{project_id:4}/-/compare/{from}...{to}
    ╰─ GET [1153]

    /{*namespace_id:2}/{project_id:4}/-/compare/{from}..{to}
    ╰─ GET [1154]

    /{*namespace_id:2}/{project_id:4}/-/create/{*id:46}
    ╰─ POST [1089]

    /{*namespace_id:2}/{project_id:4}/-/create_dir/{*id:46}
    ╰─ POST [1742]

    /{*namespace_id:2}/{project_id:4}/-/cycle_analytics(.{format})
    ╰─ GET [1843]

    /{*namespace_id:2}/{project_id:4}/-/dependencies(.{format})
    ╰─ GET [1168]

    /{*namespace_id:2}/{project_id:4}/-/dependencies/licenses(.{format})
    ╰─ GET [1169]

    /{*namespace_id:2}/{project_id:4}/-/deploy_keys(.{format})
    ├─ GET [1177]
    ╰─ POST [1172]

    /{*namespace_id:2}/{project_id:4}/-/deploy_keys/available_project_keys(.{format})
    ╰─ GET [1170]

    /{*namespace_id:2}/{project_id:4}/-/deploy_keys/available_public_keys(.{format})
    ╰─ GET [1171]

    /{*namespace_id:2}/{project_id:4}/-/deploy_keys/enabled_keys(.{format})
    ╰─ GET [1176]

    /{*namespace_id:2}/{project_id:4}/-/deploy_keys/new(.{format})
    ╰─ GET [1178]

    /{*namespace_id:2}/{project_id:4}/-/deploy_keys/{id:3}(.{format})
    ├─ PATCH [1179]
    ╰─ PUT [1180]

    /{*namespace_id:2}/{project_id:4}/-/deploy_keys/{id:3}/disable(.{format})
    ╰─ PUT [1173]

    /{*namespace_id:2}/{project_id:4}/-/deploy_keys/{id:3}/edit(.{format})
    ╰─ GET [1174]

    /{*namespace_id:2}/{project_id:4}/-/deploy_keys/{id:3}/enable(.{format})
    ╰─ PUT [1175]

    /{*namespace_id:2}/{project_id:4}/-/deploy_tokens/{id:3}/revoke(.{format})
    ╰─ PUT [1181]

    /{*namespace_id:2}/{project_id:4}/-/design_management/designs/{design_id}(/{sha})/raw_image(.{format})
    ╰─ GET [1186]

    /{*namespace_id:2}/{project_id:4}/-/design_management/designs/{design_id}(/{sha})/resized_image/{id}(.{format})
    ╰─ GET [1187]

    /{*namespace_id:2}/{project_id:4}/-/edit/{*id:46}
    ╰─ GET [1092]

    /{*namespace_id:2}/{project_id:4}/-/environments(.{format})
    ├─ GET [1195]
    ╰─ POST [1192]

    /{*namespace_id:2}/{project_id:4}/-/environments/folders/{*id}(.{format:13})
    ╰─ GET [1194]

    /{*namespace_id:2}/{project_id:4}/-/environments/new(.{format})
    ╰─ GET [1197]

    /{*namespace_id:2}/{project_id:4}/-/environments/search(.{format})
    ╰─ GET [1198]

    /{*namespace_id:2}/{project_id:4}/-/environments/{environment_id}/deployments(.{format})
    ╰─ GET [1183]

    /{*namespace_id:2}/{project_id:4}/-/environments/{environment_id}/deployments/{id}(.{format})
    ╰─ GET [1185]

    /{*namespace_id:2}/{project_id:4}/-/environments/{environment_id}/deployments/{id}/additional_metrics(.{format})
    ╰─ GET [1182]

    /{*namespace_id:2}/{project_id:4}/-/environments/{environment_id}/deployments/{id}/metrics(.{format})
    ╰─ GET [1184]

    /{*namespace_id:2}/{project_id:4}/-/environments/{id}(.{format})
    ├─ GET [1199]
    ├─ PATCH [1203]
    ╰─ PUT [1204]

    /{*namespace_id:2}/{project_id:4}/-/environments/{id}/cancel_auto_stop(.{format})
    ╰─ POST [1191]

    /{*namespace_id:2}/{project_id:4}/-/environments/{id}/edit(.{format})
    ╰─ GET [1193]

    /{*namespace_id:2}/{project_id:4}/-/environments/{id}/k8s(/{*vueroute})(.{format})
    ╰─ GET [1196]

    /{*namespace_id:2}/{project_id:4}/-/environments/{id}/prometheus/api/v1/{*proxy_path}(.{format})
    ╰─ GET [1205]

    /{*namespace_id:2}/{project_id:4}/-/environments/{id}/stop(.{format})
    ╰─ POST [1200]

    /{*namespace_id:2}/{project_id:4}/-/environments/{id}/terminal(.{format})
    ╰─ GET [1201]

    /{*namespace_id:2}/{project_id:4}/-/environments/{id}/terminal.ws/authorize
    ╰─ GET [1202]

    /{*namespace_id:2}/{project_id:4}/-/error_tracking(.{format})
    ╰─ GET [1207]

    /{*namespace_id:2}/{project_id:4}/-/error_tracking/projects(.{format})
    ╰─ GET [1209]

    /{*namespace_id:2}/{project_id:4}/-/error_tracking/{issue_id}(.{format})
    ╰─ PUT [1208]

    /{*namespace_id:2}/{project_id:4}/-/error_tracking/{issue_id}/details(.{format})
    ╰─ GET [1206]

    /{*namespace_id:2}/{project_id:4}/-/error_tracking/{issue_id}/stack_trace(.{format})
    ╰─ GET [1210]

    /{*namespace_id:2}/{project_id:4}/-/escalation_policies(.{format})
    ╰─ GET [1271]

    /{*namespace_id:2}/{project_id:4}/-/feature_flags(.{format})
    ├─ GET [1217]
    ╰─ POST [1214]

    /{*namespace_id:2}/{project_id:4}/-/feature_flags/new(.{format})
    ╰─ GET [1218]

    /{*namespace_id:2}/{project_id:4}/-/feature_flags/{feature_flag_iid}/issues(.{format})
    ├─ GET [1213]
    ╰─ POST [1211]

    /{*namespace_id:2}/{project_id:4}/-/feature_flags/{feature_flag_iid}/issues/{id}(.{format})
    ╰─ DELETE [1212]

    /{*namespace_id:2}/{project_id:4}/-/feature_flags/{iid}(.{format})
    ├─ DELETE [1215]
    ├─ GET [1219]
    ├─ PATCH [1220]
    ╰─ PUT [1221]

    /{*namespace_id:2}/{project_id:4}/-/feature_flags/{iid}/edit(.{format})
    ╰─ GET [1216]

    /{*namespace_id:2}/{project_id:4}/-/feature_flags_client/reset_token(.{format})
    ╰─ POST [1222]

    /{*namespace_id:2}/{project_id:4}/-/feature_flags_user_lists(.{format})
    ╰─ GET [1224]

    /{*namespace_id:2}/{project_id:4}/-/feature_flags_user_lists/new(.{format})
    ╰─ GET [1225]

    /{*namespace_id:2}/{project_id:4}/-/feature_flags_user_lists/{iid}(.{format})
    ╰─ GET [1226]

    /{*namespace_id:2}/{project_id:4}/-/feature_flags_user_lists/{iid}/edit(.{format})
    ╰─ GET [1223]

    /{*namespace_id:2}/{project_id:4}/-/files/{*id:46}
    ╰─ GET [1227]

    /{*namespace_id:2}/{project_id:4}/-/find_file/{*id:46}
    ╰─ GET [1228]

    /{*namespace_id:2}/{project_id:4}/-/forks(.{format})
    ├─ GET [1230]
    ╰─ POST [1229]

    /{*namespace_id:2}/{project_id:4}/-/forks/new(.{format})
    ╰─ GET [1231]

    /{*namespace_id:2}/{project_id:4}/-/google_cloud(.{format})
    ╰─ GET [1838]

    /{*namespace_id:2}/{project_id:4}/-/google_cloud/artifact_registry(.{format})
    ╰─ GET [1232]

    /{*namespace_id:2}/{project_id:4}/-/google_cloud/artifact_registry/projects/{project}/locations/{location}/repositories/{repository}/dockerImages/{image}(.{format})
    ╰─ GET [1233]

    /{*namespace_id:2}/{project_id:4}/-/google_cloud/configuration(.{format})
    ╰─ GET [1234]

    /{*namespace_id:2}/{project_id:4}/-/google_cloud/databases(.{format})
    ├─ GET [1236]
    ╰─ POST [1235]

    /{*namespace_id:2}/{project_id:4}/-/google_cloud/databases/new/{product}(.{format})
    ╰─ GET [1237]

    /{*namespace_id:2}/{project_id:4}/-/google_cloud/deployments(.{format})
    ╰─ GET [1240]

    /{*namespace_id:2}/{project_id:4}/-/google_cloud/deployments/cloud_run(.{format})
    ╰─ GET [1238]

    /{*namespace_id:2}/{project_id:4}/-/google_cloud/deployments/cloud_storage(.{format})
    ╰─ GET [1239]

    /{*namespace_id:2}/{project_id:4}/-/google_cloud/gcp_regions(.{format})
    ├─ GET [1242]
    ╰─ POST [1241]

    /{*namespace_id:2}/{project_id:4}/-/google_cloud/revoke_oauth(.{format})
    ╰─ POST [1243]

    /{*namespace_id:2}/{project_id:4}/-/google_cloud/service_accounts(.{format})
    ├─ GET [1245]
    ╰─ POST [1244]

    /{*namespace_id:2}/{project_id:4}/-/graphs/{id:42}
    ╰─ GET [1250]

    /{*namespace_id:2}/{project_id:4}/-/graphs/{id:42}/charts
    ╰─ GET [1246]

    /{*namespace_id:2}/{project_id:4}/-/graphs/{id:42}/ci
    ╰─ GET [1247]

    /{*namespace_id:2}/{project_id:4}/-/graphs/{id:42}/commits
    ╰─ GET [1248]

    /{*namespace_id:2}/{project_id:4}/-/graphs/{id:42}/languages
    ╰─ GET [1249]

    /{*namespace_id:2}/{project_id:4}/-/group_links/{id:16}(.{format})
    ├─ DELETE [1251]
    ├─ PATCH [1252]
    ╰─ PUT [1253]

    /{*namespace_id:2}/{project_id:4}/-/harbor/repositories(.{format})
    ╰─ GET [1255]

    /{*namespace_id:2}/{project_id:4}/-/harbor/repositories/{id:17}(.{format})
    ╰─ GET [1256]

    /{*namespace_id:2}/{project_id:4}/-/harbor/repositories/{repository_id:17}/artifacts(.{format})
    ╰─ GET [1254]

    /{*namespace_id:2}/{project_id:4}/-/harbor/repositories/{repository_id:17}/artifacts/{artifact_id:17}/tags(.{format})
    ╰─ GET [1257]

    /{*namespace_id:2}/{project_id:4}/-/hooks(.{format})
    ├─ GET [1263]
    ╰─ POST [1260]

    /{*namespace_id:2}/{project_id:4}/-/hooks/{hook_id:3}/hook_logs/{id:3}(.{format})
    ╰─ GET [1259]

    /{*namespace_id:2}/{project_id:4}/-/hooks/{hook_id:3}/hook_logs/{id:3}/retry(.{format})
    ╰─ POST [1258]

    /{*namespace_id:2}/{project_id:4}/-/hooks/{id:3}(.{format})
    ├─ DELETE [1261]
    ├─ PATCH [1265]
    ╰─ PUT [1266]

    /{*namespace_id:2}/{project_id:4}/-/hooks/{id:3}/edit(.{format})
    ╰─ GET [1262]

    /{*namespace_id:2}/{project_id:4}/-/hooks/{id:3}/test(.{format})
    ╰─ POST [1264]

    /{*namespace_id:2}/{project_id:4}/-/import(.{format})
    ├─ GET [1270]
    ╰─ POST [1268]

    /{*namespace_id:2}/{project_id:4}/-/import/jira(.{format})
    ╰─ GET [1267]

    /{*namespace_id:2}/{project_id:4}/-/import/new(.{format})
    ╰─ GET [1269]

    /{*namespace_id:2}/{project_id:4}/-/incident_management/timeline_events/preview_markdown(.{format})
    ╰─ POST [1274]

    /{*namespace_id:2}/{project_id:4}/-/incidents(.{format})
    ╰─ GET [1275]

    /{*namespace_id:2}/{project_id:4}/-/incidents/integrations/pagerduty(.{format})
    ╰─ POST [1273]

    /{*namespace_id:2}/{project_id:4}/-/infrastructure_registry(.{format})
    ╰─ GET [1842]

    /{*namespace_id:2}/{project_id:4}/-/integrations/jira/issues(.{format})
    ╰─ GET [1279]

    /{*namespace_id:2}/{project_id:4}/-/integrations/jira/issues/{id}(.{format})
    ╰─ GET [1280]

    /{*namespace_id:2}/{project_id:4}/-/integrations/slash_commands(.{format})
    ╰─ GET [1282]

    /{*namespace_id:2}/{project_id:4}/-/integrations/slash_commands/confirm(.{format})
    ╰─ POST [1281]

    /{*namespace_id:2}/{project_id:4}/-/integrations/zentao/issues(.{format})
    ╰─ GET [1283]

    /{*namespace_id:2}/{project_id:4}/-/integrations/zentao/issues/{id}(.{format})
    ╰─ GET [1284]

    /{*namespace_id:2}/{project_id:4}/-/issues(.{format})
    ├─ GET [1303]
    ╰─ POST [1293]

    /{*namespace_id:2}/{project_id:4}/-/issues.ics
    ╰─ GET [1291]

    /{*namespace_id:2}/{project_id:4}/-/issues/bulk_update(.{format})
    ╰─ POST [1290]

    /{*namespace_id:2}/{project_id:4}/-/issues/export_csv(.{format})
    ╰─ POST [1301]

    /{*namespace_id:2}/{project_id:4}/-/issues/import_csv(.{format})
    ╰─ POST [1302]

    /{*namespace_id:2}/{project_id:4}/-/issues/incident/{id:3}(/{incident_tab:41})(.{format})
    ╰─ GET [1276]

    /{*namespace_id:2}/{project_id:4}/-/issues/new(.{format})
    ╰─ GET [1306]

    /{*namespace_id:2}/{project_id:4}/-/issues/service_desk(.{format})
    ╰─ GET [1310]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}(.{format})
    ├─ DELETE [1298]
    ├─ GET [1311]
    ├─ PATCH [1315]
    ╰─ PUT [1316]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/can_create_branch(.{format})
    ╰─ GET [1292]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/create_merge_request(.{format})
    ╰─ POST [1294]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/descriptions/{version_id}(.{format})
    ╰─ DELETE [1295]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/descriptions/{version_id}/diff(.{format})
    ╰─ GET [1296]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/designs(/{*vueroute})
    ╰─ GET [1297]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/discussions(.{format})
    ╰─ GET [1299]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/edit(.{format})
    ╰─ GET [1300]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/mark_as_spam(.{format})
    ╰─ POST [1304]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/move(.{format})
    ╰─ POST [1305]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/realtime_changes(.{format})
    ╰─ GET [1307]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/related_branches(.{format})
    ╰─ GET [1308]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/reorder(.{format})
    ╰─ PUT [1309]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/toggle_award_emoji(.{format})
    ╰─ POST [1313]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/toggle_subscription(.{format})
    ╰─ POST [1314]

    /{*namespace_id:2}/{project_id:4}/-/issues/{id:3}/{incident_tab:41}(.{format})
    ╰─ GET [1312]

    /{*namespace_id:2}/{project_id:4}/-/issues/{issue_id:3}/feature_flags(.{format})
    ╰─ GET [1285]

    /{*namespace_id:2}/{project_id:4}/-/issues/{issue_id:3}/feature_flags/{id:3}(.{format})
    ╰─ GET [1286]

    /{*namespace_id:2}/{project_id:4}/-/issues/{issue_id:3}/links(.{format})
    ├─ GET [1289]
    ╰─ POST [1287]

    /{*namespace_id:2}/{project_id:4}/-/issues/{issue_id:3}/links/{id:3}(.{format})
    ╰─ DELETE [1288]

    /{*namespace_id:2}/{project_id:4}/-/iterations(.{format})
    ╰─ GET [1327]

    /{*namespace_id:2}/{project_id:4}/-/iterations/{id:3}(.{format})
    ╰─ GET [1328]

    /{*namespace_id:2}/{project_id:4}/-/jobs(.{format})
    ╰─ GET [1331]

    /{*namespace_id:2}/{project_id:4}/-/jobs/artifacts/{*ref_name_and_path}
    ╰─ GET [1061]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}(.{format})
    ╰─ GET [1337]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}/cancel(.{format})
    ╰─ POST [1329]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}/erase(.{format})
    ╰─ POST [1330]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}/play(.{format})
    ╰─ POST [1332]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}/proxy(.{format})
    ╰─ GET [1333]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}/proxy.ws/authorize
    ╰─ GET [1334]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}/raw(.{format})
    ╰─ GET [1335]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}/retry(.{format})
    ╰─ POST [1336]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}/status(.{format})
    ╰─ GET [1338]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}/terminal(.{format})
    ╰─ GET [1339]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}/terminal.ws/authorize
    ╰─ GET [1340]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}/test_report_summary(.{format})
    ╰─ GET [1341]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}/trace(.{format:37})
    ╰─ GET [1342]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}/unschedule(.{format})
    ╰─ POST [1343]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{id:3}/viewer(.{format})
    ╰─ GET [1344]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{job_id:3}/artifacts/browse(/{*path})
    ╰─ GET [1054]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{job_id:3}/artifacts/download(.{format})
    ╰─ GET [1056]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{job_id:3}/artifacts/external_file/{*path}
    ╰─ GET [1057]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{job_id:3}/artifacts/file/{*path}
    ╰─ GET [1058]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{job_id:3}/artifacts/keep(.{format})
    ╰─ POST [1060]

    /{*namespace_id:2}/{project_id:4}/-/jobs/{job_id:3}/artifacts/raw/{*path}
    ╰─ GET [1062]

    /{*namespace_id:2}/{project_id:4}/-/labels(.{format})
    ├─ GET [1349]
    ╰─ POST [1345]

    /{*namespace_id:2}/{project_id:4}/-/labels/generate(.{format})
    ╰─ POST [1348]

    /{*namespace_id:2}/{project_id:4}/-/labels/new(.{format})
    ╰─ GET [1350]

    /{*namespace_id:2}/{project_id:4}/-/labels/set_priorities(.{format})
    ╰─ POST [1353]

    /{*namespace_id:2}/{project_id:4}/-/labels/{id:3}(.{format})
    ├─ DELETE [1346]
    ├─ PATCH [1355]
    ╰─ PUT [1356]

    /{*namespace_id:2}/{project_id:4}/-/labels/{id:3}/edit(.{format})
    ╰─ GET [1347]

    /{*namespace_id:2}/{project_id:4}/-/labels/{id:3}/promote(.{format})
    ╰─ POST [1351]

    /{*namespace_id:2}/{project_id:4}/-/labels/{id:3}/remove_priority(.{format})
    ╰─ DELETE [1352]

    /{*namespace_id:2}/{project_id:4}/-/labels/{id:3}/toggle_subscription(.{format})
    ╰─ POST [1354]

    /{*namespace_id:2}/{project_id:4}/-/learn_gitlab(.{format})
    ╰─ GET [1358]

    /{*namespace_id:2}/{project_id:4}/-/learn_gitlab/end_tutorial(.{format})
    ╰─ GET [1357]

    /{*namespace_id:2}/{project_id:4}/-/logs(.{format})
    ╰─ GET [1359]

    /{*namespace_id:2}/{project_id:4}/-/mattermost(.{format})
    ╰─ POST [1360]

    /{*namespace_id:2}/{project_id:4}/-/mattermost/new(.{format})
    ╰─ GET [1361]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests(.{format})
    ├─ GET [1387]
    ╰─ POST [1416]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/bulk_update(.{format})
    ╰─ POST [1365]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/diff_for_path(.{format})
    ╰─ GET [1381]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/export_csv(.{format})
    ╰─ POST [1385]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/new(.{format})
    ╰─ GET [1419]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/new/branch_from(.{format})
    ╰─ GET [1414]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/new/branch_to(.{format})
    ╰─ GET [1415]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/new/diff_for_path(.{format})
    ╰─ GET [1417]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/new/diffs(.{format})
    ╰─ GET [1420]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/new/diffs.json
    ╰─ GET [1418]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/new/pipelines(.{format})
    ╰─ GET [1421]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/new/pipelines.json
    ╰─ GET [1422]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/new/target_projects(.{format})
    ╰─ GET [1423]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}(.{format})
    ├─ DELETE [1380]
    ├─ GET [1400]
    ├─ PATCH [1407]
    ╰─ PUT [1408]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/accessibility_reports(.{format})
    ╰─ GET [1362]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/api_fuzzing_reports(.{format})
    ╰─ GET [1363]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/assign_related_issues(.{format})
    ╰─ POST [1364]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/cached_widget(.{format})
    ╰─ GET [1412]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/cancel_auto_merge(.{format})
    ╰─ POST [1366]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/ci_environments_status(.{format})
    ╰─ GET [1367]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/codequality_mr_diff_reports(.{format})
    ╰─ GET [1368]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/codequality_reports(.{format})
    ╰─ GET [1369]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/commit_change_content(.{format})
    ╰─ GET [1370]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/commits(.{format})
    ╰─ GET [1401]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/commits.json
    ╰─ GET [1371]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/conflict_for_path(.{format})
    ╰─ GET [1409]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/conflicts(.{format})
    ╰─ GET [1411]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/container_scanning_reports(.{format})
    ╰─ GET [1372]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/context_commits(.{format})
    ╰─ GET [1373]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/coverage_fuzzing_reports(.{format})
    ╰─ GET [1374]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/coverage_reports(.{format})
    ╰─ GET [1375]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/dast_reports(.{format})
    ╰─ GET [1376]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/dependency_scanning_reports(.{format})
    ╰─ GET [1378]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/descriptions/{version_id}(.{format})
    ╰─ DELETE [1377]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/descriptions/{version_id}/diff(.{format})
    ╰─ GET [1379]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/diff_by_file_hash/{file_hash}(.{format})
    ╰─ GET [1424]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/diff_for_path(.{format})
    ╰─ GET [1429]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/diff_for_path.json
    ╰─ GET [1425]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/diffs(.{format})
    ╰─ GET [1382]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/diffs.json
    ╰─ GET [1428]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/diffs_batch(.{format})
    ╰─ GET [1426]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/diffs_metadata(.{format})
    ╰─ GET [1427]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/diffs_stream(.{format})
    ╰─ GET [1430]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/discussions(.{format})
    ╰─ GET [1383]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/edit(.{format})
    ╰─ GET [1384]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/exposed_artifacts(.{format})
    ╰─ GET [1386]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/license_scanning_reports(.{format})
    ╰─ GET [1388]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/license_scanning_reports_collapsed(.{format})
    ╰─ GET [1389]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/merge(.{format})
    ╰─ POST [1390]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/metrics_reports(.{format})
    ╰─ GET [1391]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/pipeline_status(.{format})
    ╰─ GET [1392]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/pipelines(.{format})
    ╰─ GET [1402]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/pipelines.json
    ╰─ GET [1393]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/rebase(.{format})
    ╰─ POST [1394]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/remove_wip(.{format})
    ╰─ POST [1395]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/reports(.{format})
    ╰─ GET [1396]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/resolve_conflicts(.{format})
    ╰─ POST [1410]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/saml_approval(.{format})
    ╰─ GET [1438]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/sast_reports(.{format})
    ╰─ GET [1397]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/secret_detection_reports(.{format})
    ╰─ GET [1398]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/security_reports(.{format})
    ╰─ GET [1399]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/terraform_reports(.{format})
    ╰─ GET [1403]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/test_reports(.{format})
    ╰─ GET [1404]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/toggle_award_emoji(.{format})
    ╰─ POST [1405]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/toggle_subscription(.{format})
    ╰─ POST [1406]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{id:3}/widget(.{format})
    ╰─ GET [1413]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{merge_request_id:3}/approver_groups/{id:3}(.{format})
    ╰─ DELETE [1050]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{merge_request_id:3}/approvers(.{format})
    ╰─ DELETE [1053]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{merge_request_id:3}/approvers/{id:3}(.{format})
    ╰─ DELETE [1052]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{merge_request_id:3}/drafts(.{format})
    ├─ GET [1434]
    ╰─ POST [1431]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{merge_request_id:3}/drafts/discard(.{format})
    ╰─ DELETE [1433]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{merge_request_id:3}/drafts/publish(.{format})
    ╰─ POST [1435]

    /{*namespace_id:2}/{project_id:4}/-/merge_requests/{merge_request_id:3}/drafts/{id:3}(.{format})
    ├─ DELETE [1432]
    ├─ PATCH [1436]
    ╰─ PUT [1437]

    /{*namespace_id:2}/{project_id:4}/-/merge_trains(.{format})
    ╰─ GET [1439]

    /{*namespace_id:2}/{project_id:4}/-/merged_branches
    ╰─ DELETE [1103]

    /{*namespace_id:2}/{project_id:4}/-/metrics(.{format})
    ╰─ GET [1440]

    /{*namespace_id:2}/{project_id:4}/-/metrics/{id:0}(.{format})
    ╰─ GET [1441]

    /{*namespace_id:2}/{project_id:4}/-/milestones(.{format})
    ├─ GET [1445]
    ╰─ POST [1442]

    /{*namespace_id:2}/{project_id:4}/-/milestones/new(.{format})
    ╰─ GET [1449]

    /{*namespace_id:2}/{project_id:4}/-/milestones/{id:3}(.{format})
    ├─ DELETE [1443]
    ├─ GET [1452]
    ├─ PATCH [1453]
    ╰─ PUT [1454]

    /{*namespace_id:2}/{project_id:4}/-/milestones/{id:3}/edit(.{format})
    ╰─ GET [1444]

    /{*namespace_id:2}/{project_id:4}/-/milestones/{id:3}/issues(.{format})
    ╰─ GET [1446]

    /{*namespace_id:2}/{project_id:4}/-/milestones/{id:3}/labels(.{format})
    ╰─ GET [1447]

    /{*namespace_id:2}/{project_id:4}/-/milestones/{id:3}/merge_requests(.{format})
    ╰─ GET [1448]

    /{*namespace_id:2}/{project_id:4}/-/milestones/{id:3}/participants(.{format})
    ╰─ GET [1450]

    /{*namespace_id:2}/{project_id:4}/-/milestones/{id:3}/promote(.{format})
    ╰─ POST [1451]

    /{*namespace_id:2}/{project_id:4}/-/mirror(.{format})
    ├─ GET [1455]
    ├─ PATCH [1457]
    ╰─ PUT [1458]

    /{*namespace_id:2}/{project_id:4}/-/mirror/ssh_host_keys(.{format:37})
    ╰─ GET [1456]

    /{*namespace_id:2}/{project_id:4}/-/mirror/update_now(.{format})
    ╰─ POST [1459]

    /{*namespace_id:2}/{project_id:4}/-/ml/agents(/{*vueroute})(.{format})
    ├─ GET [1462]
    ╰─ POST [1467]

    /{*namespace_id:2}/{project_id:4}/-/ml/agents(/{*vueroute})/new(.{format})
    ╰─ GET [1463]

    /{*namespace_id:2}/{project_id:4}/-/ml/agents(/{*vueroute})/{id}(.{format})
    ├─ DELETE [1461]
    ├─ GET [1464]
    ├─ PATCH [1466]
    ╰─ PUT [1468]

    /{*namespace_id:2}/{project_id:4}/-/ml/agents(/{*vueroute})/{id}/edit(.{format})
    ╰─ GET [1465]

    /{*namespace_id:2}/{project_id:4}/-/ml/candidates/{iid}(.{format})
    ├─ DELETE [1469]
    ╰─ GET [1470]

    /{*namespace_id:2}/{project_id:4}/-/ml/experiments(.{format})
    ╰─ GET [1472]

    /{*namespace_id:2}/{project_id:4}/-/ml/experiments/{iid}(.{format})
    ├─ DELETE [1471]
    ╰─ GET [1473]

    /{*namespace_id:2}/{project_id:4}/-/ml/models(.{format})
    ╰─ GET [1479]

    /{*namespace_id:2}/{project_id:4}/-/ml/models/new(.{format})
    ╰─ GET [1480]

    /{*namespace_id:2}/{project_id:4}/-/ml/models/{model_id}(.{format})
    ├─ DELETE [1477]
    ╰─ GET [1481]

    /{*namespace_id:2}/{project_id:4}/-/ml/models/{model_id}/edit(.{format})
    ╰─ GET [1478]

    /{*namespace_id:2}/{project_id:4}/-/ml/models/{model_model_id}/versions/new(.{format})
    ╰─ GET [1475]

    /{*namespace_id:2}/{project_id:4}/-/ml/models/{model_model_id}/versions/{model_version_id}(.{format})
    ╰─ GET [1476]

    /{*namespace_id:2}/{project_id:4}/-/ml/models/{model_model_id}/versions/{model_version_id}/edit(.{format})
    ╰─ GET [1474]

    /{*namespace_id:2}/{project_id:4}/-/ml/preview_markdown(.{format})
    ╰─ POST [1460]

    /{*namespace_id:2}/{project_id:4}/-/network/{id:42}
    ╰─ GET [1482]

    /{*namespace_id:2}/{project_id:4}/-/new/{*id:46}
    ╰─ GET [1093]

    /{*namespace_id:2}/{project_id:4}/-/on_demand_scans(.{format})
    ╰─ GET [1494]

    /{*namespace_id:2}/{project_id:4}/-/on_demand_scans/new(.{format})
    ╰─ GET [1495]

    /{*namespace_id:2}/{project_id:4}/-/on_demand_scans/{id}/edit(.{format})
    ╰─ GET [1493]

    /{*namespace_id:2}/{project_id:4}/-/oncall_schedules(.{format})
    ╰─ GET [1272]

    /{*namespace_id:2}/{project_id:4}/-/package_files/{id}/download(.{format})
    ╰─ GET [1498]

    /{*namespace_id:2}/{project_id:4}/-/packages(.{format})
    ╰─ GET [1500]

    /{*namespace_id:2}/{project_id:4}/-/packages/{id}(.{format})
    ├─ DELETE [1499]
    ╰─ GET [1501]

    /{*namespace_id:2}/{project_id:4}/-/pipeline_schedules(.{format})
    ├─ GET [1523]
    ╰─ POST [1520]

    /{*namespace_id:2}/{project_id:4}/-/pipeline_schedules/new(.{format})
    ╰─ GET [1524]

    /{*namespace_id:2}/{project_id:4}/-/pipeline_schedules/{id}(.{format})
    ├─ DELETE [1521]
    ├─ PATCH [1527]
    ╰─ PUT [1528]

    /{*namespace_id:2}/{project_id:4}/-/pipeline_schedules/{id}/edit(.{format})
    ╰─ GET [1522]

    /{*namespace_id:2}/{project_id:4}/-/pipeline_schedules/{id}/play(.{format})
    ╰─ POST [1525]

    /{*namespace_id:2}/{project_id:4}/-/pipeline_schedules/{id}/take_ownership(.{format})
    ╰─ POST [1526]

    /{*namespace_id:2}/{project_id:4}/-/pipelines(.{format})
    ├─ GET [1537]
    ╰─ POST [1533]

    /{*namespace_id:2}/{project_id:4}/-/pipelines(/{*ref})/latest(.{format})
    ╰─ GET [1544]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/charts(.{format})
    ╰─ GET [1531]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/new(.{format})
    ╰─ GET [1541]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/settings(.{format})
    ├─ GET [1552]
    ├─ PATCH [1553]
    ╰─ PUT [1554]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{id}(.{format})
    ├─ DELETE [1534]
    ╰─ GET [1545]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{id}/builds(.{format})
    ╰─ GET [1529]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{id}/cancel(.{format})
    ╰─ POST [1530]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{id}/codequality_report(.{format})
    ╰─ GET [1532]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{id}/downloadable_artifacts(.{format})
    ╰─ GET [1535]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{id}/failures(.{format})
    ╰─ GET [1536]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{id}/license_count(.{format})
    ╰─ GET [1538]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{id}/licenses(.{format})
    ╰─ GET [1539]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{id}/manual_variables(.{format})
    ╰─ GET [1540]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{id}/retry(.{format})
    ╰─ POST [1542]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{id}/security(.{format})
    ╰─ GET [1543]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{id}/stage(.{format})
    ╰─ GET [1546]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{id}/status(.{format})
    ╰─ GET [1547]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{id}/test_report(.{format})
    ╰─ GET [1548]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{pipeline_id}/stages/{stage_name}/play_manual(.{format})
    ╰─ POST [1549]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{pipeline_id}/tests/summary(.{format})
    ╰─ GET [1551]

    /{*namespace_id:2}/{project_id:4}/-/pipelines/{pipeline_id}/tests/{suite_name}(.{format})
    ╰─ GET [1550]

    /{*namespace_id:2}/{project_id:4}/-/preview/{*id:46}
    ╰─ POST [1094]

    /{*namespace_id:2}/{project_id:4}/-/preview_markdown(.{format})
    ╰─ POST [1009]

    /{*namespace_id:2}/{project_id:4}/-/project_members(.{format})
    ╰─ GET [1557]

    /{*namespace_id:2}/{project_id:4}/-/project_members/leave(.{format})
    ╰─ DELETE [1558]

    /{*namespace_id:2}/{project_id:4}/-/project_members/request_access(.{format})
    ├─ GET [1559]
    ╰─ POST [1560]

    /{*namespace_id:2}/{project_id:4}/-/project_members/{id:39}(.{format})
    ├─ DELETE [1556]
    ├─ PATCH [1562]
    ╰─ PUT [1563]

    /{*namespace_id:2}/{project_id:4}/-/project_members/{id:39}/approve_access_request(.{format})
    ╰─ POST [1555]

    /{*namespace_id:2}/{project_id:4}/-/project_members/{id:39}/resend_invite(.{format})
    ╰─ POST [1561]

    /{*namespace_id:2}/{project_id:4}/-/protected_branches
    ├─ GET [1575]
    ╰─ POST [1573]

    /{*namespace_id:2}/{project_id:4}/-/protected_branches/{id:42}
    ├─ DELETE [1574]
    ├─ GET [1576]
    ├─ PATCH [1577]
    ╰─ PUT [1578]

    /{*namespace_id:2}/{project_id:4}/-/protected_environments(.{format})
    ╰─ POST [1579]

    /{*namespace_id:2}/{project_id:4}/-/protected_environments/search(.{format})
    ╰─ GET [1581]

    /{*namespace_id:2}/{project_id:4}/-/protected_environments/{id:3}(.{format})
    ├─ DELETE [1580]
    ├─ PATCH [1582]
    ╰─ PUT [1583]

    /{*namespace_id:2}/{project_id:4}/-/protected_tags
    ├─ GET [1586]
    ╰─ POST [1584]

    /{*namespace_id:2}/{project_id:4}/-/protected_tags/{id:42}
    ├─ DELETE [1585]
    ├─ GET [1587]
    ├─ PATCH [1588]
    ╰─ PUT [1589]

    /{*namespace_id:2}/{project_id:4}/-/push_rules/{id:3}(.{format})
    ├─ PATCH [1590]
    ╰─ PUT [1591]

    /{*namespace_id:2}/{project_id:4}/-/quality/test_cases(.{format})
    ╰─ GET [1592]

    /{*namespace_id:2}/{project_id:4}/-/quality/test_cases/new(.{format})
    ╰─ GET [1593]

    /{*namespace_id:2}/{project_id:4}/-/quality/test_cases/{id}(.{format})
    ╰─ GET [1594]

    /{*namespace_id:2}/{project_id:4}/-/raw/{*id:46}
    ╰─ GET [1595]

    /{*namespace_id:2}/{project_id:4}/-/refs/switch
    ╰─ GET [1601]

    /{*namespace_id:2}/{project_id:4}/-/refs/{id:42}/logs_tree
    ╰─ GET [1599]

    /{*namespace_id:2}/{project_id:4}/-/refs/{id:43}/logs_tree/{*path:44}
    ╰─ GET [1600]

    /{*namespace_id:2}/{project_id:4}/-/releases(.{format})
    ╰─ GET [1610]

    /{*namespace_id:2}/{project_id:4}/-/releases.json
    ╰─ GET [7]

    /{*namespace_id:2}/{project_id:4}/-/releases/inbox(.{format})
    ╰─ POST [6]

    /{*namespace_id:2}/{project_id:4}/-/releases/new(.{format})
    ╰─ GET [1612]

    /{*namespace_id:2}/{project_id:4}/-/releases/outbox(.{format})
    ╰─ GET [8]

    /{*namespace_id:2}/{project_id:4}/-/releases/permalink/latest(/)({*suffix_path})
    ╰─ GET [1611]

    /{*namespace_id:2}/{project_id:4}/-/releases/{tag:40}(.{format})
    ╰─ GET [1613]

    /{*namespace_id:2}/{project_id:4}/-/releases/{tag:40}/downloads/{*filepath}
    ╰─ GET [1608]

    /{*namespace_id:2}/{project_id:4}/-/releases/{tag:40}/edit(.{format})
    ╰─ GET [1609]

    /{*namespace_id:2}/{project_id:4}/-/releases/{tag:40}/evidences/{id}(.{format})
    ╰─ GET [1614]

    /{*namespace_id:2}/{project_id:4}/-/repository(.{format})
    ╰─ POST [1616]

    /{*namespace_id:2}/{project_id:4}/-/requirements_management/requirements(.{format})
    ╰─ GET [1620]

    /{*namespace_id:2}/{project_id:4}/-/requirements_management/requirements/import_csv(.{format})
    ╰─ POST [1619]

    /{*namespace_id:2}/{project_id:4}/-/requirements_management/requirements/import_csv/authorize(.{format})
    ╰─ POST [1618]

    /{*namespace_id:2}/{project_id:4}/-/runners(.{format})
    ╰─ GET [1625]

    /{*namespace_id:2}/{project_id:4}/-/runners/new(.{format})
    ╰─ GET [1626]

    /{*namespace_id:2}/{project_id:4}/-/runners/toggle_group_runners(.{format})
    ╰─ POST [1631]

    /{*namespace_id:2}/{project_id:4}/-/runners/toggle_shared_runners(.{format})
    ╰─ POST [1632]

    /{*namespace_id:2}/{project_id:4}/-/runners/{id}(.{format})
    ├─ DELETE [1623]
    ├─ GET [1630]
    ├─ PATCH [1633]
    ╰─ PUT [1634]

    /{*namespace_id:2}/{project_id:4}/-/runners/{id}/edit(.{format})
    ╰─ GET [1624]

    /{*namespace_id:2}/{project_id:4}/-/runners/{id}/pause(.{format})
    ╰─ POST [1627]

    /{*namespace_id:2}/{project_id:4}/-/runners/{id}/register(.{format})
    ╰─ GET [1628]

    /{*namespace_id:2}/{project_id:4}/-/runners/{id}/resume(.{format})
    ╰─ POST [1629]

    /{*namespace_id:2}/{project_id:4}/-/schema/{branch}/{*filename}
    ╰─ GET [1763]

    /{*namespace_id:2}/{project_id:4}/-/secrets(/{*vueroute})(.{format})
    ╰─ GET [1635]

    /{*namespace_id:2}/{project_id:4}/-/security/compliance_dashboard(/{*vueroute})(.{format})
    ╰─ GET [1637]

    /{*namespace_id:2}/{project_id:4}/-/security/configuration(.{format})
    ╰─ GET [1638]

    /{*namespace_id:2}/{project_id:4}/-/security/configuration/api_fuzzing(.{format})
    ╰─ GET [1636]

    /{*namespace_id:2}/{project_id:4}/-/security/configuration/corpus_management(.{format})
    ╰─ GET [1639]

    /{*namespace_id:2}/{project_id:4}/-/security/configuration/dast(.{format})
    ╰─ GET [1641]

    /{*namespace_id:2}/{project_id:4}/-/security/configuration/profile_library(.{format})
    ╰─ GET [1642]

    /{*namespace_id:2}/{project_id:4}/-/security/configuration/profile_library/dast_scanner_profiles/new(.{format})
    ╰─ GET [1644]

    /{*namespace_id:2}/{project_id:4}/-/security/configuration/profile_library/dast_scanner_profiles/{id}/edit(.{format})
    ╰─ GET [1643]

    /{*namespace_id:2}/{project_id:4}/-/security/configuration/profile_library/dast_site_profiles/new(.{format})
    ╰─ GET [1646]

    /{*namespace_id:2}/{project_id:4}/-/security/configuration/profile_library/dast_site_profiles/{id}/edit(.{format})
    ╰─ GET [1645]

    /{*namespace_id:2}/{project_id:4}/-/security/configuration/sast(.{format})
    ╰─ GET [1652]

    /{*namespace_id:2}/{project_id:4}/-/security/configuration/secret_detection(.{format})
    ╰─ GET [1654]

    /{*namespace_id:2}/{project_id:4}/-/security/dashboard(.{format})
    ╰─ GET [1640]

    /{*namespace_id:2}/{project_id:4}/-/security/discover(.{format})
    ╰─ GET [1647]

    /{*namespace_id:2}/{project_id:4}/-/security/policies(.{format})
    ╰─ GET [1649]

    /{*namespace_id:2}/{project_id:4}/-/security/policies/new(.{format})
    ╰─ GET [1650]

    /{*namespace_id:2}/{project_id:4}/-/security/policies/schema(.{format})
    ╰─ GET [1651]

    /{*namespace_id:2}/{project_id:4}/-/security/policies/{id:0}/edit(.{format})
    ╰─ GET [1648]

    /{*namespace_id:2}/{project_id:4}/-/security/scanned_resources(.{format})
    ╰─ GET [1653]

    /{*namespace_id:2}/{project_id:4}/-/security/vulnerabilities/new(.{format})
    ╰─ GET [1656]

    /{*namespace_id:2}/{project_id:4}/-/security/vulnerabilities/{id}(.{format})
    ╰─ GET [1657]

    /{*namespace_id:2}/{project_id:4}/-/security/vulnerabilities/{id}/discussions(.{format})
    ╰─ GET [1655]

    /{*namespace_id:2}/{project_id:4}/-/security/vulnerabilities/{vulnerability_id}/notes(.{format})
    ├─ GET [1660]
    ╰─ POST [1658]

    /{*namespace_id:2}/{project_id:4}/-/security/vulnerabilities/{vulnerability_id}/notes/{id:3}(.{format})
    ├─ DELETE [1659]
    ├─ PATCH [1662]
    ╰─ PUT [1663]

    /{*namespace_id:2}/{project_id:4}/-/security/vulnerabilities/{vulnerability_id}/notes/{id:3}/toggle_award_emoji(.{format})
    ╰─ POST [1661]

    /{*namespace_id:2}/{project_id:4}/-/security/vulnerability_report(.{format})
    ╰─ GET [1664]

    /{*namespace_id:2}/{project_id:4}/-/service_desk/custom_email(.{format})
    ├─ DELETE [1668]
    ├─ GET [1669]
    ├─ PATCH [1670]
    ├─ POST [1667]
    ╰─ PUT [1671]

    /{*namespace_id:2}/{project_id:4}/-/settings/access_tokens(.{format})
    ├─ GET [1674]
    ╰─ POST [1673]

    /{*namespace_id:2}/{project_id:4}/-/settings/access_tokens/{id}/revoke(.{format})
    ╰─ PUT [1675]

    /{*namespace_id:2}/{project_id:4}/-/settings/analytics(.{format})
    ├─ GET [1676]
    ├─ PATCH [1677]
    ╰─ PUT [1678]

    /{*namespace_id:2}/{project_id:4}/-/settings/ci_cd(.{format})
    ├─ GET [1684]
    ├─ PATCH [1685]
    ╰─ PUT [1686]

    /{*namespace_id:2}/{project_id:4}/-/settings/ci_cd/deploy_token/create(.{format})
    ╰─ POST [1705]

    /{*namespace_id:2}/{project_id:4}/-/settings/ci_cd/export_job_token_authorizations(.{format})
    ╰─ GET [1680]

    /{*namespace_id:2}/{project_id:4}/-/settings/ci_cd/reset_cache(.{format})
    ╰─ POST [1681]

    /{*namespace_id:2}/{project_id:4}/-/settings/ci_cd/reset_registration_token(.{format})
    ╰─ PUT [1682]

    /{*namespace_id:2}/{project_id:4}/-/settings/ci_cd/runner_setup_scripts(.{format})
    ╰─ GET [1683]

    /{*namespace_id:2}/{project_id:4}/-/settings/integrations(.{format})
    ╰─ GET [1690]

    /{*namespace_id:2}/{project_id:4}/-/settings/integrations/{id:0}(.{format})
    ├─ PATCH [1692]
    ╰─ PUT [1693]

    /{*namespace_id:2}/{project_id:4}/-/settings/integrations/{id:0}/edit(.{format})
    ╰─ GET [1689]

    /{*namespace_id:2}/{project_id:4}/-/settings/integrations/{id:0}/test(.{format})
    ╰─ PUT [1691]

    /{*namespace_id:2}/{project_id:4}/-/settings/integrations/{integration_id:0}/hook_logs/{id:0}(.{format})
    ╰─ GET [1688]

    /{*namespace_id:2}/{project_id:4}/-/settings/integrations/{integration_id:0}/hook_logs/{id:0}/retry(.{format})
    ╰─ POST [1687]

    /{*namespace_id:2}/{project_id:4}/-/settings/merge_requests(.{format})
    ├─ GET [1694]
    ├─ PATCH [1695]
    ╰─ PUT [1696]

    /{*namespace_id:2}/{project_id:4}/-/settings/operations(.{format})
    ├─ GET [1699]
    ├─ PATCH [1700]
    ╰─ PUT [1701]

    /{*namespace_id:2}/{project_id:4}/-/settings/operations/reset_alerting_token(.{format})
    ╰─ POST [1697]

    /{*namespace_id:2}/{project_id:4}/-/settings/operations/reset_pagerduty_token(.{format})
    ╰─ POST [1698]

    /{*namespace_id:2}/{project_id:4}/-/settings/packages_and_registries(.{format})
    ╰─ GET [1703]

    /{*namespace_id:2}/{project_id:4}/-/settings/packages_and_registries/cleanup_image_tags(.{format})
    ╰─ GET [1702]

    /{*namespace_id:2}/{project_id:4}/-/settings/repository(.{format})
    ├─ GET [1707]
    ├─ PATCH [1708]
    ╰─ PUT [1709]

    /{*namespace_id:2}/{project_id:4}/-/settings/repository/branch_rules(.{format})
    ╰─ GET [1679]

    /{*namespace_id:2}/{project_id:4}/-/settings/repository/cleanup(.{format})
    ╰─ POST [1704]

    /{*namespace_id:2}/{project_id:4}/-/settings/repository/deploy_token/create(.{format})
    ╰─ POST [1706]

    /{*namespace_id:2}/{project_id:4}/-/settings/slack(.{format})
    ├─ DELETE [1710]
    ├─ PATCH [1713]
    ╰─ PUT [1714]

    /{*namespace_id:2}/{project_id:4}/-/settings/slack/edit(.{format})
    ╰─ GET [1711]

    /{*namespace_id:2}/{project_id:4}/-/settings/slack/slack_auth(.{format})
    ╰─ GET [1712]

    /{*namespace_id:2}/{project_id:4}/-/snippets(.{format})
    ╰─ GET [1716]

    /{*namespace_id:2}/{project_id:4}/-/snippets/new(.{format})
    ╰─ GET [1718]

    /{*namespace_id:2}/{project_id:4}/-/snippets/{id:3}(.{format})
    ╰─ GET [1721]

    /{*namespace_id:2}/{project_id:4}/-/snippets/{id:3}/edit(.{format})
    ╰─ GET [1715]

    /{*namespace_id:2}/{project_id:4}/-/snippets/{id:3}/mark_as_spam(.{format})
    ╰─ POST [1717]

    /{*namespace_id:2}/{project_id:4}/-/snippets/{id:3}/raw(.{format})
    ╰─ GET [1719]

    /{*namespace_id:2}/{project_id:4}/-/snippets/{id:3}/toggle_award_emoji(.{format})
    ╰─ POST [1722]

    /{*namespace_id:2}/{project_id:4}/-/snippets/{snippet_id:3}/raw/{ref}/{*path}
    ╰─ GET [1723]

    /{*namespace_id:2}/{project_id:4}/-/starrers(.{format})
    ╰─ GET [1724]

    /{*namespace_id:2}/{project_id:4}/-/subscriptions(.{format})
    ╰─ POST [1725]

    /{*namespace_id:2}/{project_id:4}/-/subscriptions/{id}(.{format})
    ╰─ DELETE [1726]

    /{*namespace_id:2}/{project_id:4}/-/tags
    ├─ GET [1729]
    ╰─ POST [1727]

    /{*namespace_id:2}/{project_id:4}/-/tags/new
    ╰─ GET [1730]

    /{*namespace_id:2}/{project_id:4}/-/tags/{id:42}
    ├─ DELETE [1728]
    ╰─ GET [1731]

    /{*namespace_id:2}/{project_id:4}/-/target_branch_rules(.{format})
    ├─ GET [1734]
    ╰─ POST [1732]

    /{*namespace_id:2}/{project_id:4}/-/target_branch_rules/{id}(.{format})
    ╰─ DELETE [1733]

    /{*namespace_id:2}/{project_id:4}/-/terraform(.{format})
    ╰─ GET [1738]

    /{*namespace_id:2}/{project_id:4}/-/terraform_module_registry(.{format})
    ╰─ GET [1496]

    /{*namespace_id:2}/{project_id:4}/-/terraform_module_registry/{id}(.{format})
    ╰─ GET [1497]

    /{*namespace_id:2}/{project_id:4}/-/tracing(.{format})
    ╰─ GET [1740]

    /{*namespace_id:2}/{project_id:4}/-/tracing/{id}(.{format})
    ╰─ GET [1741]

    /{*namespace_id:2}/{project_id:4}/-/tree/{*id:46}
    ╰─ GET [1743]

    /{*namespace_id:2}/{project_id:4}/-/triggers(.{format})
    ├─ GET [1747]
    ╰─ POST [1745]

    /{*namespace_id:2}/{project_id:4}/-/triggers/{id}(.{format})
    ├─ DELETE [1746]
    ├─ PATCH [1748]
    ╰─ PUT [1749]

    /{*namespace_id:2}/{project_id:4}/-/update/{*id:46}
    ╰─ PUT [1098]

    /{*namespace_id:2}/{project_id:4}/-/usage_quotas(.{format})
    ╰─ GET [1753]

    /{*namespace_id:2}/{project_id:4}/-/value_stream_analytics(.{format})
    ╰─ GET [1160]

    /{*namespace_id:2}/{project_id:4}/-/value_stream_analytics/events/code(.{format})
    ╰─ GET [1161]

    /{*namespace_id:2}/{project_id:4}/-/value_stream_analytics/events/issue(.{format})
    ╰─ GET [1162]

    /{*namespace_id:2}/{project_id:4}/-/value_stream_analytics/events/plan(.{format})
    ╰─ GET [1163]

    /{*namespace_id:2}/{project_id:4}/-/value_stream_analytics/events/production(.{format})
    ╰─ GET [1164]

    /{*namespace_id:2}/{project_id:4}/-/value_stream_analytics/events/review(.{format})
    ╰─ GET [1165]

    /{*namespace_id:2}/{project_id:4}/-/value_stream_analytics/events/staging(.{format})
    ╰─ GET [1166]

    /{*namespace_id:2}/{project_id:4}/-/value_stream_analytics/events/test(.{format})
    ╰─ GET [1167]

    /{*namespace_id:2}/{project_id:4}/-/variables(.{format})
    ├─ GET [1754]
    ├─ PATCH [1755]
    ╰─ PUT [1756]

    /{*namespace_id:2}/{project_id:4}/-/vulnerability_feedback(.{format})
    ├─ GET [1760]
    ╰─ POST [1758]

    /{*namespace_id:2}/{project_id:4}/-/vulnerability_feedback/count(.{format})
    ╰─ GET [1757]

    /{*namespace_id:2}/{project_id:4}/-/vulnerability_feedback/{id:3}(.{format})
    ├─ DELETE [1759]
    ├─ PATCH [1761]
    ╰─ PUT [1762]

    /{*namespace_id:2}/{project_id:4}/-/wikis(.{format})
    ├─ GET [1802]
    ╰─ POST [1769]

    /{*namespace_id:2}/{project_id:4}/-/wikis/-/confluence(.{format})
    ╰─ GET [1159]

    /{*namespace_id:2}/{project_id:4}/-/wikis/git_access(.{format})
    ╰─ GET [1773]

    /{*namespace_id:2}/{project_id:4}/-/wikis/new(.{format})
    ╰─ GET [1775]

    /{*namespace_id:2}/{project_id:4}/-/wikis/pages(.{format})
    ╰─ GET [1776]

    /{*namespace_id:2}/{project_id:4}/-/wikis/templates(.{format})
    ╰─ GET [1780]

    /{*namespace_id:2}/{project_id:4}/-/wikis/{*id}
    ├─ DELETE [1770]
    ├─ GET [1779]
    ╰─ PUT [1781]

    /{*namespace_id:2}/{project_id:4}/-/wikis/{*id}/diff
    ╰─ GET [1771]

    /{*namespace_id:2}/{project_id:4}/-/wikis/{*id}/edit
    ╰─ GET [1772]

    /{*namespace_id:2}/{project_id:4}/-/wikis/{*id}/history
    ╰─ GET [1774]

    /{*namespace_id:2}/{project_id:4}/-/wikis/{*id}/preview_markdown
    ╰─ POST [1777]

    /{*namespace_id:2}/{project_id:4}/-/wikis/{*id}/raw
    ╰─ GET [1778]

    /{*namespace_id:2}/{project_id:4}/-/work_items/import_csv(.{format})
    ╰─ POST [1783]

    /{*namespace_id:2}/{project_id:4}/-/work_items/import_csv/authorize(.{format})
    ╰─ POST [1782]

    /{*namespace_id:2}/{project_id:4}/-/work_items/{iid}(.{format})
    ╰─ GET [1784]

    /{*namespace_id:2}/{project_id:4}/-/work_items/{iid}/designs(/{*vueroute})
    ╰─ GET [1785]

    /{*namespace_id:2}/{project_id:4}/-/{noteable_type}/{noteable_id}/discussions/{id:49}(.{format})
    ╰─ GET [1189]

    /{*namespace_id:2}/{project_id:4}/-/{noteable_type}/{noteable_id}/discussions/{id:49}/resolve(.{format})
    ├─ DELETE [1190]
    ╰─ POST [1188]

    /{*namespace_id:2}/{project_id:4}/alert_management(/{*rest})(.{format})
    ├─ DELETE [1807]
    ├─ GET [1807]
    ├─ PATCH [1807]
    ╰─ POST [1807]

    /{*namespace_id:2}/{project_id:4}/alerts/notify(.{format})
    ╰─ POST [1024]

    /{*namespace_id:2}/{project_id:4}/alerts/notify/{name}/{endpoint_identifier:51}(.{format})
    ╰─ POST [1025]

    /{*namespace_id:2}/{project_id:4}/audit_events(/{*rest})(.{format})
    ├─ DELETE [1808]
    ├─ GET [1808]
    ├─ PATCH [1808]
    ╰─ POST [1808]

    /{*namespace_id:2}/{project_id:4}/badges(.{format})
    ╰─ GET [1081]

    /{*namespace_id:2}/{project_id:4}/badges/{*ref}/coverage(.{format:48})
    ╰─ GET [1080]

    /{*namespace_id:2}/{project_id:4}/badges/{*ref}/pipeline(.{format:48})
    ╰─ GET [1082]

    /{*namespace_id:2}/{project_id:4}/blame/{*id:46}
    ╰─ GET [1086]

    /{*namespace_id:2}/{project_id:4}/blob/{*id:46}
    ╰─ GET [1096]

    /{*namespace_id:2}/{project_id:4}/builds(.{format})
    ╰─ GET [1113]

    /{*namespace_id:2}/{project_id:4}/builds/artifacts/{*ref_name_and_path}
    ╰─ GET [1111]

    /{*namespace_id:2}/{project_id:4}/builds/{build_id:3}/artifacts/browse(/{*path})
    ╰─ GET [1108]

    /{*namespace_id:2}/{project_id:4}/builds/{build_id:3}/artifacts/download(.{format})
    ╰─ GET [1109]

    /{*namespace_id:2}/{project_id:4}/builds/{build_id:3}/artifacts/file/{*path}
    ╰─ GET [1110]

    /{*namespace_id:2}/{project_id:4}/builds/{build_id:3}/artifacts/raw/{*path}
    ╰─ GET [1112]

    /{*namespace_id:2}/{project_id:4}/builds/{id:3}(.{format})
    ╰─ GET [1115]

    /{*namespace_id:2}/{project_id:4}/builds/{id:3}/raw(.{format})
    ╰─ GET [1114]

    /{*namespace_id:2}/{project_id:4}/clusters(/{*rest})(.{format})
    ├─ DELETE [1809]
    ├─ GET [1809]
    ├─ PATCH [1809]
    ╰─ POST [1809]

    /{*namespace_id:2}/{project_id:4}/commit(/{*rest})(.{format})
    ├─ DELETE [1810]
    ├─ GET [1810]
    ├─ PATCH [1810]
    ╰─ POST [1810]

    /{*namespace_id:2}/{project_id:4}/commits(/{*rest})(.{format})
    ├─ DELETE [1811]
    ├─ GET [1811]
    ├─ PATCH [1811]
    ╰─ POST [1811]

    /{*namespace_id:2}/{project_id:4}/compare(/{*rest})(.{format})
    ├─ DELETE [1812]
    ├─ GET [1812]
    ├─ PATCH [1812]
    ╰─ POST [1812]

    /{*namespace_id:2}/{project_id:4}/container_registry(.{format})
    ╰─ GET [1603]

    /{*namespace_id:2}/{project_id:4}/container_registry/{id}(.{format})
    ├─ DELETE [1602]
    ╰─ GET [1604]

    /{*namespace_id:2}/{project_id:4}/cycle_analytics(/{*rest})(.{format})
    ├─ DELETE [1813]
    ├─ GET [1813]
    ├─ PATCH [1813]
    ╰─ POST [1813]

    /{*namespace_id:2}/{project_id:4}/dependencies(/{*rest})(.{format})
    ├─ DELETE [1814]
    ├─ GET [1814]
    ├─ PATCH [1814]
    ╰─ POST [1814]

    /{*namespace_id:2}/{project_id:4}/description_templates/names/{template_type:50}(.{format:37})
    ╰─ GET [1736]

    /{*namespace_id:2}/{project_id:4}/edit/{*id:46}
    ╰─ GET [1837]

    /{*namespace_id:2}/{project_id:4}/environments(/{*rest})(.{format})
    ├─ DELETE [1815]
    ├─ GET [1815]
    ├─ PATCH [1815]
    ╰─ POST [1815]

    /{*namespace_id:2}/{project_id:4}/error_tracking(/{*rest})(.{format})
    ├─ DELETE [1816]
    ├─ GET [1816]
    ├─ PATCH [1816]
    ╰─ POST [1816]

    /{*namespace_id:2}/{project_id:4}/files(/{*rest})(.{format})
    ├─ DELETE [1817]
    ├─ GET [1817]
    ├─ PATCH [1817]
    ╰─ POST [1817]

    /{*namespace_id:2}/{project_id:4}/find_file(/{*rest})(.{format})
    ├─ DELETE [1818]
    ├─ GET [1818]
    ├─ PATCH [1818]
    ╰─ POST [1818]

    /{*namespace_id:2}/{project_id:4}/hooks(/{*rest})(.{format})
    ├─ DELETE [1819]
    ├─ GET [1819]
    ├─ PATCH [1819]
    ╰─ POST [1819]

    /{*namespace_id:2}/{project_id:4}/ide_terminals(.{format:37})
    ╰─ POST [1766]

    /{*namespace_id:2}/{project_id:4}/ide_terminals/check_config(.{format:37})
    ╰─ POST [1765]

    /{*namespace_id:2}/{project_id:4}/ide_terminals/{id:3}(.{format:37})
    ╰─ GET [1768]

    /{*namespace_id:2}/{project_id:4}/ide_terminals/{id:3}/cancel(.{format:37})
    ╰─ POST [1764]

    /{*namespace_id:2}/{project_id:4}/ide_terminals/{id:3}/retry(.{format:37})
    ╰─ POST [1767]

    /{*namespace_id:2}/{project_id:4}/insights(.{format})
    ╰─ GET [1278]

    /{*namespace_id:2}/{project_id:4}/insights/query(.{format})
    ╰─ POST [1277]

    /{*namespace_id:2}/{project_id:4}/issues(/{*rest})(.{format})
    ├─ DELETE [1820]
    ├─ GET [1820]
    ├─ PATCH [1820]
    ╰─ POST [1820]

    /{*namespace_id:2}/{project_id:4}/mattermost(/{*rest})(.{format})
    ├─ DELETE [1821]
    ├─ GET [1821]
    ├─ PATCH [1821]
    ╰─ POST [1821]

    /{*namespace_id:2}/{project_id:4}/merge_requests(/{*rest})(.{format})
    ├─ DELETE [1822]
    ├─ GET [1822]
    ├─ PATCH [1822]
    ╰─ POST [1822]

    /{*namespace_id:2}/{project_id:4}/mirror(/{*rest})(.{format})
    ├─ DELETE [1823]
    ├─ GET [1823]
    ├─ PATCH [1823]
    ╰─ POST [1823]

    /{*namespace_id:2}/{project_id:4}/new/{*id:46}
    ╰─ GET [1839]

    /{*namespace_id:2}/{project_id:4}/noteable/{target_type}/{target_id}/notes(.{format})
    ╰─ GET [1486]

    /{*namespace_id:2}/{project_id:4}/notes(.{format})
    ╰─ POST [1483]

    /{*namespace_id:2}/{project_id:4}/notes/{id:3}(.{format})
    ├─ DELETE [1485]
    ├─ PATCH [1491]
    ╰─ PUT [1492]

    /{*namespace_id:2}/{project_id:4}/notes/{id:3}/delete_attachment(.{format})
    ╰─ DELETE [1484]

    /{*namespace_id:2}/{project_id:4}/notes/{id:3}/outdated_line_change(.{format})
    ╰─ GET [1487]

    /{*namespace_id:2}/{project_id:4}/notes/{id:3}/resolve(.{format})
    ├─ DELETE [1490]
    ╰─ POST [1488]

    /{*namespace_id:2}/{project_id:4}/notes/{id:3}/toggle_award_emoji(.{format})
    ╰─ POST [1489]

    /{*namespace_id:2}/{project_id:4}/pages(.{format})
    ├─ DELETE [1502]
    ├─ GET [1504]
    ├─ PATCH [1505]
    ╰─ PUT [1506]

    /{*namespace_id:2}/{project_id:4}/pages/domains(.{format})
    ╰─ POST [1508]

    /{*namespace_id:2}/{project_id:4}/pages/domains/new(.{format})
    ╰─ GET [1511]

    /{*namespace_id:2}/{project_id:4}/pages/domains/{id:0}(.{format})
    ├─ DELETE [1509]
    ├─ GET [1513]
    ├─ PATCH [1514]
    ╰─ PUT [1515]

    /{*namespace_id:2}/{project_id:4}/pages/domains/{id:0}/clean_certificate(.{format})
    ╰─ DELETE [1507]

    /{*namespace_id:2}/{project_id:4}/pages/domains/{id:0}/edit(.{format})
    ╰─ GET [1510]

    /{*namespace_id:2}/{project_id:4}/pages/domains/{id:0}/retry_auto_ssl(.{format})
    ╰─ POST [1512]

    /{*namespace_id:2}/{project_id:4}/pages/domains/{id:0}/verify(.{format})
    ╰─ POST [1516]

    /{*namespace_id:2}/{project_id:4}/pages/new(.{format})
    ╰─ GET [1503]

    /{*namespace_id:2}/{project_id:4}/path_locks(.{format})
    ╰─ GET [1518]

    /{*namespace_id:2}/{project_id:4}/path_locks/toggle(.{format})
    ╰─ POST [1519]

    /{*namespace_id:2}/{project_id:4}/path_locks/{id}(.{format})
    ╰─ DELETE [1517]

    /{*namespace_id:2}/{project_id:4}/pipeline_schedules(/{*rest})(.{format})
    ├─ DELETE [1824]
    ├─ GET [1824]
    ├─ PATCH [1824]
    ╰─ POST [1824]

    /{*namespace_id:2}/{project_id:4}/pipelines(/{*rest})(.{format})
    ├─ DELETE [1825]
    ├─ GET [1825]
    ├─ PATCH [1825]
    ╰─ POST [1825]

    /{*namespace_id:2}/{project_id:4}/prometheus/alerts/notify(.{format})
    ╰─ POST [1026]

    /{*namespace_id:2}/{project_id:4}/prometheus/alerts/{id:3}/metrics_dashboard(.{format})
    ╰─ GET [1027]

    /{*namespace_id:2}/{project_id:4}/prometheus/metrics(.{format})
    ├─ GET [1568]
    ╰─ POST [1565]

    /{*namespace_id:2}/{project_id:4}/prometheus/metrics/active_common(.{format})
    ╰─ GET [1564]

    /{*namespace_id:2}/{project_id:4}/prometheus/metrics/new(.{format})
    ╰─ GET [1569]

    /{*namespace_id:2}/{project_id:4}/prometheus/metrics/validate_query(.{format})
    ╰─ POST [1572]

    /{*namespace_id:2}/{project_id:4}/prometheus/metrics/{id:0}(.{format})
    ├─ DELETE [1566]
    ├─ PATCH [1570]
    ╰─ PUT [1571]

    /{*namespace_id:2}/{project_id:4}/prometheus/metrics/{id:0}/edit(.{format})
    ╰─ GET [1567]

    /{*namespace_id:2}/{project_id:4}/protected_environments(/{*rest})(.{format})
    ├─ DELETE [1826]
    ├─ GET [1826]
    ├─ PATCH [1826]
    ╰─ POST [1826]

    /{*namespace_id:2}/{project_id:4}/raw/{*id:46}
    ╰─ GET [1596]

    /{*namespace_id:2}/{project_id:4}/refs/switch
    ╰─ GET [1841]

    /{*namespace_id:2}/{project_id:4}/refs/{id:42}/logs_tree
    ╰─ GET [1840]

    /{*namespace_id:2}/{project_id:4}/refs/{id:43}/logs_tree/{*path:44}
    ╰─ GET [1803]

    /{*namespace_id:2}/{project_id:4}/registry/repository/{repository_id}/tags
    ╰─ GET [1607]

    /{*namespace_id:2}/{project_id:4}/registry/repository/{repository_id}/tags/bulk_destroy
    ╰─ DELETE [1605]

    /{*namespace_id:2}/{project_id:4}/registry/repository/{repository_id}/tags/{id:52}
    ╰─ DELETE [1606]

    /{*namespace_id:2}/{project_id:4}/repository(.{format})
    ╰─ POST [1617]

    /{*namespace_id:2}/{project_id:4}/restore(.{format})
    ╰─ POST [1013]

    /{*namespace_id:2}/{project_id:4}/runner_projects(.{format})
    ╰─ POST [1621]

    /{*namespace_id:2}/{project_id:4}/runner_projects/{id}(.{format})
    ╰─ DELETE [1622]

    /{*namespace_id:2}/{project_id:4}/runners(/{*rest})(.{format})
    ├─ DELETE [1827]
    ├─ GET [1827]
    ├─ PATCH [1827]
    ╰─ POST [1827]

    /{*namespace_id:2}/{project_id:4}/security(/{*rest})(.{format})
    ├─ DELETE [1828]
    ├─ GET [1828]
    ├─ PATCH [1828]
    ╰─ POST [1828]

    /{*namespace_id:2}/{project_id:4}/serverless(/{*rest})(.{format})
    ├─ DELETE [1829]
    ├─ GET [1829]
    ├─ PATCH [1829]
    ╰─ POST [1829]

    /{*namespace_id:2}/{project_id:4}/service_desk(.{format})
    ├─ GET [1665]
    ╰─ PUT [1666]

    /{*namespace_id:2}/{project_id:4}/service_ping/web_ide_pipelines_count(.{format})
    ╰─ POST [1672]

    /{*namespace_id:2}/{project_id:4}/snippets(/{*rest})(.{format})
    ├─ DELETE [1830]
    ├─ GET [1830]
    ├─ PATCH [1830]
    ╰─ POST [1830]

    /{*namespace_id:2}/{project_id:4}/snippets/{id:3}/raw
    ╰─ GET [1720]

    /{*namespace_id:2}/{project_id:4}/tags(/{*rest})(.{format})
    ├─ DELETE [1831]
    ├─ GET [1831]
    ├─ PATCH [1831]
    ╰─ POST [1831]

    /{*namespace_id:2}/{project_id:4}/templates/{template_type:50}(.{format:37})
    ╰─ GET [1735]

    /{*namespace_id:2}/{project_id:4}/templates/{template_type:50}/{key:0}(.{format:37})
    ╰─ GET [1737]

    /{*namespace_id:2}/{project_id:4}/todos(.{format})
    ╰─ POST [1739]

    /{*namespace_id:2}/{project_id:4}/tree/{*id:46}
    ╰─ GET [1744]

    /{*namespace_id:2}/{project_id:4}/triggers(/{*rest})(.{format})
    ├─ DELETE [1832]
    ├─ GET [1832]
    ├─ PATCH [1832]
    ╰─ POST [1832]

    /{*namespace_id:2}/{project_id:4}/uploads(.{format})
    ╰─ POST [1751]

    /{*namespace_id:2}/{project_id:4}/uploads/authorize(.{format})
    ╰─ POST [1750]

    /{*namespace_id:2}/{project_id:4}/uploads/{secret}/{filename:0}
    ╰─ GET [1752]

    /{*namespace_id:2}/{project_id:4}/variables(/{*rest})(.{format})
    ├─ DELETE [1833]
    ├─ GET [1833]
    ├─ PATCH [1833]
    ╰─ POST [1833]

    /{*namespace_id:2}/{project_id:4}/vulnerability_feedback(/{*rest})(.{format})
    ├─ DELETE [1834]
    ├─ GET [1834]
    ├─ PATCH [1834]
    ╰─ POST [1834]

    /{*namespace_id:2}/{project_id:4}/wikis(/{*rest})(.{format})
    ├─ DELETE [1835]
    ├─ GET [1835]
    ├─ PATCH [1835]
    ╰─ POST [1835]

    /{*namespace_id:2}/{project_id:4}/{*all}(.{format})
    ├─ DELETE [284]
    ├─ PATCH [287]
    ├─ POST [289]
    ╰─ PUT [291]

    /{*repository_path:5}/git-receive-pack
    ╰─ POST [1885]

    /{*repository_path:5}/git-upload-pack
    ╰─ POST [1887]

    /{*repository_path:5}/gitlab-lfs/objects/{*oid:6}
    ╰─ GET [1921]

    /{*repository_path:5}/gitlab-lfs/objects/{*oid:6}/{*size:7}
    ╰─ PUT [1925]

    /{*repository_path:5}/gitlab-lfs/objects/{*oid:6}/{*size:7}/authorize
    ╰─ PUT [1923]

    /{*repository_path:5}/info/lfs/locks
    ├─ GET [1907]
    ╰─ POST [1901]

    /{*repository_path:5}/info/lfs/locks/new
    ╰─ GET [1909]

    /{*repository_path:5}/info/lfs/locks/verify
    ╰─ POST [1919]

    /{*repository_path:5}/info/lfs/locks/{id}
    ├─ DELETE [1903]
    ├─ GET [1911]
    ├─ PATCH [1915]
    ╰─ PUT [1917]

    /{*repository_path:5}/info/lfs/locks/{id}/edit
    ╰─ GET [1905]

    /{*repository_path:5}/info/lfs/locks/{id}/unlock
    ╰─ POST [1913]

    /{*repository_path:5}/info/lfs/objects
    ╰─ POST [1899]

    /{*repository_path:5}/info/lfs/objects/batch
    ╰─ POST [1895]

    /{*repository_path:5}/info/lfs/objects/{*oid}
    ╰─ GET [1897]

    /{*repository_path:5}/info/refs
    ╰─ GET [1889]

    /{*repository_path:5}/ssh-receive-pack
    ╰─ POST [1891]

    /{*repository_path:5}/ssh-upload-pack
    ╰─ POST [1893]

    /{*repository_path:8}
    ╰─ GET [1804]

    /{*repository_path:9}/info/refs
    ╰─ GET [1805]

    /{*unmatched_route}
    ╰─ GET [285]

    /{username:35}(.{format})
    ╰─ GET [2033]

    /{username:35}.gpg(.{format})
    ╰─ GET [2030]

    /{username:35}.keys(.{format})
    ╰─ GET [2035]
    ");

    Ok(())
}
